{"sentence": "Alaska Air Group’s ALK subsidiary, Alaska Airlines, has announced a partnership with the French Polynesian flag carrier, Air Tahiti Nui, offering customers nonstop options to travel to the islands of Tahiti.", "spans": [[0, 16], [112, 119]], "date": "2022-03-30T15:40:03+00:00", "span_values": ["Alaska Air Group", "carrier"]}
{"sentence": "United Airlines is bringing back several popular nonstop flights from San Francisco International Airport to destinations across North America as well as in Europe, the carrier told me Monday.", "spans": [[0, 15], [169, 176]], "date": "2022-03-28T21:35:29+00:00", "span_values": ["carrier", "United Airlines"]}
{"sentence": "Alphabet (NASDAQ:GOOGL), Amazon (NASDAQ:AMZN), Meta Platforms (NASDAQ:FB) found support to end in the green, while Microsoft (NASDAQ:MSFT) was the exception closing below the flatline, though well off session lows.", "spans": [[0, 8], [25, 31], [47, 51], [115, 124]], "date": "2022-03-25T16:33:53+00:00", "span_values": ["Alphabet", "Microsoft", "Meta", "Amazon"]}
{"sentence": "Alaska Air Group rose more than 1% after Bank of America backed the airline’s financial outlook, saying it was confident the low-cost airline can top the prior high single digit pre-tax margin expectation and reach its new long term target of 11% to 13%.", "spans": [[0, 16], [41, 56]], "date": "2022-03-25T16:33:53+00:00", "span_values": ["Alaska Air Group", "Bank of America"]}
{"sentence": "The carrier stepped up its timeline to transition to an all-Boeing mainline fleet, saying it would unload the last of its Airbus A320 jets “not later than early 2023.”", "spans": [[4, 11], [60, 66]], "date": "2022-03-25T05:32:53+00:00", "span_values": ["carrier", "Boeing"]}
{"sentence": "Shares of Alaska Air Group Inc. rose 1.4% in premarket trading Thursday, after the air carrier detailed its 2022 outlook for capacity and capital expenditures ahead of its investor day.", "spans": [[10, 26], [87, 94]], "date": "2022-03-24T11:15:16+00:00", "span_values": ["Alaska Air Group", "carrier"]}
{"sentence": "Alaska Air Group and Bank of America Renew Long-Term Partnership Agreement.", "spans": [[0, 16], [21, 36]], "date": "2022-03-24T11:01:00+00:00", "span_values": ["Alaska Air Group", "Bank of America"]}
{"sentence": "Continues Longstanding Relationship Through 2030Expanded Partnership will Further Drive Credit Card Acquisition and Loyalty; Strengthened Benefits to be Introduced in the Second Half of 2022NEW YORK, March 24, 2022 /PRNewswire/ -- Alaska Air Group Inc. (NYSE: ALK) and Bank of America (NYSE: BAC) today announced an extension of their co-branded credit card agreement through 2030.", "spans": [[231, 247], [269, 284]], "date": "2022-03-24T11:01:00+00:00", "span_values": ["Alaska Air Group", "Bank of America"]}
{"sentence": "Alaska Air Group and Bank of America today announced an extension of their popular co-branded credit card agreement through 2030.\"Our partnership with Bank of America has been key to strengthening Alaska's brand recognition and building unparalleled customer loyalty.", "spans": [[0, 16], [21, 36], [151, 166]], "date": "2022-03-24T11:01:00+00:00", "span_values": ["Alaska Air Group", "Bank of America"]}
{"sentence": "\"The people of Alaska and Horizon are the foundation of our company and their kind-hearted spirit is why travelers choose to fly with us time and again,\" said Ben Minicucci, Chief Executive Officer of Alaska Air Group.", "spans": [[105, 114], [201, 217]], "date": "2022-03-24T11:00:00+00:00", "span_values": ["Alaska Air Group", "travelers"]}
{"sentence": "While Leaving Caribbean Port Putin’s State Media News Is Interrupted: ‘They’re Lying to You’ U.S. Sewer Data Warns of a New Bump in Covid Cases After LullSeveral of the largest carriers, including United Airlines Holdings Inc. and American Airlines Group Inc., cut their capacity forecasts for the first quarter, while Delta Air Lines Inc. held growth to the low end of a previous range, according to regulatory filings ahead of an investor conference Tuesday.", "spans": [[197, 212], [231, 254], [319, 334]], "date": "2022-03-15T14:48:45+00:00", "span_values": ["Delta Air Lines", "United Airlines", "American Airlines Group"]}
{"sentence": "Coming back to United Airlines, the carrier last flew between Delhi and San Francisco, and between Mumbai and Newark on Mar 2.", "spans": [[15, 30], [36, 43]], "date": "2022-03-10T15:56:03+00:00", "span_values": ["carrier", "United Airlines"]}
{"sentence": "Shares of the entire industry were in the red this week, with Delta Air Lines (NYSE: DAL), United Airlines Holdings (NASDAQ: UAL), American Airlines Group (NASDAQ: AAL), Alaska Air Group (NYSE: ALK), and JetBlue Airways (NASDAQ: JBLU) all down 9% or more for the week as of midday trading on Thursday, according to data provided by S&P Global Market Intelligence.", "spans": [[62, 77], [91, 106], [131, 154], [170, 186], [332, 342]], "date": "2022-03-03T19:32:07+00:00", "span_values": ["Alaska Air Group", "American Airlines Group", "Delta Air Lines", "United Airlines", "S&P Global"]}
