{"sentence": "It’s imperative to mention here that in collaboration with Duke Realty — a leading owner, developer, and manager of logistics and industrial properties — and its joint venture partners Columbus Regional Airport Authority and Capitol Square, Cardinal Health anticipates the new facility to be fully operational by late 2022 or early 2023.Market ProspectsPer a report by Research and Markets, the global healthcare distribution market is anticipated to grow at a CAGR of 6.4% during the forecast period (2019-2025).", "spans": [[59, 70], [241, 256]], "date": "2022-03-31T14:34:02+00:00", "span_values": ["Duke Realty", "Cardinal Health"]}
{"sentence": "Story continuesPrice PerformanceShares of this Zacks Rank #3 (Hold) company have gained 12% on a year-to-date basis, against the industry’s decline of 0.7%.Key PicksSome better-ranked stocks from the broader medical space are AMN Healthcare Services, Inc. AMN, Henry Schein, Inc. HSIC and McKesson Corporation", "spans": [[261, 273], [289, 297]], "date": "2022-03-31T14:34:02+00:00", "span_values": ["Henry Schein", "McKesson"]}
{"sentence": "Zacks Industry Outlook Highlights McKesson, West Pharmaceutical Services and Cardinal Health.", "spans": [[34, 42], [44, 72], [77, 92]], "date": "2022-03-30T13:37:01+00:00", "span_values": ["West Pharmaceutical Services", "McKesson", "Cardinal Health"]}
{"sentence": "MCK, West Pharmaceutical Services Inc. WST and Cardinal Health Inc. CAH.Industry: Dental SuppliesLink: The COVID-19 pandemic — a biological crisis of unprecedented nature — has altered the very nature and dynamics of the healthcare industry.", "spans": [[5, 33], [47, 62]], "date": "2022-03-30T13:37:01+00:00", "span_values": ["West Pharmaceutical Services", "Cardinal Health"]}
{"sentence": "Industry participants like McKesson Corp., West Pharmaceutical Services Inc. and Cardinal Health Inc. are likely to gain from the prospects prevalent.", "spans": [[27, 35], [43, 71], [81, 96]], "date": "2022-03-30T13:37:01+00:00", "span_values": ["West Pharmaceutical Services", "McKesson", "Cardinal Health"]}
{"sentence": "In partnership with Duke Realty, a leading owner, developer, and manager of logistics and industrial properties, along with its joint venture partners Columbus Regional Airport Authority and Capitol Square, Cardinal Health anticipates the new facility to be fully operational by late 2022 or early 2023.\"Our public-private partnership between the Columbus Regional Airport Authority and Capitol Square continues to drive our developments in Rickenbacker Global Logistics Park with direct access to highways, the largest dedicated cargo airport in the world and the rail intermodal terminal for Norfolk Southern,\" said Ben Struewing, Duke Realty's vice president of leasing and development for Ohio.", "spans": [[20, 31], [207, 222], [594, 610], [633, 644]], "date": "2022-03-30T13:00:00+00:00", "span_values": ["Duke Realty", "Norfolk Southern", "Cardinal Health"]}
{"sentence": "Industry participants like McKesson Corporation MCK, West Pharmaceutical Services Inc. WST and Cardinal Health Inc.", "spans": [[27, 35], [53, 81], [95, 110]], "date": "2022-03-29T13:11:01+00:00", "span_values": ["West Pharmaceutical Services", "McKesson", "Cardinal Health"]}
{"sentence": "Per management at Avery Dennison, the collaboration with Cardinal Health is likely to aid in bringing this innovative technology and product offering to the operating room.", "spans": [[18, 32], [57, 72]], "date": "2022-03-21T16:04:04+00:00", "span_values": ["Avery Dennison", "Cardinal Health"]}
{"sentence": "Companies like Tesla, Inc. (NASDAQ:TSLA), Netflix, Inc. (NASDAQ:NFLX), and Eiger BioPharmaceuticals, Inc. (NASDAQ:EIGR) are among the stocks moving up today.", "spans": [[15, 20], [42, 49]], "date": "2022-03-17T19:47:09+00:00", "span_values": ["Tesla", "Netflix"]}
{"sentence": "Occidental Petroleum Corporation (NYSE:OXY) is up 7.8% as of 11:26 AM ET after Warren Buffett’s Berkshire Hathaway Inc (NYSE:BRK-B) revealed that it had increased its stake in the Houston, Texas-based oil and gas exploration and production company by another $1 billion during the first three days of this week.", "spans": [[0, 20], [96, 114]], "date": "2022-03-17T19:47:09+00:00", "span_values": ["Berkshire Hathaway", "Occidental Petroleum"]}
{"sentence": "Following this development, Berkshire Hathaway’s total stake in Occidental Petroleum Corporation (NYSE:OXY) stands at over $7 billion.", "spans": [[28, 46], [64, 84]], "date": "2022-03-17T19:47:09+00:00", "span_values": ["Occidental Petroleum", "Berkshire Hathaway"]}
{"sentence": "Overall, 46 hedge funds held a position in The Mosaic Company (NYSE:MOS) as of Q4 2021.In addition to The Mosaic Company (NYSE:MOS), some of the companies experiencing a rise in stock price today include Tesla, Inc. (NASDAQ:TSLA), Netflix, Inc. (NASDAQ:NFLX), and Eiger BioPharmaceuticals, Inc. (NASDAQ:EIGR).Click to continue reading and see 5 Stocks Gaining Ground on Thursday.", "spans": [[47, 53], [106, 112], [204, 209], [231, 238]], "date": "2022-03-17T19:47:09+00:00", "span_values": ["Tesla", "Mosaic", "Netflix"]}
{"sentence": "(PRNewsfoto/Cardinal Health)The drape features Avery Dennison's patented BeneHold™ CHG adhesive technology, which helps reduce the risk of surgical site contamination with organisms typically associated with surgical site infections (SSIs).", "spans": [[12, 27], [47, 61]], "date": "2022-03-17T12:30:00+00:00", "span_values": ["Avery Dennison", "Cardinal Health"]}
{"sentence": "\"Avery Dennison is delighted to be partnering with Cardinal Health to bring this innovative technology and product offering to the operating room.", "spans": [[1, 15], [51, 66]], "date": "2022-03-17T12:30:00+00:00", "span_values": ["Avery Dennison", "Cardinal Health"]}
{"sentence": "Media Relations, Cardinal Health: Courtney TobinT: +1 (614) 822-4016M: +1 (937) 243-4822courtney.tobin@cardinalhealth.comMedia Relations, Avery Dennison Medical, Product and Technical Inquiries: Barbara Van RymenamM: +32 497 10 32 33 barbara.van.rymenam@eu.averydennison.comMedia Relations, Avery Dennison Medical, General Inquiries: Andrew DeckertM: +1 (224) 374-2109 andrew.deckert@averydennison.com CisionView original content to download multimedia:SOURCE Cardinal Health", "spans": [[17, 32], [138, 152], [291, 305], [460, 475]], "date": "2022-03-17T12:30:00+00:00", "span_values": ["Avery Dennison", "Cardinal Health"]}
{"sentence": "Stocks to ConsiderSome better-ranked stocks from the broader medical space are AMN Healthcare Services, Inc. AMN, Henry Schein, Inc. HSIC and McKesson Corporation MCK.AMN Healthcare surpassed earnings estimates in each of the trailing four quarters, the average surprise being 20%.", "spans": [[114, 126], [142, 150]], "date": "2022-03-15T15:14:03+00:00", "span_values": ["Henry Schein", "McKesson"]}
{"sentence": "Allegiance Corporation -- Moody's affirms Cardinal Health's Baa2 senior unsecured rating, outlook revised to stable from negative.", "spans": [[26, 33], [42, 57]], "date": "2022-03-15T14:10:06+00:00", "span_values": ["Moody's", "Cardinal Health"]}
{"sentence": "Rating Action: Moody's affirms Cardinal Health's Baa2 senior unsecured rating, outlook revised to stable from negativeGlobal Credit Research - 15 Mar 2022New York, March 15, 2022 -- Moody's Investors Service (\"Moody's\") affirmed Cardinal Health, Inc.'s (\"Cardinal\") senior unsecured rating at Baa2 and its commercial paper rating at P-2.", "spans": [[15, 22], [31, 46], [182, 189], [210, 217], [229, 244]], "date": "2022-03-15T14:10:06+00:00", "span_values": ["Moody's", "Cardinal Health"]}
{"sentence": "Cardinal's ratings are constrained by high customer concentration as two customers  CVS Health (Baa2 stable) and OptumRx (part of UnitedHealth Group Inc A3 stable) account for 41% of revenues.", "spans": [[85, 95], [131, 149]], "date": "2022-03-15T14:10:06+00:00", "span_values": ["CVS Health", "UnitedHealth Group"]}
{"sentence": "46 of 49 Eligible States and Over 90 Percent of Litigating Political Subdivisions ParticipateCONSHOHOCKEN, Pa. & DUBLIN, Ohio & IRVING, Texas, February 25, 2022--(BUSINESS WIRE)--AmerisourceBergen (NYSE: ABC), Cardinal Health (NYSE: CAH) and McKesson (NYSE: MCK) announced today that each company has independently determined that there is sufficient participation by states and litigating political subdivisions to proceed with a comprehensive agreement to settle the vast majority of the opioid lawsuits filed by state and local governmental entities.", "spans": [[179, 196], [210, 225], [242, 250]], "date": "2022-02-25T11:45:00+00:00", "span_values": ["AmerisourceBergen", "McKesson", "Cardinal Health"]}
{"sentence": "The companies would be responsible for up to approximately the following contributions, payable over 18 years:AmerisourceBergen: $6.1 billion Cardinal Health: $6.0 billion McKesson: $7.4 billionStory continuesThe effective date of the agreement is April 2, 2022.", "spans": [[110, 127], [142, 157], [172, 180]], "date": "2022-02-25T11:45:00+00:00", "span_values": ["AmerisourceBergen", "McKesson", "Cardinal Health"]}
{"sentence": "Atlanta, GA, based Investment company Aurora Investment Counsel (Current Portfolio) buys The Scotts Miracle Gro Co, MDU Resources Group Inc, Cummins Inc, Sonos Inc, Sun Communities Inc, sells Koppers Holdings Inc, Intercontinental Exchange Inc, Life Storage Inc, Hubbell Inc, during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Aurora Investment Counsel.", "spans": [[141, 148], [214, 239]], "date": "2022-02-07T22:38:03+00:00", "span_values": ["Intercontinental Exchange", "Cummins"]}
{"sentence": "New Purchases: SMG, MDU, CMI, SONO, SUI, HAE, LYB, PTC, PUBM, TDY, Added Positions: MRNA, SEIC, NUS, CAH, MED, PRGO, WBA, EQCPD.PFD, HI, UGI, DOX, ABBV, DGX, RPRX, RPM, PII, NI, SRCE, OTEX, CB, MO, SAIC, TGNA, AIRC, SHC, GLPI, GD, IMKTA, ABM, GPN, GIS, OGE, WMK, MDC, GTY, PRGS, DVA, VVV, AFG, WHR, ALB, CSCO, FLWS, CMS, FLGT, GL, BATRA, BIP, NEU, ICHR, DOOR, EA, SBAC, MRTN, MKSI, ACGL, BAX, CHE, OSIS, IDA, CLH, QDEL, CCK, PRI, FOX, PGR, NOMD, SCL, ARRY, PLXS, QRVO, TAP, BERY, HELE, Reduced Positions: ICE, LSI, HUBB, AON, NTGR, FISV, VIPS, ANTM, DTE, CIEN, MUSA, UNF, UFPI, MYRG, GXO, CF, REXR, NSIT, NVO, ATKR, QCOM, XPO, CRSR, BSIG, NSC, AMGN, EXLS, SCI, LRN, FANG, SIGI, OTTR, Sold Out: KOP, CSOD, LDOS, SNV, KFRC, SGU, VRNT, DOYU,Warning!", "spans": [[51, 54], [521, 524], [550, 553]], "date": "2022-02-07T22:38:03+00:00", "span_values": ["DTE", "PTC", "AON"]}
{"sentence": "These stocks are Clarivate Plc (NYSE:CLVT), Alliant Energy Corporation (NYSE:LNT), Zendesk Inc (NYSE:ZEN), News Corp (NASDAQ:NWSA), Loews Corporation (NYSE:L), Solaredge Technologies Inc (NASDAQ:SEDG), and Nordson Corporation (NASDAQ:NDSN).", "spans": [[44, 58], [107, 116], [132, 149], [160, 169], [206, 213]], "date": "2022-02-07T17:25:06+00:00", "span_values": ["Loews Corporation", "Nordson", "Solaredge", "Alliant Energy", "News Corp"]}
{"sentence": "These stocks are BioMarin Pharmaceutical Inc. (NASDAQ:BMRN), PTC Inc (NASDAQ:PTC), Cardinal Health, Inc. (NYSE:CAH), Clarivate Plc (NYSE:CLVT), Alliant Energy Corporation (NYSE:LNT), Zendesk Inc (NYSE:ZEN), and News Corp (NASDAQ:NWSA).", "spans": [[61, 64], [77, 80], [83, 98], [144, 158], [211, 220]], "date": "2022-02-07T05:01:12+00:00", "span_values": ["PTC", "Alliant Energy", "News Corp", "Cardinal Health"]}
{"sentence": "These stocks are Cognex Corporation (NASDAQ:CGNX), BioMarin Pharmaceutical Inc. (NASDAQ:BMRN), PTC Inc (NASDAQ:PTC), Cardinal Health, Inc. (NYSE:CAH), Clarivate Plc (NYSE:CLVT), Alliant Energy Corporation (NASDAQ:LNT), and Zendesk Inc (NYSE:ZEN).", "spans": [[95, 98], [111, 114], [117, 132], [178, 192]], "date": "2022-02-06T21:32:59+00:00", "span_values": ["PTC", "Alliant Energy", "Cardinal Health"]}
{"sentence": "That's why at the end of this article we will examine companies such as PTC Inc (NASDAQ:PTC), Cardinal Health, Inc. (NYSE:CAH), and Clarivate Plc (NYSE:CLVT) to gather more data points.", "spans": [[72, 75], [88, 91], [94, 109]], "date": "2022-02-06T20:27:28+00:00", "span_values": ["PTC", "Cardinal Health"]}
{"sentence": "These stocks are PTC Inc (NASDAQ:PTC), Cardinal Health, Inc. (NYSE:CAH), Clarivate Plc (NYSE:CLVT), Alliant Energy Corporation (NYSE:LNT), Zendesk Inc (NYSE:ZEN), News Corp (NASDAQ:NWSA), and Loews Corporation (NYSE:L).", "spans": [[17, 20], [33, 36], [39, 54], [100, 114], [163, 172], [192, 209]], "date": "2022-02-06T20:27:28+00:00", "span_values": ["Loews Corporation", "Cardinal Health", "PTC", "Alliant Energy", "News Corp"]}
{"sentence": "We will take a look at Cardinal Health, Inc. (NYSE:CAH), Clarivate Plc (NYSE:CLVT), Alliant Energy Corporation (NASDAQ:LNT), Zendesk Inc (NYSE:ZEN), News Corp (NASDAQ:NWSA), Loews Corporation (NYSE:L), and Solaredge Technologies Inc (NASDAQ:SEDG).", "spans": [[23, 38], [84, 98], [149, 158], [174, 191], [206, 215]], "date": "2022-02-05T18:58:39+00:00", "span_values": ["Loews Corporation", "Solaredge", "Cardinal Health", "Alliant Energy", "News Corp"]}
{"sentence": "Englewood, CO, based Investment company AMG National Trust Bank (Current Portfolio) buys Calix Inc, Becton, Dickinson and Co, Cardinal Health Inc, Citigroup Inc, Vanguard Short-Term Inflation-Protected Securities, sells The Western Union Co, iShares Short-Term National Muni Bond ETF, Aberdeen Standard Physical Palladium Shares ETF, 3M Co, JPMorgan Ultra-Short Income ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, AMG National Trust Bank.", "spans": [[126, 141], [147, 156], [334, 336]], "date": "2022-02-04T14:38:21+00:00", "span_values": ["3M", "Citigroup", "Cardinal Health"]}
{"sentence": "New Purchases: CALX, INGR, ELAN, WBA, SRLN, JEPI, IYH, DGRO, DEM, APD, ON, NWL, ISRG, IFF, HPQ, GIL, CME, NUV, Added Positions: IWM, VOO, IXUS, BDX, CAH, C, VTIP, VFC, BND, VSGX, BSV, XYL, ESGV, IEF, IEFA, CI, MRK, PFF, IWN, IWS, KTB, HBAN, LUV, HSY, GE, IWD, BNDX, CWB, EFV, EWZ, GVI, OEF, IEMG, AIG, PNC, BTI, VYM, COST, CS, GILD, VEU, HON, VEA, NVDA, NKE, QLTA, XLB, IUSB, XLY, XLV, XLU, IVE, IVOV, XLI, XLE, SIVR, PPLT, SGOL, SHM, KWEB, JETS, VBK, VB, NFLX, AMT, AMGN, ADP, BP, BG, CSCO, GLW, ETN, LLY, F, HMC, IBM, INCY, INTC, MDLZ, IJS, NSC, SLB, SYK, TXN, TTE, WMT, TSLA, HII, PSX, CARR, BOND, FBND, HDV, IBND, Reduced Positions: AAPL, SUB, PALL, MMM, CMCSA, ING, WPP, JPST, FB, JNJ, AMZN, SCHW, JPM, GOOG, EEM, GLD, MUB, CB, T, ABT, AXP, BRK.B, DHR, DE, ECL, FISV, GOOGL, HD, LVS, LEG, MET, PFG, PG, O, SBUX, TJX, UPS, VZ, DIS, BRK.A, MA, V, PYPL, IGIB, IGSB, EWL, EWU, IEUR, IWF, LQD, VO, VOE, XLK, ACN, ADBE, AFL, ADM, TFC, BAC, BLK, BA, CAT, CVX, KO, CTSH, CAG, D, DD, DUK, EW, EMR, EXC, XOM, NEE, FDX, FMS, HSIC, ICE, IP, INTU, KMB, LNC, LMT, MKL, MCD, SPGI, MDT, NVS, NUE, ORCL, PFE, LIN, RELX, RIO, CRM, SO, TRV, STT, SYY, TSM, TGT, TXT, TMO, URI, UNH, VRTX, WAB, WM, WMB, WSM, ABBV, FOX, DOW, CTVA, OTIS, BIV, BOTZ, BWX, EFG, ENZL, EPP, EWJ, EWK, GBF, IVW, IYC, IYE, IYR, ROBO, RWX, SHV, SHY, TIP, VBR, XLC, XLF, XLP, XLRE, Sold Out: WU, COF, IBMJ, XBI, RSP, DFAX, DFS, IDV, FDN, EVBG, FTV, ZTS, MO, WBK, PPG, ENB, DEO, FIS, CPB, AEP, SLVM,Story continuesWarning!", "spans": [[251, 253], [297, 300], [473, 476], [515, 518], [924, 927], [1203, 1206], [1214, 1218], [1435, 1438]], "date": "2022-02-04T14:38:21+00:00", "span_values": ["DOW", "FIS", "IBM", "ADP", "OTIS", "GE", "AIG", "ADM"]}
{"sentence": "Charlotte, NC, based Investment company Novare Capital Management Llc (Current Portfolio) buys iShares PHLX SOX Semiconductor Sector Index Fund, Alphabet Inc, iShares Fallen Angels USD Bond ETF, iShares U.S. Preferred Stock, Vanguard Short-Term Corporate Bond ETF, sells Global Payments Inc, Verizon Communications Inc, MSC Industrial Direct Co Inc, International Business Machines Corp, Invesco S&P 500 Equal Weight ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Novare Capital Management Llc.", "spans": [[145, 153], [271, 286], [292, 299], [388, 395]], "date": "2022-02-03T22:38:32+00:00", "span_values": ["Alphabet", "Verizon", "Invesco", "Global Payments"]}
{"sentence": "New Purchases: SOXX, IVW, BACPL.PFD, T, F, NVDA, WFCPL.PFD, SO, WFC, XLRE, XLC, NXPI, PDM, UNP, FCX, ADSK, TSM, CRWD, GS, D, Added Positions: SPY, FALN, GOOGL, PFF, VCSH, BSCR, WHR, IVV, BSCP, WSM, PFE, JNJ, PII, DUK, DIS, CMCSA, GSLC, AMZN, U, GM, TJX, PG, LMT, VRT, PYPL, AVGO, INTC, CRM, XLY, XLK, SCHM, SI, MRK, SCHA, ROP, XLV, ORCL, SCHX, SCHB, TFC, BA, CVX, XOM, FB, GOOG, KO, FITB, ATO, ADBE, XLF, GLAD, GBDC, Reduced Positions: GPN, VZ, MSM, IBM, RSP, USMV, BSCO, LOW, BSCN, MSFT, VCIT, IJR, SPLV, BSCQ, ABBV, UNH, TMO, AMP, TXN, VIG, CHRW, O, ACN, V, QQQ, PRF, JPST, KEYS, BSCM, EMR, IJH, SPG, VYM, BDX, BMY, DGRW, EMN, ZTS, FDUS, TSLA, HUBB, K, COST, IEI, CAT, PEY, GE, ADP, MU, VWOB, PPG, Sold Out: SPH, CAH, AMD, SQ, SHYG, AMGN, PLTR, BSCL, VGT,Warning!", "spans": [[245, 247], [450, 453], [676, 678], [680, 683], [720, 723]], "date": "2022-02-03T22:38:32+00:00", "span_values": ["AMD", "GM", "IBM", "ADP", "GE"]}
{"sentence": "Innovative Portfolios Buys Broadcom Inc, American Financial Group Inc, Analog Devices Inc, ....", "spans": [[27, 35], [71, 85]], "date": "2022-02-03T19:38:02+00:00", "span_values": ["Analog Devices", "Broadcom"]}
{"sentence": "Investment company Innovative Portfolios (Current Portfolio) buys Broadcom Inc, American Financial Group Inc, Analog Devices Inc, Cohen & Steers Inc, Fastenal Co, sells Cardinal Health Inc, Corning Inc, Eastman Chemical Co, Illinois Tool Works Inc, International Paper Co during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Innovative Portfolios.", "spans": [[66, 74], [110, 124], [150, 158], [169, 184], [190, 197], [203, 210], [224, 243], [249, 268]], "date": "2022-02-03T19:38:02+00:00", "span_values": ["Corning", "Broadcom", "Cardinal Health", "Illinois Tool Works", "Eastman", "International Paper", "Analog Devices", "Fastenal"]}
{"sentence": "Investment company Sheaff Brock Investment Advisors, LLC (Current Portfolio) buys Alphabet Inc, Penske Automotive Group Inc, International Business Machines Corp, Procter & Gamble Co, Dow Inc, sells Amazon.com Inc, Polaris Inc, Walmart Inc, The Home Depot Inc, Visa Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Sheaff Brock Investment Advisors, LLC.", "spans": [[82, 90], [163, 179], [184, 187], [199, 205], [228, 235], [245, 255], [261, 265]], "date": "2022-02-03T18:38:02+00:00", "span_values": ["Visa", "Amazon", "Alphabet", "Home Depot", "Dow", "Walmart", "Procter & Gamble"]}
{"sentence": "New Purchases: TQQQ, IT, LSCC, OHI, TRMB, TNA, ETN, AFIN, SPYG, O, IUSG, CTSH, ROK, XLRE, XLNX, FBHS, ICLR, RBLX, BITO, DGRO, IJH, IVW, ALGN, NICE, AB, REGN, RIVN, TROW, XLE, USRT, AMP, ABR, OPCH, CNI, DEO, DVAX, KRG, ORLY, MLM, PLAB, KEYS, ANET, NLS, NEM, EOI, CII, GGT, PERI, TLRY, TLRY, CDZI, Added Positions: GOOG, PAG, AAPL, IBM, PG, NVDA, DOW, QQQ, AMD, BBAR, VTI, CSCO, LLY, JCI, SPY, MMM, ALL, SCHW, GLW, F, GOOGL, IRM, LMT, MDT, MU, MSFT, PNC, PFE, WEC, USA, IWM, MINT, VV, PLD, ARE, MO, AEE, AMT, AN, ADSK, AVB, BRK.B, CVS, CTAS, C, OFC, COST, CMI, DHR, DE, DLR, DRE, EGP, ENTG, FNF, GPC, GTY, GS, HUBB, IDXX, INTC, JNJ, KLAC, LEN, LOW, MAA, ORCL, PH, PSA, SLG, SPG, TGT, TXN, TSCO, UBA, YUM, ZBRA, EBAY, CROX, DFS, PM, AVGO, HZNP, DOC, PYPL, MTTR, PGX, SCHD, VOO, ACN, AEP, NLY, TFC, BBY, BLK, CDNS, CI, CINF, STZ, DHI, DUK, ENB, FDX, NUE, OKE, RF, SIRI, SWKS, SNA, LUV, SPPI, SNPS, AXON, TER, RTX, VLO, WPC, WMB, WSM, ET, JPS, ETB, CODI, AVXL, LULU, AMPE, OMER, FTNT, GNRC, LPLA, KMI, MPLX, CGC, BLD, RIV, ROKU, VICI, SONO, INMD, LCID, ARKK, PFF, PFXF, QYLD, VB, VO, VT, Reduced Positions: AMZN, PII, WMT, HD, V, LRCX, CMCSA, CSX, XOM, MRNA, T, TSLA, FB, CVX, NFLX, DIS, MTUM, XLV, AMAT, D, GE, PLTR, XLK, XLY, ABT, ATVI, BA, BMY, KO, CMA, FISV, PEAK, HON, LVS, HZO, MCD, MRK, PEP, PRFT, PSEC, CRM, STX, SO, SBUX, TJX, VZ, WAL, MA, BX, CELH, BABA, SQ, TRTN, AVTR, IJK, IJT, ADBE, AXP, AMGN, ARCC, BP, BSX, BKD, BC, CTRA, CPB, CCL, CLF, COP, CCI, DD, EMR, EPD, NEE, FE, FCX, GILD, ZD, MAR, NOK, NOC, ODFL, LIN, PRU, TRV, STLD, USB, UNP, OLED, WFC, XEL, CMG, FFC, PHK, BXMX, BDJ, DAL, REI, RILY, MPC, RH, NRZ, AAL, ATKR, SRTS, TTD, OKTA, ZS, CRWD, DKNG, COIN, DIG, IJR, MDY, QLD, RSP, SCHV, VIG, VUG, VXF, XLU, Sold Out: PTC, HST, CAH, LNC, PAYX, JHB, TDOC, PSX, RHI, WEN, VTR, CHTR, PBA, PRI, ABM, ZM, BEAM, UPST, CCSI, IJJ, RPV, MSM, SRCE, IEP, ABC, AIT, AVY, VIAC, DLTR, DCI, DOV, FELE, THG, LHX, ITT, LEG, LECO, TGTX, PFLT, LIFE, SRNE, GPM, SVC, XBI, CRON, SLVM,Story continuesWarning!", "spans": [[330, 333], [345, 348], [355, 358], [709, 713], [1138, 1141], [1203, 1205], [1731, 1734]], "date": "2022-02-03T18:38:02+00:00", "span_values": ["DOW", "AMD", "PTC", "GE", "IBM", "EBAY", "CSX"]}
{"sentence": "The holding were 73,757 shares as of 2021-12-31.Added: Dow Inc (DOW)Sheaff Brock Investment Advisors, LLC added to a holding in Dow Inc by 61.88%.", "spans": [[55, 58], [64, 67], [128, 131]], "date": "2022-02-03T18:38:02+00:00", "span_values": ["DOW", "Dow"]}
{"sentence": "Zacks RankCurrently, Cardinal Health carries a Zacks Rank #5 (Strong Sell).Key PicksSome better-ranked stocks that are supposed to report earnings soon are Cerner Corporation CERN, Baxter International Inc.", "spans": [[21, 36], [156, 162], [181, 187]], "date": "2022-02-03T17:14:05+00:00", "span_values": ["Cerner", "Baxter", "Cardinal Health"]}
{"sentence": "These risks and uncertainties include risks arising from the ongoing COVID-19 pandemic and our critical role in the global healthcare supply chain, including our ability to recoup or mitigate cost increases and inflation, including costs to source certain personal protective or other equipment, increased costs for transportation, shipping, freight and commodities, reduced price or demand for certain products, which may result in additional inventory reserves, possible workforce issues resulting from COVID-19 vaccine mandates and the possible impact of disruptions of our distribution or manufacturing facilities; the possibility that our Medical unit goodwill could be impaired due to the decreased outlook for Medical segment profit or possible unfavorable changes in the U.S. statutory tax rate; competitive pressures in Cardinal Health's various lines of business; the performance of our generics program, including the amount or rate of generic deflation and our ability to offset generic deflation and maintain other financial and strategic benefits through our generic sourcing venture with CVS Health; risks associated with the distribution of opioids, including the financial impact associated with the proposed settlement agreement and process we have negotiated with governmental authorities, including the risk that we may fail to reach a final settlement agreement or that a significant number of states and subdivisions may not agree to the proposed settlement agreement, the risk that challenges to our plans to take tax deductions for opioid-related losses could adversely impact our financial results and risks arising from the Department of Justice investigation which we believe concerns our anti-diversion program; risks associated with the manufacture and sourcing of certain products, including risks related to our ability and the ability of third-party manufacturers to comply with applicable regulations; our ability to manage uncertainties associated with the pricing of branded pharmaceuticals; and risks associated with our cost savings initiatives including the possibility that they could fail to achieve the intended results.", "spans": [[829, 844], [1103, 1113]], "date": "2022-02-03T11:55:00+00:00", "span_values": ["CVS Health", "Cardinal Health"]}
{"sentence": "Investment company Gries Financial Llc (Current Portfolio) buys iShares Commodities Select Strategy ETF, BTC iShares MSCI USA Min Vol Factor ETF, iShares MSCI ACWI Index Fund, Walgreens Boots Alliance Inc, Bristol-Myers Squibb Co, sells Avalara Inc, Cintas Corp, Apple Inc, AT&T Inc, CVS Health Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Gries Financial Llc.", "spans": [[117, 121], [154, 158], [176, 200], [250, 256], [263, 268], [274, 278], [284, 294]], "date": "2022-02-02T22:38:25+00:00", "span_values": ["Apple", "MSCI", "Walgreens Boots Alliance", "AT&T", "CVS Health", "Cintas"]}
{"sentence": "New Purchases: USMV, ACWI, WBA, AAP, CADE, CADE, TU, IFF, PSX, PBA, ALL, BACPL.PFD, FSK, WFCPL.PFD, TGT, ADP, GOVT, IJR, RSP, PNNT, Added Positions: COMT, IVV, BMY, IBM, TIP, IJH, AMGN, SCHX, SPY, IWD, IWM, MCD, ICF, MDY, IEFA, IEMG, EFA, ICSH, PH, VWO, SCHD, IWN, VNQ, RTX, IWO, MRK, MMC, AMZN, EEM, INTC, COP, CL, CVX, CDW, MDLZ, NEE, QQQ, V, AVGO, APH, AMT, Reduced Positions: AVLR, AAPL, BK, CTSH, XOM, GILD, CAG, VZ, OGE, JPM, CI, PFE, LMT, OMC, NFG, UGI, FAF, HD, GD, NWL, DHR, CSCO, GS, UNH, BCSF, SSB, ABC, LSTR, PEP, MINT, TRV, MS, WERN, AFL, ORCL, DOX, TSN, ABBV, IXG, CGBD, TXN, FLOT, JPST, JNJ, NKE, FB, NDSN, GOOG, MSFT, JMST, MRNA, TMO, SQ, COST, BA, HON, DIS, GOOGL, AKAM, SHY, IYE, ABT, SBUX, CME, Sold Out: CTAS, T, CVS, CAH, VIAC, BBY, MET, IPG, GSBD, BNL, TDG, BRK.B, NFLX, PYPL, BAC, EL, ATHX, KD,Warning!", "spans": [[105, 108], [165, 168], [321, 324]], "date": "2022-02-02T22:38:25+00:00", "span_values": ["CDW", "IBM", "ADP"]}
{"sentence": "McKesson, AmerisourceBergen Lift Outlook On Covid Vaccine, Treatment Distribution.", "spans": [[0, 8], [10, 27]], "date": "2022-02-02T22:12:42+00:00", "span_values": ["AmerisourceBergen", "McKesson"]}
{"sentence": "The deal came after the distributors, McKesson Corporation (NYSE: MCK), AmerisourceBergen Corp (NYSE: ABC), Cardinal Health Inc (NYSE: CAH), and JNJ, proposed paying up to billion to resolve similar claims by states and local governments.", "spans": [[38, 46], [72, 89], [108, 123]], "date": "2022-02-02T18:39:56+00:00", "span_values": ["AmerisourceBergen", "McKesson", "Cardinal Health"]}
{"sentence": "AmerisourceBergen Earnings Solid, McKesson On Tap With Both Drug Distributors Near Highs.", "spans": [[0, 17], [34, 42]], "date": "2022-02-02T11:47:42+00:00", "span_values": ["AmerisourceBergen", "McKesson"]}
{"sentence": "AmerisourceBergen topped fiscal first-quarter earnings early Wednesday, with rival drug distributor McKesson on tap after the close.", "spans": [[0, 17], [100, 108]], "date": "2022-02-02T11:47:42+00:00", "span_values": ["AmerisourceBergen", "McKesson"]}
{"sentence": "McKesson stock and AmerisourceBergen stock both sat near record highs on Tuesday.", "spans": [[0, 8], [19, 36]], "date": "2022-02-02T11:47:42+00:00", "span_values": ["AmerisourceBergen", "McKesson"]}
{"sentence": "AmerisourceBergen and McKesson have staged powerful run-ups as they work to focus on their expansion plans and move past allegations from state and local governments that they played roles in worsening the nation's opioid epidemic.", "spans": [[0, 17], [22, 30]], "date": "2022-02-02T11:47:42+00:00", "span_values": ["AmerisourceBergen", "McKesson"]}
{"sentence": "Investment company Greystone Financial Group, LLC (Current Portfolio) buys iShares U.S. Preferred Stock, SPDR Blackstone Senior Loan ETF, Lockheed Martin Corp, Cigna Corp, Cardinal Health Inc, sells iShares 1-3 Year Treasury Bond ETF, iShares 3-7 Year Treasury Bond ETF, Raytheon Technologies Corp, Norwegian Cruise Line Holdings, Citigroup Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Greystone Financial Group, LLC.", "spans": [[138, 153], [160, 165], [172, 187], [271, 292], [299, 329], [331, 340]], "date": "2022-02-02T02:38:07+00:00", "span_values": ["Cigna", "Raytheon Technologies", "Cardinal Health", "Citigroup", "Norwegian Cruise Line Holdings", "Lockheed Martin"]}
{"sentence": "McKesson Stock, AmerisourceBergen Stock Hold Up With Earnings Due.", "spans": [[0, 8], [16, 33]], "date": "2022-02-01T22:55:42+00:00", "span_values": ["AmerisourceBergen", "McKesson"]}
{"sentence": "Stocks Bounce on Tesla, Netflix; Wild January Poised to End Lower.", "spans": [[17, 22], [24, 31]], "date": "2022-01-31T19:31:40+00:00", "span_values": ["Tesla", "Netflix"]}
{"sentence": "Stocks are rising, led by Netflix, Tesla, and other tech stocks, as a turbulent month of trading nears its end on a down note.", "spans": [[26, 33], [35, 40]], "date": "2022-01-31T19:31:40+00:00", "span_values": ["Tesla", "Netflix"]}
{"sentence": "\"Cardinal Health acknowledged certain facts as part of the $13.125 million settlement, Rollins' office said, though the company in a statement noted that it did not admit liability as part of the deal.", "spans": [[1, 16], [87, 94]], "date": "2022-01-31T16:25:23+00:00", "span_values": ["Rollins", "Cardinal Health"]}
{"sentence": "\"Cardinal Health acknowledged certain facts as part of the $13.125 million settlement, Rollins' office said, though the company in a statement noted that it did not admit liability as part of the deal.", "spans": [[1, 16], [87, 94]], "date": "2022-01-31T15:47:41+00:00", "span_values": ["Rollins", "Cardinal Health"]}
{"sentence": "For more information, visit ember.com and connect with us on Facebook.com/ember, Instagram.com/ember, and Twitter.com/ember_tech.About Cardinal Health Cardinal Health is a distributor of pharmaceuticals, a global manufacturer and distributor of medical and laboratory products, and a provider of performance and data solutions for health care facilities.", "spans": [[106, 113], [135, 150], [151, 166]], "date": "2022-01-31T14:30:00+00:00", "span_values": ["Twitter", "Cardinal Health"]}
