{"sentence": "Investors and others should note that KLA announces material financial information including SEC filings, press releases, public earnings calls and conference webcasts using an investor relations website ( Additional information may be found at: www.kla.com (KLAC-F).", "spans": [[38, 41], [250, 253]], "date": "2022-03-29T20:05:00+00:00", "span_values": ["KLA", "kla"]}
{"sentence": "CPU die sizes have increased by 5x - 9x for Intel Corp (NASDAQ: INTC) and Apple Inc (NASDAQ: AAPL) over three to five years.", "spans": [[44, 49], [74, 79]], "date": "2022-03-18T12:27:48+00:00", "span_values": ["Apple", "Intel"]}
{"sentence": "Lipacis has a Buy on his preferred semiconductor capital equipment stocks KLA Corp (NASDAQ: KLAC), Applied Materials Inc (NASDAQ: AMAT), Lam Research Corp (NASDAQ: LRCX), ASML Holding NV (NASDAQ: ASML), and ACM Research Inc (NASDAQ: ACMR).", "spans": [[74, 77], [99, 116], [137, 149]], "date": "2022-03-18T12:27:48+00:00", "span_values": ["KLA", "Lam Research", "Applied Materials"]}
{"sentence": "MILPITAS, Calif., March 1, 2022 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) today announced webcasts for upcoming virtual investor conferences:Friday, March 4, 2022 – SIG Susquehanna Financial Group, LLLP 11th Annual Technology Conference at 10 a.m. PT Tuesday, March 8, 2022 – Morgan Stanley Technology, Media & Telecom Conference at 9:45 a.m.", "spans": [[48, 51], [281, 295]], "date": "2022-03-01T21:05:00+00:00", "span_values": ["KLA", "Morgan Stanley"]}
{"sentence": "Investors and others should note that KLA announces material financial information including SEC filings, press releases, public earnings calls and conference webcasts using an investor relations website (ir.kla.com).", "spans": [[38, 41], [208, 211]], "date": "2022-03-01T21:05:00+00:00", "span_values": ["KLA", "kla"]}
{"sentence": "Buys Costco Wholesale Corp, Materials Select Sector SPDR, Invesco ....", "spans": [[5, 11], [58, 65]], "date": "2022-02-08T19:38:19+00:00", "span_values": ["Invesco", "Costco"]}
{"sentence": "Farmington Hills, MI, based Investment company Blue Chip Partners, Inc. (Current Portfolio) buys Costco Wholesale Corp, Materials Select Sector SPDR, Invesco S&P 500 Equal Weight ETF, Real Estate Select Sector SPDR Fund (The), iShares 20+ Year Treasury Bond ETF, sells The Walt Disney Co, Dow Inc, REV Group Inc, JPMorgan Ultra-Short Municipal Income ETF, PayPal Holdings Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Blue Chip Partners, Inc..", "spans": [[97, 103], [150, 157], [278, 284], [289, 292], [356, 362]], "date": "2022-02-08T19:38:19+00:00", "span_values": ["PayPal", "Disney", "Invesco", "Costco", "Dow"]}
{"sentence": "Investment company Nvwm, Llc (Current Portfolio) buys Vanguard Ultra-Short Bond ETF, Vanguard Total Stock Market ETF, Vanguard Mega Cap Growth ETF, Vanguard Total International Stock, Freeport-McMoRan Inc, sells Quadratic Interest Rate Volatility And Inflation H, Moderna Inc, BioNTech SE, Skyworks Solutions Inc, Aberdeen Standard Physical Precious Metals Basket during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Nvwm, Llc.", "spans": [[184, 200], [264, 271], [290, 298]], "date": "2022-02-08T15:38:09+00:00", "span_values": ["Skyworks", "Moderna", "Freeport-McMoRan"]}
{"sentence": "New Purchases: VUSB, MGK, SRLN, IT, KLAC, ARES, SPGI, SF, MCO, ODFL, TLT, IWM, ITOT, MPC, PANW, PKI, XLU, EPRF, BNDX, VEA, MUB, IEFA, TFI, EMB, IEMG, SCHD, SCHV, CELH, CAMT, VTIP, CWH, TBUX, IWS, IWN, WE, SHV, VSS, VIOG, TBLT, FULT, HPQ, NTRS, HCA, STAG, WIX, AMC, PAYC, GLOB, TRHC, GBIL, RBLX, CHK, DIBS, TALK, OLPX, KD, ONL, ARKW, BSCM, EFV, Added Positions: VTI, VXUS, FCX, GOOGL, CSCO, TSLA, PAVE, FB, SHY, MSFT, AAPL, ICSH, INTU, WDAY, GM, VWO, TIP, DJP, KEY, FTNT, IJR, XLE, TFC, FND, MELI, JPST, AGG, AMLP, CLF, QQQ, AMZN, IAU, CDNS, DHR, IQV, SCHF, EW, LLY, IDXX, MS, TMO, VBR, ASML, ADBE, AMAT, BRK.B, F, ISRG, NTR, ROK, SLB, ZBRA, NXPI, GOOG, IGV, VTV, CVX, DUK, EL, XOM, GS, LRCX, LEN, LOW, NKE, NUE, QCOM, SBUX, SNPS, TGT, USB, UPS, UNH, WMT, WFC, LULU, V, GNRC, POAHY, MOS, ZTS, HUBS, SEDG, SHOP, SQ, TEAM, TTD, BHVN, DT, BEAM, ABNB, UPST, SOFI, SOFI, AOR, BND, DLN, DVY, FLOT, IWR, MINT, PFF, QQQJ, VOE, XLF, XLK, FLWS, PLD, AEP, AZO, CSX, CME, C, DECK, DXCM, ETN, EA, LHX, IIVI, KNX, LKQ, MGA, MCD, MAA, ORCL, PNC, PG, PGR, REGN, RHI, RHHBY, TXN, TXT, URI, VLO, ANTM, EBAY, ACM, G, LPLA, CDW, AQUA, YETI, UBER, CRWD, SNOW, U, FIGS, EVGO, MTTR, OEF, PGF, SPYV, VV, Reduced Positions: IVOL, MRNA, BNTX, GLTR, ALLY, MA, AXP, INTC, EWZ, TMUS, DD, DOCU, CRNC, ILMN, SHAK, WOOF, DVN, EEM, ADSK, AMD, GE, SPY, CRM, WHR, ICF, MTCH, HON, VZ, JEPI, SMH, XLG, DE, T, PPL, VCSH, VOT, TWLO, O, INMD, VWOB, AI, MDT, SPLV, ITW, GLD, EWG, SCHB, FDX, JNK, BMY, AMT, ACC, VCIT, VIG, IVV, CTXS, KO, BABA, EFA, PSFE, CARR, VTRS, NLOK, COLD, SPCE, TDOC, ZBH, Sold Out: SWKS, WRK, QRVO, GH, YELP, SONO, FTCH, XPO, UUP, ELAN, FISV, CTRE, SQQQ, ZM, SCHO, TRMB, FIS, VIAC, VUG, JETS, CPNG, BMBL, LMND, UROY, SCHP, JMIA, URA, VBK, VEU, ADP, NIO, RGA, NSC, NOC, LIN, RRX, LUV, RTX, VRTX, WDC, VMW, PAGS, STLA, VYGVF, LYB, BAH, FLT, CHGG, MGNI, NVTA,Story continuesWarning!", "spans": [[441, 443], [949, 952], [1083, 1087], [1103, 1106], [1304, 1307], [1309, 1311], [1371, 1374], [1652, 1655], [1725, 1728]], "date": "2022-02-08T15:38:09+00:00", "span_values": ["CDW", "GM", "FIS", "AMD", "CSX", "PPL", "EBAY", "ADP", "GE"]}
{"sentence": "New York, NY, based Investment company Bridgewater Advisors Inc. (Current Portfolio) buys JPMorgan Ultra-Short Municipal Income ETF, Barclays Bank PLC ZC SP ETN REDEEM 12/10/2022 USD , VANGUARD BD IDX FD, Dimensional International Core Equity Market ETF, Vanguard Intermediate-Term Corporate Bond ETF, sells Vanguard Real Estate Index Fund ETF, AMETEK Inc, Invesco FTSE RAFI US 1000 ETF, iShares Russell 2000 ETF, Alibaba Group Holding during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Bridgewater Advisors Inc..", "spans": [[345, 351], [357, 364]], "date": "2022-02-07T14:38:24+00:00", "span_values": ["AMETEK", "Invesco"]}
{"sentence": "New Purchases: CAPE, DFAI, DFAE, KLAC, MLI, WTRG, BC, NCR, AOR, TOST, DFAU, TSP, XLI, RBLX, NEWR, SPSB, XLE, BKLN, YINN, U, SPOT, YUM, JNK, FMC, USMV, LLY, TPR, ADP, OTIS, NET, IEFA, FAX, Added Positions: JMST, BND, VCIT, VTI, FVCB, JPST, NKE, NVDA, FB, JPM, DFAS, ASPN, EWL, VEA, KYN, EDEN, VT, ENOR, EWD, ATCO, SONO, XLF, DGX, DLN, GLD, CERN, QQQ, JBHT, QRVO, CAH, CMI, DAR, VRTS, FBC, AVTR, ENX, WGO, MDC, UNP, TXN, TGT, MMC, MTH, MET, MCHP, PKI, VWO, ACWI, AVDE, AVUS, SCHF, DSI, XLK, ROKU, V, CVX, MNP, CSCO, SRE, PWR, ORCL, GS, BKNG, ADBE, AMAT, BSX, BMY, CME, SCHH, MTCH, JKHY, BRMK, RTX, NBO, MA, BNDX, ABBV, CRWD, SNDL, Reduced Positions: TSLA, COO, TTD, AAPL, COOP, PG, DFUS, RKT, CVNA, SRNE, JNJ, GOOGL, VCSH, VXUS, AMZN, SCHA, VEU, TMO, IDXX, XOM, SPY, MSFT, VZ, Z, HD, COF, SCHE, C, IGSB, VGT, EFX, VTWV, NOW, IMH, MRK, DIS, UNH, SYK, NUE, VONV, AXP, ABT, CAT, ACIM, DOW, RDFN, TNDM, Sold Out: VNQ, AME, PRF, IWM, BABA, OPEN, RSP, DVY, AGG, DMO, IWO, IWC, MFM, LYFT, ASML, HCI, IWN, TRMB, VPL, TRV, INTC, LTRPA, HYLN, MBIO, LDI, DOMA, EBON, BSGM,Warning!", "spans": [[140, 143], [161, 164], [166, 170], [880, 883]], "date": "2022-02-07T14:38:24+00:00", "span_values": ["FMC", "OTIS", "ADP", "DOW"]}
{"sentence": "These stocks are NXP Semiconductors NV (NASDAQ:NXPI), Ferrari N.V. (NYSE:RACE), Itau Unibanco Holding SA (NYSE:ITUB), Takeda Pharmaceutical Company Limited (NYSE:TAK), Prudential Public Limited Company (NYSE:PUK), Chipotle Mexican Grill, Inc. (NYSE:CMG), and KLA Corporation (NASDAQ:KLAC).", "spans": [[17, 20], [168, 178], [214, 236], [259, 262]], "date": "2022-02-06T21:25:29+00:00", "span_values": ["NXP", "KLA", "Prudential", "Chipotle Mexican Grill"]}
{"sentence": "These stocks are KLA Corporation (NASDAQ:KLAC), DocuSign, Inc. (NASDAQ:DOCU), MSCI Inc (NYSE:MSCI), Canadian Imperial Bank of Commerce (NYSE:CM), Humana Inc (NYSE:HUM), Marvell Technology, Inc. (NASDAQ:MRVL), and Dollar General Corp. (NYSE:DG).", "spans": [[17, 20], [78, 82], [93, 97], [146, 152], [213, 227]], "date": "2022-02-04T20:58:44+00:00", "span_values": ["Humana", "KLA", "Dollar General", "MSCI"]}
{"sentence": "Richmond, VA, based Investment company Virginia Retirement Systems Et Al (Current Portfolio) buys Wolfspeed Inc, Orion Office REIT Inc, Kyndryl Holdings Inc, 2seventy bio Inc, Loyalty Ventures Inc, sells American Water Works Co Inc, Johnson & Johnson, Activision Blizzard Inc, Intuit Inc, Dollar General Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Virginia Retirement Systems Et Al.", "spans": [[204, 218], [233, 250], [252, 271], [277, 283], [289, 303]], "date": "2022-02-03T18:38:15+00:00", "span_values": ["Johnson & Johnson", "Activision Blizzard", "American Water", "Intuit", "Dollar General"]}
{"sentence": "New Purchases: WOLF, ONL, KD, TSVT, LYLT, ZWS, DOUG, WM, FNF, ABC, ABNB, PPL, FE, SJM, FICO, VMW, HPQ, GDDY, ADSK, OMC, UBER, BSX, TTWO, CCL, LRCX, MCK, LUMN, EXPE, LYV, OXY, HZNP, KHC, CMA, SSNC, INMD, AON, ALV, CHH, CHDN, GPC, JBL, ON, PIPR, RCL, SLAB, SHYF, OLED, VLY, WTFC, XRX, TNL, JAZZ, TWO, WFG, RGA, TRNO, MXL, HPP, ALSN, ALEX, VOYA, PFSI, VIRT, RUN, LITE, HPE, BL, PLTR, CHK, DDD, EGHT, ATSG, EPAC, RAMP, ADC, ALK, AMED, AEO, TVTY, AWR, ANDE, BLKB, SAM, CSGS, CTBI, CACC, CUTR, DENN, DBD, DVAX, ENDP, ETD, FCEL, HAE, HAIN, HL, HFC, IMGN, BCOR, INSM, JW.A, KEX, KFY, TGTX, MAT, MLAB, MGI, MNR, MORN, NEOG, NTCT, OMCL, OTTR, PRGO, RL, PB, XPO, SCVL, SSD, SKYW, SKY, SM, SPWR, XPER, CTLP, PAG, USM, WCC, ZUMZ, ALGT, IBKR, MRTX, AUPH, HCCI, IVR, CDNA, AOSL, GDOT, MARA, RLJ, SXC, BCOV, COOP, MRC, CG, PLAY, AMBA, BFAM, SEAS, PGEN, ISEE, RMAX, ESNT, HMHC, EGRX, AVNS, ENVA, FGEN, NEWR, ATEX, OLLI, PJT, PFGC, UA, GMS, VVV, IRTC, LW, ORGO, VRRM, ATUS, AFIN, SPCE, APLS, FINV, EAF, OBNK, ESTA, FOCS, CWK, FTDR, SILK, PD, FSLY, CRNC, BRP, SPT, VVNT, OTIS, FOUR, LPRO, VERX, RXT, FROG, STEP, CRSR, ASO, VLDR, STTK, ARRY, ALGM, WISH, RMO, BTRS, OCDX, IBRX, DOCN, PCT, DTM, UP, HYZN, DOMA, Added Positions: HSY, AVGO, LKQ, EVR, KLAC, FDS, ZBRA, AVB, BMO, MPW, TSN, TSLA, CMCSA, GIL, NFLX, MRK, XEL, MA, KRG, BNS, EQIX, O, WMT, BCE, CAT, NFG, SUI, CUBE, REXR, MO, DB, DISH, KRC, LXP, MS, NKE, LYB, GOOG, ABM, SRPT, AIRC, ABG, BAC, BECN, BAM, AZTA, CASY, EGP, HWC, WELL, HELE, MGEE, MLI, NYT, OGE, OHI, OSK, RPT, SLG, SKT, TRI, THO, X, VTR, VNO, WPC, WGO, WEX, ROIC, KW, MOS, BLMN, SRC, IRT, FOXF, GLPI, SYNH, RRR, DFIN, WH, BJ, RKT, BNL, SKLZ, OGN, FLWS, AMN, AYI, AMG, HTH, AGYS, AIN, ARE, ACC, APA, AVID, ACLS, BJRI, BOKF, BYD, EAT, BKD, BRKR, BLDR, CBRL, CNQ, CSL, CATY, CENT, CPF, CHE, CPK, CRUS, CLF, TPR, CBSH, NNN, CNMD, ENLC, CFR, LIVN, DCI, LCII, EME, EQR, ESS, EXPO, FRT, M, FHN, FULT, TGNA, GGG, HALO, HLF, HOV, HUBB, IIVI, ITT, IMO, IBCP, IIIN, CSR, JLL, KMT, KSS, KLIC, GDEN, LAMR, LSCC, LAD, LFUS, LOGI, MAN, MMSI, MIDD, MNRO, MOG.A, NTES, NXST, ORI, ASGN, PSB, PZZA, PGC, PEGA, PNFP, POWI, PWR, ROLL, RDN, RS, RGEN, RIGL, SGMS, SNBR, SCI, SIGA, SIG, SWBI, STC, SF, RGR, SNV, AXON, THC, TTEK, TBBK, TOL, ACIW, UMBF, UCTT, UAA, UDR, UFPI, UVSP, UNM, VMI, OSPN, WDFC, WSO, WTS, HEES, TOWN, ACM, TDC, BTG, HI, AGNC, MYRG, KL, SEM, DQ, FAF, SBRA, LPLA, AMCX, HMST, ZNGA, CPRI, RDUS, SLCA, YELP, HTA, FIVE, QLYS, NCLH, EVTC, AHH, EPZM, COMM, CHGG, NMIH, RARE, QURE, VRNS, PCTY, TWOU, ARES, TRUE, CCS, GPRO, TMX, NEP, OCUL, GNK, BOOT, LC, NVRO, VRAY, PGRE, WK, TLRY, TLRY, VSTO, NXRT, APLE, BLD, GKOS, ALRM, CC, RPD, PLNT, PEN, PSTG, MIME, SITE, USFD, MEDP, CRSP, AA, MYOV, REVG, FND, AM, BHVN, APPN, JHG, SFIX, CUE, COLD, FIXX, SMAR, CHX, INSP, AMRX, TENB, IMXI, VRT, UPWK, GH, PLAN, SWAV, LEVI, TPTX, IAA, CMBM, IMVT, NVST, BRBR, SLQT, FMTX, BIGC, MPLN, MRVI, AAN, APPH, GXO, CCSI, Reduced Positions: JNJ, ATVI, INTU, GNTX, DELL, DVN, MAA, TMUS, BC, MHK, QCOM, FB, PII, INVH, INCY, MU, AJG, FFIV, TD, TTD, AMD, AKAM, BLK, CUZ, GRMN, RHI, UTHR, BBY, OFC, DLR, HIW, PKI, CNI, KMX, CHKP, CONE, BXP, VIAC, CPT, DECK, HP, HST, NVDA, PCAR, RCI, TER, TSCO, STAG, FBHS, AMH, PLD, AZPN, BRK.B, ENTG, EXR, PFE, WBS, WST, DBRG, GNRC, GM, WSC, HRI, VICI, ZM, BILL, ANF, ALGN, ALKS, MDRX, AIG, AMKR, ARCB, AN, BIO, BWA, BG, CACI, CPE, CAC, CAR, CIEN, COKE, SITC, DKS, DRE, OVV, ELS, FNB, RHP, GFF, HRB, PEAK, EHC, HTLD, HUN, ICUI, JOUT, KIM, KGC, KNX, MTG, MFC, MRO, MTH, NUVA, NUE, OSTK, PTEN, PENN, PRFT, PCH, PSA, PHM, QDEL, RRX, POOL, SAIA, SMG, SBNY, SPG, LSI, SYNA, TU, TPX, TUP, UNFI, VRTX, AAWW, CVLT, EXLS, SMCI, CLR, BX, SATS, JBT, OPI, CVE, IRWD, CBOE, SIX, TRGP, BKU, ACHC, REGI, VIPS, FANG, ENTA, GOGO, DOC, SAIC, BRX, KPTI, LGIH, MC, CTRE, DNOW, WMS, CHRS, BPMC, WING, APPF, NTLA, FHB, PK, JBGS, BHF, CARG, SE, EPRT, OPEN, EWC, AIR, AEIS, UHAL, ANGO, ATRS, ARWR, AVT, BHE, OPCH, BRC, CBT, CM, CSV, CNOB, CTRN, COLM, CMC, CYH, CNSL, CORT, CR, CW, DAR, DLX, DDS, EXP, ENB, WIRE, ESGR, EXTR, FLEX, GSBC, ITGR, GEF, GPI, HVT, HWKN, HIBB, IMKTA, IART, IONS, ZD, JACK, KAMN, KELYA, LECO, LPX, MHO, MFA, MKSI, MAC, MANH, HZO, MRTN, MGRC, MED, VIVO, MTD, MITK, NCR, NBR, HOPE, FIZZ, NHC, NTGR, NUS, OLN, OLP, OMI, ALTO, PDCE, BPOP, MODV, NXGN, RRC, REG, RY, RGLD, SLM, SANM, SHEN, SRDX, TEN, TEX, TXRH, INVA, UBS, UNF, VRSN, WAFD, WHR, WSM, WWD, INT, WWE, WOR, OPK, CROX, KOP, PRG, VNDA, GTLS, CPRX, EBS, FSLR, FOLD, GRBK, LULU, CIM, APPS, CELH, IRDM, DAN, CLW, FF, VRTS, PDM, CALX, SPSC, NLSN, TROX, DOOR, THR, CLVS, CUBI, MTDR, SUPN, GMED, BERY, RH, PRTA, TPH, BCC, APAM, COTY, BLUE, AGIO, SFM, SPNT, AR, TNDM, ALLY, MBUU, GCI, AKBA, ATEN, NAVI, LPG, VRTV, SAGE, ATRA, STOR, UE, BOX, COLL, SHOP, CHCT, NTRA, DLTH, ATKR, ASIX, FLGT, NTNX, CWH, CNDT, ANAB, CARS, WOW, SAFE, DNLI, LBC, AHCO, DOMO, SONO, ESTC, YETI, GOSS, CVET, KTB, RVLV, VNT, FSR, CNXC, AIV, Sold Out: AWK, DG, ALL, PNW, OGS, ED, VER, LYFT, RPAI, NYCB, MCFE, AGO, PLYA, CXP, ESI, CTMX, XLRN, SRCL, IBP, ESPR, CNNE, TSE, WHD, CFX, PBYI, THG, FL, FBP, EPR, NPO, ZI, ASAN, MATX, ASB, FATE, POST, PAK, ARCO, FFWM, ADVM, NVTA, RMR, NGVT, KALA, ROKU, ECVT, LOMA, AVRO, ALLO, PAE, CRWD, BCEL, BDTX, PASG, GGAL, ROG, ODP, NKTR, NLS, MOD, KFRC, HSKA, HSC, SGMO, GBX, FLIC, EEFT, EGBN, CDE, BDSI, BIG, BBBY, USNA, PCRX, KRA, STWD, NOG, LL, CSII, AUY, WERN, CMPR, INN, URBN, UEIC, TCBI, TTMI, SNX, SCL, SPTN, RBBN,Story continuesWarning!", "spans": [[73, 76], [203, 206], [1052, 1056], [1366, 1370], [2239, 2242], [3014, 3017], [3121, 3123], [3231, 3233], [3284, 3287], [3653, 3657]], "date": "2022-02-03T18:38:15+00:00", "span_values": ["UDR", "AON", "GM", "DISH", "AIG", "CBOE", "AMD", "PPL", "HP", "OTIS"]}
{"sentence": "These stocks are Ferrari N.V. (NYSE:RACE), Itau Unibanco Holding SA (NYSE:ITUB), Takeda Pharmaceutical Company Limited (NYSE:TAK), Prudential Public Limited Company (NYSE:PUK), Chipotle Mexican Grill, Inc. (NYSE:CMG), KLA Corporation (NASDAQ:KLAC), and DocuSign, Inc. (NASDAQ:DOCU).", "spans": [[131, 141], [177, 199], [218, 221]], "date": "2022-02-03T00:00:15+00:00", "span_values": ["KLA", "Prudential", "Chipotle Mexican Grill"]}
{"sentence": "The most notable stocks in the Q3 portfolio of billionaire James Dinan include Amazon.com, Inc. (NASDAQ:AMZN), Block, Inc. (NYSE:SQ), and Morgan Stanley (NYSE:MS).James Dinan of York Capital ManagementOur MethodologyWe used the Q3 2021 portfolio of James Dinan’s York Capital Management to pick the top 10 stock picks of the billionaire.", "spans": [[79, 85], [138, 152]], "date": "2022-02-02T23:19:18+00:00", "span_values": ["Morgan Stanley", "Amazon"]}
{"sentence": "In addition to Amazon.com, Inc. (NASDAQ:AMZN), Block, Inc. (NYSE:SQ), and Morgan Stanley (NYSE:MS), a notable stock to look out for according to James Dinan is Humacyte, Inc. (NASDAQ:HUMA).9.", "spans": [[15, 21], [74, 88]], "date": "2022-02-02T23:19:18+00:00", "span_values": ["Morgan Stanley", "Amazon"]}
{"sentence": "Cadence Design Systems, Inc. (NASDAQ:CDNS) announced on December 1 a 2021 three-way collaboration with Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) and Microsoft Corporation (NASDAQ:MSFT), which focuses on utilizing a cloud infrastructure to accelerate digital timing signoff of over 10 billion transistor designs, which will accelerate signoff schedules and reduce compute costs for customers of Cadence Design Systems, Inc. (NASDAQ:CDNS).Wells Fargo analyst Gary Mobley on December 21 raised the price target on Cadence Design Systems, Inc. (NASDAQ:CDNS) to $205 from $190 and kept an Overweight rating on the shares.", "spans": [[0, 7], [169, 178], [414, 421], [457, 468], [531, 538]], "date": "2022-02-02T23:19:18+00:00", "span_values": ["Cadence", "Microsoft", "Wells Fargo"]}
{"sentence": "Cadence Design Systems, Inc. (NASDAQ:CDNS) is gaining popularity among smart investors, just like Amazon.com, Inc. (NASDAQ:AMZN), Block, Inc. (NYSE:SQ), and Morgan Stanley (NYSE:MS).7.", "spans": [[0, 7], [98, 104], [157, 171]], "date": "2022-02-02T23:19:18+00:00", "span_values": ["Cadence", "Morgan Stanley", "Amazon"]}
{"sentence": "And the large customers in this industry such as Apple, Google and Amazon are all beginning to design their own chips, raising this uncertainty……On the other hand, revenue and profits for the companies that design and manufacture equipment for the manufacturers are steadier.", "spans": [[49, 54], [67, 73]], "date": "2022-02-02T23:19:18+00:00", "span_values": ["Apple", "Amazon"]}
{"sentence": "Investors and others should note that KLA announces material financial information including SEC filings, press releases, public earnings calls and conference webcasts using an investor relations website (ir.kla.com).", "spans": [[38, 41], [208, 211]], "date": "2022-02-02T21:05:00+00:00", "span_values": ["KLA", "kla"]}
{"sentence": "Additional information may be found at: www.kla.com (KLAC-F).View original content:SOURCE KLA Corporation", "spans": [[44, 47], [90, 93]], "date": "2022-02-02T21:05:00+00:00", "span_values": ["kla", "KLA"]}
{"sentence": "Trust Investment Advisors Buys KLA Corp, Marvell Technology Inc, Pfizer Inc, Sells Norwegian ....", "spans": [[31, 34], [65, 71]], "date": "2022-02-02T14:38:13+00:00", "span_values": ["KLA", "Pfizer"]}
{"sentence": "Indianapolis, IN, based Investment company Trust Investment Advisors (Current Portfolio) buys KLA Corp, Marvell Technology Inc, Pfizer Inc, Cleveland-Cliffs Inc, NextEra Energy Inc, sells Norwegian Cruise Line Holdings, Roku Inc, Southwest Airlines Co, NortonLifeLock Inc, New Residential Investment Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Trust Investment Advisors.", "spans": [[94, 97], [128, 134], [162, 176], [188, 218], [230, 248], [253, 267]], "date": "2022-02-02T14:38:13+00:00", "span_values": ["NortonLifeLock", "KLA", "NextEra Energy", "Pfizer", "Southwest Airlines", "Norwegian Cruise Line Holdings"]}
{"sentence": "Investment company Cim Investment Management Inc (Current Portfolio) buys iShares Core S&P 500 ETF, iShares Core S&P Mid-Cap ETF, Apple Inc, Microsoft Corp, iShares Core S&P Small-Cap ETF, sells Regal Rexnord Corp, Kyndryl Holdings Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Cim Investment Management Inc.", "spans": [[130, 135], [141, 150]], "date": "2022-02-02T14:38:06+00:00", "span_values": ["Apple", "Microsoft"]}
{"sentence": "New Purchases: ATVI, TMUS, KLAC, CMCSA, CRUS, INTU, PTON, VNO, VVNT, IQV, APPN, SMG, SAVE, ACIW, NTLA, XNCR, UMBF, SSYS, SHOO, LGND, EXEL, BECN, Added Positions: IVV, IJH, AAPL, MSFT, IJR, IEFA, AMZN, EFA, TSLA, GOOGL, GOOG, BRK.B, PYPL, JPM, AKAM, DIS, V, MA, FB, HD, TMO, ADBE, NVDA, UNH, VRTX, RTX, COST, PG, UNP, LYV, NOW, XOM, MRK, AVGO, ZG, T, BMY, C, QCOM, BIIB, CTXS, DE, GPN, JNJ, PENN, SQ, ACN, AMAT, BDX, NOC, EBAY, APTV, SYF, UBER, BAC, IBM, INTC, TWTR, DOW, BLK, LLY, EQIX, NFLX, PRU, SBUX, MBB, F, J, MKTX, MDT, MU, PFE, SWK, LDOS, SPLK, DKNG, IWM, KO, LEN, PPG, TTWO, CAT, TER, TXN, ABT, CI, MS, NUE, AFRM, CB, BA, CTRA, DLR, DISCA, FDX, GILD, GS, LRCX, LNC, PSA, REGN, VZ, HCA, MOS, MPC, ENPH, MRNA, PINS, MMM, AMD, CHRW, EW, HON, IIVI, LOW, NTAP, PNC, CRM, VLO, WMT, WHR, ZBH, ENSG, ABBV, ZTS, AAL, IRTC, AMGN, BSX, FIS, STZ, FHI, MRCY, OSIS, SWKS, VLY, CTVA, AMT, TFC, BCO, CNC, CVX, D, EGP, ENS, LMT, MMS, AVNT, SIGI, TFX, UAL, ANTM, WY, IRBT, LYB, GM, SHAK, ETSY, NSA, BJ, AEIS, ARWR, COP, CNO, DD, FWRD, HAL, MDC, MET, SSD, TJX, USB, WFC, HOMB, IRDM, JBT, YELP, DOC, YEXT, RDFN, AVD, BLKB, AX, EPAY, CCI, LIVN, EME, FDP, BCOR, K, MHO, MMSI, SJW, LUV, TTEK, QLYS, FOXF, SAIC, TSE, CTLT, MEDP, ATOM, BL, NOVA, RXT, SKLZ, CHK, EPAC, ABG, COF, BXMT, CHDN, COLB, CBU, EIX, FCF, FFIN, FORM, TGNA, RHP, GPI, HALO, HWC, HELE, HUBG, ISBC, KBH, KFY, MAS, MYE, HOPE, NEOG, OMCL, PPBI, SSB, SMTC, TTMI, TXRH, UAA, WDFC, WRE, WYNN, EBS, KBR, FOLD, HI, ZGNX, PRLB, ESNT, AMC, KN, FGEN, VTVT, NGVT, GRWG, APPH, IGSB, IWV, AEO, CLX, CORT, WIRE, HR, WSFS, WERN, OPK, MTDR, QUOT, WSC, SAIL, OSCR, WKHS, BNGO, DHC, MTCR, DM, Sold Out: RRX, KD,Story continuesWarning!", "spans": [[421, 425], [449, 452], [466, 469], [727, 730], [833, 836], [968, 970], [978, 982]], "date": "2022-02-02T14:38:06+00:00", "span_values": ["GM", "FIS", "AMD", "ETSY", "IBM", "EBAY", "DOW"]}
{"sentence": "Investment company Greystone Financial Group, LLC (Current Portfolio) buys iShares U.S. Preferred Stock, SPDR Blackstone Senior Loan ETF, Lockheed Martin Corp, Cigna Corp, Cardinal Health Inc, sells iShares 1-3 Year Treasury Bond ETF, iShares 3-7 Year Treasury Bond ETF, Raytheon Technologies Corp, Norwegian Cruise Line Holdings, Citigroup Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Greystone Financial Group, LLC.", "spans": [[138, 153], [160, 165], [172, 187], [271, 292], [299, 329], [331, 340]], "date": "2022-02-02T02:38:07+00:00", "span_values": ["Cardinal Health", "Lockheed Martin", "Cigna", "Citigroup", "Raytheon Technologies", "Norwegian Cruise Line Holdings"]}
{"sentence": "TFG Advisers LLC Buys Eli Lilly and Co, Colgate-Palmolive Co, Air Products &amp; Chemicals Inc, ....", "spans": [[26, 31], [40, 57], [62, 74]], "date": "2022-02-01T22:38:12+00:00", "span_values": ["Colgate-Palmolive", "Lilly", "Air Products"]}
{"sentence": "Investment company TFG Advisers LLC (Current Portfolio) buys Eli Lilly and Co, Colgate-Palmolive Co, Air Products & Chemicals Inc, Carlisle Inc, Freeport-McMoRan Inc, sells AT&T Inc, Vanguard Total International Bond ETF, WisdomTree", "spans": [[65, 70], [79, 96], [101, 113], [145, 161], [173, 177]], "date": "2022-02-01T22:38:12+00:00", "span_values": ["Colgate-Palmolive", "AT&T", "Freeport-McMoRan", "Lilly", "Air Products"]}
{"sentence": "New Purchases: LLY, CL, APD, CSL, FCX, KLAC, LOW, TGT, WSM, AOS, AMD, Added Positions: FCT, SRLN, PFF, ANGL, NEE, PRU, VMC, MAR, CHY, CRM, NVDA, ACN, WPC, BLD, DNL, OEF, PID, GIS, VB, EFA, CARR, SPEM, TIP, ABBV, XYL, LULU, VO, UNH, BLK, SDY, MDLZ, PCEF, LMT, LQD, FORTY, PH, LIN, XOM, PSA, UPS, DIS, FAX, TRGP, F, CAT, VBK, IWS, RHS, QQQ, IBM, PTY, IWO, DEM, PM, CHI, PHT, Reduced Positions: T, BNDX, PCY, D, XSOE, ADP, MSFT, HON, FDX, VZ, MCHP, UNP, MA, SWKS, MCD, ITW, FYX, INTC, JPM, V, RCS, SYK, PG, DUK, ALGN, SDIV, AEP, FBT, PYPL, VFC, CSCO, PEP, JNJ, O, NP, EMR, VMBS, TDIV, SPLV, GILD, MINT, LMBS, IWR, DPZ, DEO, BA, CVX, CSX, TEI, RNP, FATE, FB, FXO, DTE, IEI, IJK, IVV, FGD, CSQ, DD, ED, BOND, SPY, WMT, VCSH, NLY, DSL,Warning!", "spans": [[65, 68], [339, 342], [415, 418], [630, 633], [660, 663]], "date": "2022-02-01T22:38:12+00:00", "span_values": ["DTE", "AMD", "CSX", "IBM", "ADP"]}
{"sentence": "In this segment of \"Semiconductor Revolution\" on Motley Fool Live, recorded on Jan. 20, Fool contributors Jose Najarro and Billy Duberstein explain some of the core business differences between several leading semiconductor companies, KLA (NASDAQ: KLAC), Applied Materials (NASDAQ: AMAT), Lam Research (NASDAQ: LRCX), and ASML (NASDAQ: ASML).", "spans": [[235, 238], [255, 272], [289, 301]], "date": "2022-02-01T12:30:00+00:00", "span_values": ["KLA", "Lam Research", "Applied Materials"]}
{"sentence": "Twigg, who covers semiconductor equipment names, said the implications of the memory contract pricing trends were \"slightly negative\" for Lam Research Corp (NASDAQ: LRCX), Applied Materials Inc (NASDAQ: AMAT), KLA Corp (NASDAQ: KLAC), ASML Holding NV (NASDAQ: ASML), and Teradyne Inc (NASDAQ: TER).", "spans": [[138, 150], [172, 189], [210, 213], [271, 279]], "date": "2022-01-31T17:59:27+00:00", "span_values": ["KLA", "Teradyne", "Lam Research", "Applied Materials"]}
{"sentence": "New Street Research Initiates Coverage On Buy Dec 2021 JP Morgan Maintains OverweightView More Analyst Ratings for MUView the Latest Analyst RatingsSee more from BenzingaAnalysts Slash Teradyne Price Target Post Q4 Results Micron To Shut Shanghai DRAM Design Operations, Relocate Engineers: Report© 2022 Benzinga.com.", "spans": [[185, 193], [223, 229]], "date": "2022-01-31T17:59:27+00:00", "span_values": ["Teradyne", "Micron"]}
{"sentence": "New Purchases: CFLT, CI, BPOP, TLRY, TLRY, AMT, RDVY, MRK, GE, MKSI, HON, GSSC, ENTG, WAL, SPG, NYCB, LMT, KD, CDW, BBEU, AVUV, ARR, Added Positions: SPY, IJR, VTIP, VZ, VOO, VB, TPX, GSEW, PICK, CVX, VXUS, ACB, SRLN, XBI, PYPL, PFE, GILD, KMB, GSIE, HPE, BIV, TSM, XRT, DIS, DXC, EUFN, FB, GPRO, GUNR, VYM, IGF, IVV, MBB, AFB, AGEN, BRK.B, BSJM, CAT, CMCSA, JNJ, JPM, KRBN, KRE, VNQI, MCD, MMM, NEE, NVS, RTX, SRE, V, VCSH, IAC, Reduced Positions: IBKR, JPST, SPSB, CARS, VWO, USMV, KLAC, ADBE, JBL, IWL, KALA, ARKK, F, TSCO, TSLA, TXN, BAC, VTRS, XSD, DHR, TRUE, GIS, GLD, AGR, IDXX, INO, ITB, ADNT, ACN, ODFL, KIM, COST, COKE, LLY, LQD, MUR, NFLX, NUV, CRM, PEP, PFF, PG, PWR, COP, STT, TMO, Sold Out: VNLA, QQQJ, HUBS, ARKF, EMQQ, LOW, NOC, T,Warning!", "spans": [[59, 61], [111, 114]], "date": "2022-01-28T18:38:02+00:00", "span_values": ["CDW", "GE"]}
{"sentence": "Investment company Livingston Group Asset Management CO (operating as (Current Portfolio) buys Blackstone Inc, Microsoft Corp, Advanced Micro Devices Inc, Nutrien, NVIDIA Corp, sells The Home Depot Inc, Vanguard Information Technology ETF, Cardinal Health Inc, Boswell (JG) Co, Vanguard Mega Cap Value ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Livingston Group Asset Management CO (operating as.", "spans": [[111, 120], [164, 170], [187, 197], [240, 255]], "date": "2022-01-27T22:38:25+00:00", "span_values": ["Home Depot", "NVIDIA", "Microsoft", "Cardinal Health"]}
{"sentence": "New Purchases: BX, KLAC, AVGO, GS, DVN, ASML, FLRN, AGGY, CF, SCHV, SRLN, GNRC, DDOG, JNK, ALGN, FTNT, VOT, QYLD, BSCN, BSJM, BSCO, EFG, ZS, DKS, VUG, NET, LAC, ASO, AMRC, RPD, ENTG, VRP, PCTY, SJNK, AVTR, ZI, RGEN, CPE, KKR, PAYC, BSCP, LRCX, UMC, IUSG, ARES, BSJN, NEAR, SCHP, TDW, IGHG, S, S, VLU, LNG, FBCG, ALNY, HYG, DFSD, LQD, IWR, LULU, PLD, SHM, DFAI, EBAY, GSIG, IEMG, GSST, LLY, TSM, TYL, TSN, VNQ, VCIT, ACN, CP, GILD, GIGB, GTIP, HOLX, VLUE, MPC, MAS, MTD, NUE, ORCL, PANW, SMLP, HYD, ZTS, ALC, AMT, FDX, ICLR, IBTX, DBC, BSJO, EFA, EFV, MELI, MET, NZF, PSQ, O, RMD, SCHE, XLB, XLRE, XLK, SHOP, SO, XOP, MLN, VB, VPU, WPM, BKN, EIM, ZDGE, HIO, Added Positions: MSFT, AMD, NTR, NVDA, AMAT, AAPL, PFE, FB, NOW, BSV, NLY, SCHG, LOW, SCHM, CEF, TSLA, SCHA, KMI, VEU, F, INTU, SCHF, POOL, SPY, TIP, OIH, CDNS, FLOT, PRFT, XOM, IJR, DFAC, VTIP, VBK, VTV, UNH, DVA, VBR, DPZ, ANGL, GOOGL, CM, NEM, QCOM, VOE, FTS, BRK.B, KR, CAJ, EFAV, THRM, LAZ, BA, NGG, DHI, HAS, VSH, IAU, SLY, VO, WMT, CVX, MRK, PKG, PGR, SBSW, MDY, SYK, VV, DIVO, CVLG, NUSI, LHX, CRM, SCHX, SRCL, TXN, TFC, UNP, VIG, MMM, GOOG, KO, JPM, SH, PB, ABT, ABBV, ALB, SWAN, BAC, EA, ENB, IWO, IWN, JNJ, MDT, NVO, PM, RTX, VZ, AMGN, BMY, C, DUK, GSK, USMV, XLP, XLE, Reduced Positions: SPYG, SPYV, HD, VGT, ADBE, MGK, VYM, AMZN, NFLX, T, CVS, NKE, NEE, SPLG, DHR, PEP, XLF, DSI, INTC, WRLD, DOV, HEDJ, XLY, GE, FAST, V, IJH, VXF, OXY, MA, DE, XRAY, PG, DJUL, DOCU, COST, IXUS, CMCSA, IVV, UPS, IYC, WTS, TGT, VXX, VEA, SPDW, CSCO, XLI, CAT, SCHD, ETHO, DIS, RWM, USIG, VMC, MDLZ, XSD, WM, PYPL, DAL, DOG, IBM, SCHB, HUSV, VMBS, VWO, IWY, SLYV, MDYV, MCD, DIA, XLU, TMO, IWX, IWS, LMT, RPG, BEP, CZA, RWO, HDMV, Sold Out: CAH, MGV, BWEL, HON, BAX, VOX, BIIB, CINF, JMSB, SWKS, SHE, ABNB, VIAC, VXUS, GILT, MHTX, NLLSF, NEWH, ARFXF, RWBYF,Story continuesWarning!", "spans": [[361, 365], [680, 683], [1378, 1380], [1576, 1579]], "date": "2022-01-27T22:38:25+00:00", "span_values": ["IBM", "EBAY", "AMD", "GE"]}
{"sentence": "Wright Investors Service Inc Buys Tesla Inc, Marriott International Inc, Caterpillar Inc, Sells ....", "spans": [[34, 39], [45, 67], [73, 84]], "date": "2022-01-27T22:38:12+00:00", "span_values": ["Marriott International", "Tesla", "Caterpillar"]}
{"sentence": "Milford, CT, based Investment company Wright Investors Service Inc (Current Portfolio) buys Tesla Inc, Marriott International Inc, Caterpillar Inc, Cisco Systems Inc, Ameriprise Financial Inc, sells Abbott Laboratories, Altria Group Inc, PayPal Holdings Inc, Charter Communications Inc, KLA Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Wright Investors Service Inc.", "spans": [[92, 97], [103, 125], [131, 142], [148, 153], [167, 187], [199, 205], [220, 226], [238, 244], [259, 281], [287, 290]], "date": "2022-01-27T22:38:12+00:00", "span_values": ["Ameriprise Financial", "PayPal", "Marriott International", "Caterpillar", "Charter Communications", "Tesla", "Cisco", "KLA", "Altria", "Abbott"]}
{"sentence": "New Purchases: TSLA, MAR, CAT, AMP, UPS, WFC, CTRA, CNC, ALSN, GNTX, DECK, TSN, Added Positions: CSCO, BMY, DAL, JPM, ORCL, ACN, MCK, ADBE, BYD, MRO, UNH, TGT, ANTM, HD, BA, EOG, TAP, DE, PM, PNC, BLK, ABBV, JEF, EMR, NEE, T, ETN, IBM, DUK, TD, OKE, KO, KMB, C, AMAT, USB, BP, BEN, PPL, VLO, IVZ, GPC, IP, BAC, TNL, CVX, LOW, PAYX, SYF, RIO, MRK, FTNT, CACI, AXP, VZ, LHX, REGN, NLY, COST, LUV, QCOM, GILD, SPGI, DIS, MPW, OHI, NFLX, NVR, NRG, MRNA, NVT, UNP, JBLU, TJX, Reduced Positions: AAPL, MO, PYPL, MA, AMZN, ETSY, FB, COP, DFS, MSFT, ALL, LMT, MS, PGR, WBA, FDX, CMCSA, CVS, V, CSX, EXAS, VEEV, RS, TXG, NVDA, LEN, LKQ, NWL, STLD, AVGO, PVH, Sold Out: ABT, CHTR, KLAC, ALGN, WEN, TER, LRCX, JCI, GM, ACM, COF, WAT, ULTA, ZS, FL, AMED, SLVM,Warning!", "spans": [[231, 234], [282, 285], [434, 437], [516, 520], [586, 589], [645, 648], [704, 706]], "date": "2022-01-27T22:38:12+00:00", "span_values": ["GM", "PVH", "CSX", "PPL", "ETSY", "IBM", "NVR"]}
{"sentence": "Investors and others should note that KLA announces material financial information including SEC filings, press releases, public earnings calls and conference webcasts using an investor relations website (ir.kla.com).", "spans": [[38, 41], [208, 211]], "date": "2022-01-27T21:05:00+00:00", "span_values": ["KLA", "kla"]}
{"sentence": "Jlb &amp; Associates Inc Buys KLA Corp, Target Corp, Gentex Corp, Sells Global Payments Inc, ....", "spans": [[30, 33], [72, 87]], "date": "2022-01-26T22:38:05+00:00", "span_values": ["KLA", "Global Payments"]}
{"sentence": "Plymouth, MI, based Investment company Jlb & Associates Inc (Current Portfolio) buys KLA Corp, Target Corp, Gentex Corp, Allegion PLC, The Hershey Co, sells Global Payments Inc, Cracker Barrel Old Country Store Inc, Polaris Inc, C.H. Robinson Worldwide Inc, Globe Life Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Jlb & Associates Inc.", "spans": [[85, 88], [121, 129], [157, 172], [229, 242], [258, 268]], "date": "2022-01-26T22:38:05+00:00", "span_values": ["KLA", "Globe Life", "C.H. Robinson", "Allegion", "Global Payments"]}
{"sentence": "Investment company Sepio Capital, LP (Current Portfolio) buys Vanguard FTSE Developed Markets ETF, Vanguard FTSE Emerging Markets ETF, Vanguard Mid-Cap ETF, iShares MSCI Global Impact ETF, Nucor Corp, sells SoFi Technologies Inc, SoFi Technologies Inc, Seagate Technology Holdings PLC, AutoZone Inc, Bath & Body Works Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Sepio Capital, LP.", "spans": [[165, 169], [189, 194], [253, 260], [286, 294], [300, 317]], "date": "2022-01-25T18:38:17+00:00", "span_values": ["MSCI", "AutoZone", "Seagate", "Nucor", "Bath & Body Works"]}
{"sentence": "New Purchases: SDG, AMAT, NUE, CB, GXF, COF, MGM, ABBV, SRLN, SJNK, EIS, ABT, SYF, MPC, EWN, SHW, CRBN, BIIB, BBY, GM, PIN, ADBE, JPST, ZHDG, APTV, GPN, ULST, HOOD, TIP, AMPL, ETN, MQ, JPM, KMB, PEP, XLY, TSM, GENI, Added Positions: VEA, VWO, VO, MS, VOE, INTC, FB, RSP, MTCH, DIS, ASTR, UNP, EWP, VB, VTV, HMOP, CCI, VTIP, APD, BK, AMZN, CMI, V, SNAP, TFX, ILMN, TGT, EWS, EWW, DKS, EWO, EWY, GREK, BA, CMG, GDDY, EWT, BLK, JNJ, LOW, TXN, ASHR, EIRL, QQQ, VNQ, CASY, CVX, CSCO, DEO, D, FAST, PAYX, PFE, PGR, UPS, GOOG, PYPL, KWEB, AGCO, MO, CINF, CMCSA, DLB, NEE, BEN, GS, HPQ, MRK, NFLX, SBUX, UNH, VRTX, ET, PM, BKI, PINS, SNOW, EYLD, IJR, JETS, PDBC, VTI, AMD, AMT, AME, ACGL, CSX, DHR, ELS, F, HEI, IBM, ISRG, KR, LKQ, LII, MCO, NVR, ODFL, BKNG, SBAC, SLB, TDG, AWK, AL, UI, SQ, TWLO, YUMC, SE, UBER, CRWD, WISH, RBLX, ACWF, EDV, GLD, HYEM, IYW, MINT, PXH, VGT, VOX, Reduced Positions: VOO, AZO, BRK.B, PTRA, IWM, CI, BABA, AAPL, EFA, EPOL, MSFT, QCOM, ROST, JCI, DG, HCA, DE, NCNO, BAC, NVDA, NSC, EBAY, FYLD, CPNG, XRAY, IT, ANTM, ZM, XLU, XLV, XLI, IWB, PCY, XLK, LRCX, MANH, TJX, IAU, CME, PG, CHTR, AYI, CSL, CL, JBHT, NKE, NDSN, TRMB, VZ, MA, HCAT, NVST, SH, BLKB, CHH, COST, FDS, MGA, MET, CRM, TECH, RTX, WRB, WEX, BX, ULTA, DEEP, XLB, AMG, ADS, ATR, ADP, CACI, CF, COLM, DECK, HON, IEX, ICE, JLL, KNX, LSTR, MKL, MORN, NVS, ORLY, ORCL, RPM, POOL, SEIC, SCI, UMPQ, WFC, BR, BURL, GDX, IVV, VIXM, XLP, AMP, ADM, BLL, BG, CDNS, CSGP, KO, CPRT, EFX, FISV, GGG, HSIC, HXL, PB, SYK, TMO, UL, WMT, ARMK, TMX, WMS, TTD, OKTA, MDB, ZS, CHWY, NET, U, PLTR, ABNB, ARKG, DVY, EEM, IMTM, SYLD, Sold Out: SOFI, SOFI, STX, NORW, BBWI, TUR, RSX, KLAC, NXPI, T, ACN, SWKS, DOCN, CLDR, CERN, FXI, DBA, MDT, UAL, DCI, RNG, TWTR, FTDR, ZBH, DASH, XPDI, ESS, FSK, PULS, C, PXD,Story continuesWarning!", "spans": [[115, 117], [660, 663], [681, 684], [704, 707], [734, 737], [1004, 1008], [1264, 1267], [1419, 1422]], "date": "2022-01-25T18:38:17+00:00", "span_values": ["GM", "ADM", "ADP", "AMD", "CSX", "IBM", "EBAY", "NVR"]}
{"sentence": "Buys Ulta Beauty Inc, UnitedHealth Group Inc, KLA Corp, ....", "spans": [[5, 16], [22, 40], [46, 49]], "date": "2022-01-24T22:38:09+00:00", "span_values": ["UnitedHealth Group", "Ulta Beauty", "KLA"]}
{"sentence": "Investment company Pacific Wealth Strategies Group, Inc. (Current Portfolio) buys Ulta Beauty Inc, UnitedHealth Group Inc, KLA Corp, Cloudflare Inc, Snowflake Inc, sells Invesco BulletShares 2022", "spans": [[82, 93], [99, 117], [123, 126], [170, 177]], "date": "2022-01-24T22:38:09+00:00", "span_values": ["UnitedHealth Group", "Ulta Beauty", "KLA", "Invesco"]}
{"sentence": "High Yield Corporate Bon, ARK Genomic Revolution ETF, Northrop Grumman Corp, Honeywell International Inc, Philip Morris International Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Pacific Wealth Strategies Group, Inc..", "spans": [[54, 70], [77, 86], [106, 133]], "date": "2022-01-24T22:38:09+00:00", "span_values": ["Northrop Grumman", "Philip Morris International", "Honeywell"]}
{"sentence": "Maj Invest Holding A Buys KLA Corp, Meta Platforms Inc, Alibaba Group Holding, Sells Carnival ....", "spans": [[26, 29], [36, 40], [85, 93]], "date": "2022-01-24T18:38:19+00:00", "span_values": ["Meta", "KLA", "Carnival"]}
{"sentence": "Investment company Maj Invest Holding A (Current Portfolio) buys KLA Corp, Meta Platforms Inc, Alibaba Group Holding, sells Carnival Corp, American Express Co, Canadian National Railway Co, U.S. Bancorp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Maj Invest Holding A. As of 2021Q4, Maj Invest Holding A owns 37 stocks with a total value of $6.2 billion.", "spans": [[65, 68], [75, 79], [124, 132], [139, 155]], "date": "2022-01-24T18:38:19+00:00", "span_values": ["Meta", "KLA", "American Express", "Carnival"]}
{"sentence": "Investment company Alhambra Investment Partners LLC (Current Portfolio) buys VanEck Short Muni ETF, Vanguard Short-Term Bond ETF, Vanguard Tax-Exempt Bond ETF, iShares Short-Term National Muni Bond ETF, iShares National Muni Bond ETF, sells Invesco BulletShares 2021 Corporate Bond ETF, iShares 0-5 Year Investment Grade Corporate Bond E, W.P. Carey Inc, Leidos Holdings Inc, iShares S&P GSCI Commodity-Indexed Trust during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Alhambra Investment Partners LLC.", "spans": [[241, 248], [355, 361]], "date": "2022-01-21T22:38:19+00:00", "span_values": ["Invesco", "Leidos"]}
{"sentence": "New Purchases: MUB, ERIC, KLAC, NOK, MDLZ, DON, AEP, EFG, EXPR, Added Positions: SMB, BSV, VTEB, SUB, IAU, IEI, DVY, BIIB, IWM, GRMN, BMY, EFV, IYR, IWN, SCZ, IGSB, IVE, IBB, AGG, VIAC, VXX, PDBC, MRK, GE, CHWY, ACWI, KMI, XOM, EFA, XLF, GLD, RWO, AMZN, BWZ, DIS, HACK, ET, Reduced Positions: TDS, RWX, SLQD, GSG, TGT, DGRO, PYPL, FLDR, BSCO, IJR, NKE, JPST, COST, TIP, AAPL, MSFT, ACN, FB, HD, CI, UNH, ORCL, BSCM, AXP, ABBV, SBUX, NOC, WMT, YUM, ABT, ADBE, CSCO, JPM, CVS, VZ, AMGN, CSX, INTC, BSCN, SHY, RTX, PLD, IVV, JNJ, SONY, QCOM, SPY, DJP, TMO, V, Sold Out: BSCL, WPC, LDOS,Warning!", "spans": [[202, 204], [485, 488]], "date": "2022-01-21T22:38:19+00:00", "span_values": ["CSX", "GE"]}
{"sentence": "(Current Portfolio) buys Canadian Pacific Railway, iShares Russell 2000 ETF, KLA Corp, iShares ESG Aware U.S. Aggregate Bond ETF, Discovery Inc, sells , Vanguard Communication Services ETF, Shopify Inc, Vanguard FTSE Emerging Markets ETF, Vanguard Value ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Institute for Wealth Management, LLC..", "spans": [[77, 80], [130, 139]], "date": "2022-01-21T22:38:07+00:00", "span_values": ["Discovery", "KLA"]}
{"sentence": "New Purchases: CP, EAGG, DLTR, NET, OKTA, VNM, IYR, IWN, IGF, DFAC, CWB, U, SNOW, WDC, TER, NEE, EL, CIEN, BVH, APA, ICLR, APD, TEL, MNST, DFAT, DGRO, DVN, IWR, PIE, Added Positions: IWM, KLAC, ESGU, SPYX, DISCK, TWLO, NULG, DTD, VCSH, SCHD, GSY, DSI, EFAX, NULV, IVW, CRM, MGK, EUSB, HYGV, IEV, EFG, IHE, IHI, MDY, EEM, XLE, XLF, SQ, DLN, BBH, SPOT, AGG, FGEN, SE, ROKU, TDOC, XLY, EFA, ESGE, IWC, PJP, TIP, TLT, USMV, XLK, XLP, XLV, CME, SWKS, SHW, SAP, MCO, LMT, DE, C, CHH, TWTR, CVS, BA, AMAT, AMGN, UHAL, ACN, ABT, T, DIS, GOOG, V, MELI, VMW, MA, MTN, WM, WYNN, NUMG, ASML, ZTS, SSSS, KKR, AIG, AVGO, ADP, LIN, VIAC, SHV, DOW, SCHW, HNDL, BILL, MET, DIA, KRE, IYT, EXPE, FISV, GILD, ISRG, JCI, CMG, MRK, Reduced Positions: VWO, QQQ, VTV, BABA, QUAL, SPY, QLD, AZN, BRK.B, VBR, VUG, FDS, VZ, BND, BNDX, VEA, VGSH, VOO, ALK, LHX, ANAB, VGT, VNQ, VPL, XLI, AEG, GLW, XOM, HON, MCD, STX, LUV, WSM, XLNX, CET, WFG, FTNT, COLL, GLD, IVE, IVV, MTUM, PSI, PWB, QQEW, SPLG, VAW, VBK, VCR, VFH, VHT, VIG, VOT, XLU, XMMO, ATVI, AMD, HES, AEO, AEP, NLY, WTRG, BIIB, CVX, CI, CMI, DD, EOG, EMR, FICO, GIS, GSK, IBM, IDXX, INTC, MDLZ, MGM, MRVL, MAS, SPGI, NWBI, NVS, PSA, WRK, SNY, SLB, SU, TTE, TSN, UNP, WFC, WY, YUM, GAB, USA, TSI, CII, FFA, DAL, CHW, LULU, MSCI, LYB, NXPI, GWRE, PSX, FANG, HQY, MSGS, RRR, CTVA, MSGE, TUEM, BAR, DVY, EFAV, FDN, HEWJ, IJR, MGC, RAVI, SLV, SPIB, TOTL, VCLT, VDC, VDE, VGK, VPU, XLB, XLRE, Sold Out: KSU, VOX, SHOP, DISCA, VIS, IEMG, IVOV, XLC, FLGE, EEMV, FXI, IEF, JD, LQD, BIDU, RFI, LORL, EDU, VO,Story continuesWarning!", "spans": [[596, 599], [607, 610], [628, 631], [1023, 1026], [1104, 1107], [1254, 1258]], "date": "2022-01-21T22:38:07+00:00", "span_values": ["AIG", "MSCI", "AMD", "IBM", "ADP", "DOW"]}
{"sentence": "NXP Semiconductors (NASDAQ:NXPI) Qorvo (NASDAQ:QRVO) Qualcomm (NASDAQ:QCOM) Skyworks Solutions (NASDAQ:SWKS)SemiconductorStocks: Amkor Technology (AMKR) a close up image of a semiconductorSource: Shutterstock52-week range: $15.51 – $29.50Dividend Yield: .9%Tempe, Arizona-based Amkor Technology provides outsourced semiconductor packaging and test services to manufacturers, fabless semiconductor companies and contract foundries.", "spans": [[0, 3], [33, 38], [53, 61], [76, 84]], "date": "2022-01-21T20:27:09+00:00", "span_values": ["NXP", "Qorvo", "Qualcomm", "Skyworks"]}
{"sentence": "The 12-month median price forecast for NXP Semiconductors stock is $250.SemiconductorStocks: Qorvo (QRVO)", "spans": [[39, 42], [93, 98]], "date": "2022-01-21T20:27:09+00:00", "span_values": ["NXP", "Qorvo"]}
{"sentence": "On the results, CEO Cristiano Amon remarked, “As of fiscal 2021, we are exceeding our 2019 Analyst Day targets for revenue growth and diversification and operating margin expansion, while more than doubling our year-over-year Non-GAAP EPS.”Apple’s purchase of Intel‘s (NYSE:INTC) smartphone chipset business led to investor concerns that the iPhone would no longer use Qualcomm chipsets.", "spans": [[240, 245], [260, 265], [369, 377]], "date": "2022-01-21T20:27:09+00:00", "span_values": ["Apple", "Intel", "Qualcomm"]}
{"sentence": "The 12-month median price forecast for Qualcomm stock is $208.SemiconductorStocks: Skyworks Solutions (SWKS) the Skyworks (SWKS) website is loading on a smartphoneSource: madamF / Shutterstock.com52 week range: $140.26 – $204Dividend Yield: 1.6%Irvine, California-based Skyworks Solutions offers semiconductors for wireless devices.", "spans": [[39, 47], [83, 91], [113, 121], [270, 278]], "date": "2022-01-21T20:27:09+00:00", "span_values": ["Qualcomm", "Skyworks"]}
{"sentence": "Brattleboro, VT, based Investment company Trust Co Of Vermont (Current Portfolio) buys Vanguard Short-Term Inflation-Protected Securities, iShares TIPS Bond ETF, ViacomCBS Inc, Canadian Pacific Railway, Deere, sells Five Star Senior Living Inc, Boeing Co, Wells Fargo, Arthur J. Gallagher, Weyerhaeuser Co during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Trust Co Of Vermont.", "spans": [[245, 251], [256, 267], [279, 288], [290, 302]], "date": "2022-01-21T18:38:17+00:00", "span_values": ["Weyerhaeuser", "Boeing", "Gallagher", "Wells Fargo"]}
{"sentence": "New Purchases: TIP, CP, TRP, SHY, CTRA, KLAC, MFC, AGG, VGT, VNQ, AMD, ALB, MATX, AEP, AIG, AWR, ABC, WTRG, ACGL, AN, BCE, BMO, BNS, BHB, BAX, BHLB, BXP, BRKL, BRO, CBZ, CBT, CPT, KMX, FIS, CHKP, CHH, CINF, CAG, DPZ, DMLP, EOG, EMN, EW, EPD, EL, EXC, FRT, GSK, HSIC, HUM, IDXX, IRM, J, JCI, KRC, MET, MCHP, MSI, PKG, PGR, PRU, PEG, DGX, RPM, RSG, ROP, RY, ONTO, SLB, SRE, SWK, STT, TFX, TRI, TRMB, UNF, UVSP, WDFC, WBA, EVRG, WTFC, XEL, ETV, BR, BIP, FNV, KDP, DG, LEA, AMRC, BYDDY, FRC, NOW, HASI, BABA, CDK, KEYS, BST, SHOP, RUN, HPE, FTV, HWM, FND, MRNA, DES, DVY, FBGX, FREL, IBB, IEFA, IEMG, IJS, IJT, IVE, IWD, IWF, IWS, LQD, MTUM, MUB, PKW, SCHD, SCZ, SOXX, TQQQ, VBK, VCSH, XLK, XLY, AOS, ABM, PLD, ASML, AKAM, ALGN, ALKS, LNT, AEE, NLY, ATRS, AON, ADM, ARNA, AVY, BHP, BP, BPT, BMI, BLL, BLDP, GOLD, BIG, BKH, BSX, BTI, CAL, BF.B, CBRE, CTS, CCMP, CPB, CAH, CSL, CWST, CE, CNC, LUMN, CRL, SCHW, CTAS, CTXS, NNN, COO, INGR, CCI, CW, DTE, DAR, DVN, DXCM, DISCA, DLTR, EWBC, DISH, EIX, EA, EFX, EQR, EXAS, EXPD, EXR, FCN, FAST, FITB, FR, FISV, FLS, FMX, F, BEN, FMS, GME, GRMN, IT, RHP, GPN, GFF, HSBC, HAIN, HAL, HALO, HOG, HIG, HAS, HE, HA, WELL, HOLX, HBNC, HRL, HST, HBAN, INFO, ITT, IDA, ILMN, TT, IP, IPG, JBLU, KAMN, KR, LKQ, LEN, JEF, LBTYA, MMP, MGA, MRO, MPX, MMC, MAT, MCK, MPW, MU, MYE, NFG, NOV, NWL, NEM, NI, NOK, NTRS, NUAN, OXY, ODC, OMC, ONCY, OKE, PCAR, PNM, PPL, PKE, FRPH, PLUG, PII, STL, PWR, RYN, REGN, RF, RMD, RHI, SSB, SEIC, STX, SBNY, SKX, SWKS, LUV, EQNR, SUI, NLOK, TSM, AXON, TDY, THO, TTE, TGI, TYL, UAL, UAA, UNFI, URI, UTL, KMPR, UHT, VLO, VGR, VTR, VRTX, VOD, VMC, WPC, WAB, GHC, WRE, WTS, ANTM, WVVI, WMB, WTW, WEC, XLNX, AUY, ZBRA, STAR, BF.A, L, LEN.B, RDS.B, MHN, ASA, BCV, JHS, TY, MCI, NRK, ENX, CII, EOS, CODI, TNL, HBI, AVXL, AVAV, TMUS, BX, LULU, MASI, VMW, SATS, AUPH, SRNE, DISCK, MICCF, SFTBY, WKHS, STWD, ATNM, VRSK, CVE, PBA, PLOW, FAF, KKR, LYB, GM, HHC, KMI, HII, STAG, EMO, AMCX, APTV, ZNGA, ALSN, RCEL, ENPH, PNR, WDAY, MPLX, ALEX, FWONA, VOYA, IVH, BLUE, ESPR, DOC, GCI, CGC, RYAM, ACB, FWONK, AVNS, LBRDA, BOX, SHAK, TLRY, TLRY, NVTA, FTAI, NNDM, BLD, TDOC, CC, LILA, LILAK, NTRA, MSGS, SQ, MIME, GCP, TWLO, TTD, YUMC, LW, CNDT, SNAP, GOOS, CVNA, APPN, BHF, FUV, NVT, DOCU, INSP, WH, FOCS, DELL, ALC, ZM, KTB, LKNCY, CRWD, AMCR, INMD, TXG, PTON, VNT, FSR, DM, UWMC, UWMC, ME, ONL, ARKG, BIBL, BNDX, BSCM, BSCN, BSCO, BSJO, BUG, CGW, DGRO, DGRW, DIA, EDEN, ESGV, FDN, FIW, FXH, GDXJ, GSLC, HAIL, HYLB, IAU, ICVT, IDV, IEF, IEI, IGF, IGOV, IHI, ILF, ISMD, ITA, ITOT, IUSV, IWC, IWL, IXUS, MGC, MVV, NOBL, PAVE, PFFD, PGJ, QDEF, QQQJ, QTEC, SCHA, SCHR, SGOL, SLV, SPLB, SPLG, SPTM, SPYD, SSO, STIP, TPHD, TPLC, USRT, UWM, VDC, VDE, VHT, VIS, VOT, VSS, VT, VXF, WWJD, XLE, XLF, Added Positions: VTIP, VIAC, MSFT, PFE, DIS, ADBE, PYPL, DE, SPY, DD, QQQ, KO, CSCO, LMT, VEU, PNC, ENB, V, NEE, GOOGL, MA, INTU, JPM, MRK, GLD, BAC, D, BDX, VB, BIV, VEA, VBR, SBUX, TROW, TJX, VOO, TGT, VOE, TXN, UNH, WMT, PBD, WM, IVW, IVV, XYL, PANW, IJR, LSXMA, AXP, ICE, LLY, EMR, ECL, XOM, DLR, STZ, INTC, C, LRCX, CME, COF, CVS, PEP, CRM, AMT, CI, FDX, VO, COP, CMI, DUK, BK, VTI, DOW, SHW, ZTS, GE, GIS, GPC, CMG, MTB, SPGI, UPS, MDT, MS, LIN, SYY, SO, Reduced Positions: VZ, FVE, MMM, T, CL, BA, IBM, NSC, WFC, NVS, PG, ABT, BLK, TRV, VWO, GILD, SJM, MKC, O, SYK, VFC, WY, TSLA, FB, SYF, BND, BSV, EEM, ETN, ATO, AJG, TFC, AMAT, ADI, AMGN, CMCSA, ATVI, DEO, FBHS, CB, GD, YUM, ZBH, LDOS, PM, AVGO, CHTR, SDY, AFL, IWP, FAN, LSXMK, FREE, CARR, OTIS, ARKK, MO, PPG, GOOD, HPQ, SNEX, ED, MDLZ, MKL, MAR, NGG, CLX, CVX, NVO, WAT, PBH, LNG, CERN, BIIB, TU, UL, AVA, ADSK, WRB, GWW,Story continuesWarning!", "spans": [[66, 69], [87, 90], [185, 188], [752, 755], [757, 760], [840, 844], [941, 944], [981, 985], [1383, 1386], [1900, 1902], [3121, 3124], [3136, 3138], [3238, 3241], [3485, 3489]], "date": "2022-01-21T18:38:17+00:00", "span_values": ["AIG", "AON", "GM", "DTE", "DISH", "FIS", "GE", "IBM", "AMD", "PPL", "CBRE", "ADM", "OTIS", "DOW"]}
{"sentence": "Threadgill Financial, Llc Buys Mastercard Inc, Visa Inc, Ulta Beauty Inc, Sells Etsy Inc, Nike ....", "spans": [[31, 41], [47, 51], [57, 68], [80, 84], [90, 94]], "date": "2022-01-21T18:38:03+00:00", "span_values": ["Visa", "Etsy", "Ulta Beauty", "Nike", "Mastercard"]}
{"sentence": "Investment company Threadgill Financial, Llc (Current Portfolio) buys Mastercard Inc, Visa Inc, Ulta Beauty Inc, PayPal Holdings Inc, Lam Research Corp, sells Etsy Inc, Nike Inc, Fiserv Inc, The Walt Disney Co, Dun & Bradstreet Holdings Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Threadgill Financial, Llc.", "spans": [[70, 80], [86, 90], [96, 107], [113, 119], [134, 146], [159, 163], [169, 173], [179, 185], [200, 206]], "date": "2022-01-21T18:38:03+00:00", "span_values": ["PayPal", "Visa", "Lam Research", "Etsy", "Fiserv", "Disney", "Ulta Beauty", "Nike", "Mastercard"]}
{"sentence": "New Purchases: MA, ULTA, ASML, FND, VUG, Added Positions: V, PYPL, LRCX, AMAT, KKR, KLAC, SHW, ADSK, SBUX, QCOM, WIX, LOW, XOM, AMZN, GOOG, AAPL, AZO, FB, CVX, DG, NFLX, UNP, MSFT, EBAY, ADBE, CRM, FIVE, CSGP, LKQ, ACN, Reduced Positions: KO, Sold Out: ETSY, NKE, FISV, DIS, DNB, PGR, GDDY, T, HD, FAST, CHE, CI, IBM,Warning!", "spans": [[181, 185], [253, 257], [313, 316]], "date": "2022-01-21T18:38:03+00:00", "span_values": ["IBM", "EBAY", "ETSY"]}
{"sentence": "The holding were 10,269 shares as of 2021-12-31.Sold Out: Etsy Inc (ETSY)Threadgill Financial, Llc sold out a holding in Etsy Inc.", "spans": [[58, 62], [68, 72], [121, 125]], "date": "2022-01-21T18:38:03+00:00", "span_values": ["Etsy", "ETSY"]}
{"sentence": "Chapman Investment Management, LLC Buys Charles Schwab Corp, Tesla Inc, KLA Corp, Sells ....", "spans": [[40, 54], [61, 66], [72, 75]], "date": "2022-01-20T22:38:04+00:00", "span_values": ["KLA", "Tesla", "Charles Schwab"]}
{"sentence": "Investment company Chapman Investment Management, LLC (Current Portfolio) buys Charles Schwab Corp, Tesla Inc, KLA Corp, Western Alliance Bancorp, Target Corp, sells Fidelity National Information Services Inc, Gilead Sciences Inc, Coca-Cola Co, Merck Inc, McDonald's Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Chapman Investment Management, LLC.", "spans": [[79, 93], [100, 105], [111, 114], [210, 216], [231, 240], [245, 250], [256, 266]], "date": "2022-01-20T22:38:04+00:00", "span_values": ["Merck", "KLA", "Tesla", "Charles Schwab", "Coca-Cola", "Gilead", "McDonald's"]}
{"sentence": "Swarthmore Group Inc Buys AbbVie Inc, Pfizer Inc, Cboe Global Markets Inc, Sells Stryker Corp, ....", "spans": [[26, 32], [38, 44], [50, 54], [81, 88]], "date": "2022-01-19T18:38:09+00:00", "span_values": ["Pfizer", "AbbVie", "Cboe", "Stryker"]}
{"sentence": "Philadelphia, PA, based Investment company Swarthmore Group Inc (Current Portfolio) buys AbbVie Inc, Pfizer Inc, Cboe Global Markets Inc, Robert Half International Inc, Cisco Systems Inc, sells Stryker Corp, Allstate Corp, Lam Research Corp, Martin Marietta Materials Inc, Meta Platforms Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Swarthmore Group Inc.", "spans": [[89, 95], [101, 107], [113, 117], [138, 149], [169, 174], [194, 201], [208, 216], [223, 235], [242, 257], [273, 277]], "date": "2022-01-19T18:38:09+00:00", "span_values": ["Meta", "Martin Marietta", "Cboe", "Lam Research", "Stryker", "Cisco", "AbbVie", "Robert Half", "Pfizer", "Allstate"]}
{"sentence": "New Purchases: ABBV, PFE, CBOE, RHI, CSCO, KLAC, MAA, ORCL, DPZ, NLOK, CE, AMZN, NVDA, AVGO, Added Positions: AAPL, IVV, NTAP, EXR, TSN, JPM, VZ, GM, NEE, PXD, Reduced Positions: ALL, LRCX, FB, ANTM, CRM, TMO, BLK, DHI, MS, V, LOW, SSNC, ORLY, CAT, UPS, WFC, QCOM, TJX, UNP, GOOGL, RSG, SHW, MSFT, RF, PG, ABT, GLW, CVX, TFC, SCHX, Sold Out: SYK, MLM,Warning!", "spans": [[26, 30], [146, 148]], "date": "2022-01-19T18:38:09+00:00", "span_values": ["CBOE", "GM"]}
{"sentence": "The holding were 123,633 shares as of 2021-12-31.New Purchase: Cboe Global Markets Inc (CBOE)Swarthmore Group Inc initiated holding in Cboe Global Markets Inc.", "spans": [[63, 67], [88, 92], [135, 139]], "date": "2022-01-19T18:38:09+00:00", "span_values": ["CBOE", "Cboe"]}
{"sentence": "Viking Fund Management Llc Buys Caterpillar Inc, CenterPoint Energy Inc, Exxon Mobil Corp, ....", "spans": [[32, 43], [49, 67]], "date": "2022-01-14T22:38:24+00:00", "span_values": ["Caterpillar", "CenterPoint Energy"]}
{"sentence": "Minot, ND, based Investment company Viking Fund Management Llc (Current Portfolio) buys Caterpillar Inc, CenterPoint Energy Inc, Exxon Mobil Corp, Visa Inc, Cisco Systems Inc, sells 3M Co, Canadian Natural Resources, Magnolia Oil & Gas Corp, SolarEdge Technologies Inc, Truist Financial Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Viking Fund Management Llc.", "spans": [[88, 99], [105, 123], [147, 151], [157, 162], [182, 184], [242, 251], [270, 276]], "date": "2022-01-14T22:38:24+00:00", "span_values": ["3M", "SolarEdge", "Visa", "Caterpillar", "Truist", "Cisco", "CenterPoint Energy"]}
{"sentence": "Stock Yards Bank &amp; Trust Co Buys Eli Lilly and Co, Churchill Downs Inc, Anthem Inc, Sells ....", "spans": [[41, 46], [76, 82]], "date": "2022-01-13T18:38:23+00:00", "span_values": ["Lilly", "Anthem"]}
{"sentence": "Louisville, KY, based Investment company Stock Yards Bank & Trust Co (Current Portfolio) buys Eli Lilly and Co, Churchill Downs Inc, Anthem Inc, Procter & Gamble Co, Berkshire Hathaway Inc, sells Medtronic PLC, AT&T Inc, British American Tobacco PLC, RPM International Inc, Sherwin-Williams Co during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Stock Yards Bank & Trust Co.", "spans": [[98, 103], [133, 139], [145, 161], [166, 184], [196, 205], [211, 215], [274, 290]], "date": "2022-01-13T18:38:23+00:00", "span_values": ["AT&T", "Anthem", "Berkshire Hathaway", "Procter & Gamble", "Lilly", "Sherwin-Williams", "Medtronic"]}
{"sentence": "New Purchases: MCHP, CRM, QDF, KLAC, CTLT, SPG, DD, XLV, SOFI, SOFI, CB, DLN, PRU, LQD, GPC, GD, CHD, LHX, FLOT, NEP, GWW, OTIS, VTWV, BSV, VGT, DIA, SUSC, SPYG, HYS, IVW, PFXF, SLB, AMD, APD, ALL, AZO, CNI, LRCX, MU, PXD, SAP, BURL, SONY, TSCO, UBS, WFC, CROX, PTY, TEL, FTI, Added Positions: LLY, CHDN, ANTM, PG, MSFT, BRK.A, IWM, AAPL, EFA, XOM, AGG, HYG, KO, AMZN, CLX, EEM, PFE, JNJ, SYBT, PPG, ABT, CVX, JPM, IJH, IWD, IWF, MCD, GOOG, CVS, DE, VZ, IYW, VO, BMY, COST, PEP, ABBV, IWR, TIP, VWO, DUK, INTC, UPS, AWK, MUB, VEA, VNQ, ADP, TFC, EMR, HD, ORCL, PM, IVV, VB, GOOGL, LOW, NSC, SBUX, WM, SCZ, SPY, MMM, MO, AXP, BRK.B, CSX, DHR, HON, IBM, V, ADBE, AMT, ADI, BLK, CAT, CSCO, CL, COP, D, ENB, MDLZ, MRK, PAYX, LIN, USB, YUM, VOO, AMGN, BF.B, C, CMI, DLR, EL, GSK, ITW, SJM, KMB, SPGI, NVDA, PNC, SO, TSM, RTX, VFC, WMT, ZBH, MA, KDP, GLPI, DOW, IWP, VYM, XLK, AEP, BAX, BA, CMCSA, DEO, DLTR, ECL, ETR, FAST, GE, GIS, KR, LMT, MS, QCOM, O, RDS.A, TROW, UNH, WBA, XEL, PSX, FB, YUMC, CARR, DVY, GLD, IJR, IWS, VSS, XLY, Reduced Positions: MDT, T, PYPL, SHW, VTR, SHOP, WSO, F, WEC, EPD, MKC, TXN, NVS, XLE, IEI, FSFG, SYY, FITB, ETN, CINF, SCHW, BDX, BAC, ANSS, Sold Out: BTI, RPM, CAG, ETSY, BETZ, SBRA,Warning!", "spans": [[123, 127], [183, 186], [536, 539], [632, 635], [647, 650], [851, 854], [919, 921], [1196, 1200]], "date": "2022-01-13T18:38:23+00:00", "span_values": ["GE", "AMD", "CSX", "ETSY", "IBM", "OTIS", "ADP", "DOW"]}
{"sentence": "The sale prices were between $78.88 and $101, with an estimated average price of $91.34.Sold Out: Etsy Inc (ETSY)Stock Yards Bank & Trust Co sold out a holding in Etsy Inc.", "spans": [[98, 102], [108, 112], [163, 167]], "date": "2022-01-13T18:38:23+00:00", "span_values": ["Etsy", "ETSY"]}
{"sentence": "New Purchases: PLUG, OKTA, AHCO, BRO, AWK, PNC, PSX, Added Positions: LHCG, CMBM, AVNS, ITGR, NTUS, OLLI, BHE, B, BLKB, SHO, ENS, SPOT, OPEN, PLNT, SAGE, XPO, TXG, SUI, QCOM, ACC, RNG, XOM, RCII, ICLR, GNTX, LFUS, CSL, CASY, MKL, CFR, DRE, MPWR, NEE, RPM, QLYS, FBHS, TSCO, OSK, PTC, PKI, RHI, PXD, Reduced Positions: MEDP, OMCL, BOOT, ONTO, AMN, AMBA, MOV, EXLS, KFY, MMI, FWRD, KFRC, COKE, SIGI, IART, NXST, SSB, CNX, LPSN, ICFI, BCPC, FIX, FELE, DORM, UBSI, KALU, GIII, IDA, AMWD, EPAY, DIOD, STC, AUB, JJSF, LZB, PATK, SBCF, LPLA, LGIH, MC, CSWI, COUP, CACI, CTS, CPK, FICO, GTY, MBWM, ODFL, SF, UMBF, SPSC, PCRX, PANW, BURL, ADC, CASS, IDXX, ORLY, UTL, EPAM, SUPN, HLT, DEA, AJG, DHI, MCHP, TREX, LULU, MSCI, VEEV, PAYC, DBX, SMAR, DT, AME, BLL, CTAS, CSGP, COO, DPZ, MKSI, PAYX, POOL, SGEN, SNPS, TECH, FTNT, HZNP, SPLK, BERY, FANG, OMF, TRU, PSTG, FND, TENB, IAA, IAC, MRVI, GXO, AMZN, AAPL, CHD, DOV, ITT, JLL, KR, LAMR, MSFT, NVDA, PWR, QDEL, TFX, ZBRA, TDG, BR, PODD, MASI, FLT, ZNGA, FIVE, CDW, TNDM, GOOG, SEDG, EQH, YETI, CB, ABT, ATVI, ADBE, AMT, ATO, BIIB, BLK, CSX, CCMP, CME, CTXS, CMCSA, STZ, COST, EOG, EW, LLY, FMC, FR, HD, HUM, KEY, MTZ, MS, NKE, LIN, BKNG, RCL, TTEK, TMO, TKR, USB, RTX, VZ, WMT, WM, WFC, MA, FAF, FB, ZTS, LW, DOCU, Sold Out: SFIX, DKNG, MKTX, KLAC, INCY, NTRS, ATUS, SWX, AVGO, POST, TDOC, VMEO, EHTH, PCT,Warning!", "spans": [[279, 282], [658, 662], [708, 712], [1001, 1004], [1077, 1080], [1131, 1134]], "date": "2022-01-06T22:38:07+00:00", "span_values": ["CDW", "PTC", "MSCI", "EPAM", "FMC", "CSX"]}
{"sentence": "All earnings disclosures as well as the live earnings webcast will be available on the Investor Relations page of KLA's website at ir.kla.com.", "spans": [[114, 117], [134, 137]], "date": "2022-01-06T21:05:00+00:00", "span_values": ["KLA", "kla"]}
{"sentence": "Applied Materials Inc (NASDAQ:AMAT) and KLA-Tencor Corporation (NASDAQ:KLAC) are both semiconductor equipment makers, meaning semiconductor companies trying to solve shortage issues ordered more of their equipment; AMAT was set to close up 83% for the year while KLAC came in 10th in this list with a 66% gain.", "spans": [[0, 17], [40, 43]], "date": "2021-12-31T14:07:14+00:00", "span_values": ["KLA", "Applied Materials"]}
{"sentence": "KLA Upgraded to Overweight by Wells Fargo on Fundamentals.", "spans": [[0, 3], [30, 41]], "date": "2021-12-21T09:06:00+00:00", "span_values": ["KLA", "Wells Fargo"]}
{"sentence": "'KLA is well positioned to drive continued [wafer fabrication equipment] outperformance,' Wells Fargo says.", "spans": [[1, 4], [90, 101]], "date": "2021-12-21T09:06:00+00:00", "span_values": ["KLA", "Wells Fargo"]}
{"sentence": "Investment company Power Momentum Index VIT Fund (Current Portfolio) buys Targa Resources Corp, Boyd Gaming Corp, Alliance Data Systems Corp, Darden Restaurants Inc, HubSpot Inc, sells Charles River Laboratories International Inc, Fortinet Inc, EPAM Systems Inc, Trimble Inc, The AES Corp during the 3-months ended 2021Q3, according to the most recent filings of the investment company, Power Momentum Index VIT Fund.", "spans": [[142, 148], [185, 198], [231, 239], [245, 249], [263, 270], [280, 283]], "date": "2021-12-17T22:38:03+00:00", "span_values": ["Charles River", "Darden", "EPAM", "Fortinet", "Trimble", "AES"]}
{"sentence": "New Purchases: TRGP, BYD, ADS, DRI, HUBS, SPG, MORN, HCA, CG, INTU, MANH, ULTA, BX, GOOGL, CSCO, KEYS, IRM, CDW, NRG, LLY, GRMN, CHTR, TT, YETI, DKS, KSS, Added Positions: NCR, LRCX, EVR, R, AMAT, TTC, MAT, AVY, Reduced Positions: A, CRWD, BRKR, IDXX, ACN, ZBRA, TROW, TDC, EL, DFS, IPG, TGT, AN, IQV, SYF, Sold Out: CRL, FTNT, EPAM, TRMB, AES, KLAC, LNG, F, TXN, AVGO, TER, HSY, CMCSA, LH, CC, NXST, UPS, NWL, CINF, SPB, BRK.B, NWSA, NLY, LEG, LPLA, AGNC,Warning!", "spans": [[108, 111], [328, 332], [340, 343]], "date": "2021-12-17T22:38:03+00:00", "span_values": ["CDW", "AES", "EPAM"]}
{"sentence": "Investors who want to ride this chip boom should check out some of the top semiconductor stocks to buy for the new year that include NVIDIA Corporation (NASDAQ:NVDA), Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM), and Advanced Micro Devices, Inc. (NASDAQ:AMD), among others discussed in detail below.", "spans": [[133, 139], [271, 274]], "date": "2021-12-15T14:02:30+00:00", "span_values": ["NVIDIA", "AMD"]}
{"sentence": "Just like NVIDIA Corporation (NASDAQ:NVDA), Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM), and Advanced Micro Devices, Inc. (NASDAQ:AMD), ASML Holding N.V. (NASDAQ:ASML) is one of the stocks that elite investors are buying.", "spans": [[10, 16], [148, 151]], "date": "2021-12-15T14:02:30+00:00", "span_values": ["NVIDIA", "AMD"]}
{"sentence": "the world saw a chip shortage, elite hedge funds closely watched and piled into semiconductor stocks like NVIDIA Corporation (NASDAQ:NVDA), Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) and Advanced Micro Devices, Inc. (NASDAQ:AMD) in 2021.7.", "spans": [[106, 112], [243, 246]], "date": "2021-12-15T14:02:30+00:00", "span_values": ["NVIDIA", "AMD"]}
{"sentence": "In addition to NVIDIA Corporation (NASDAQ:NVDA), Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM), and Advanced Micro Devices, Inc. (NASDAQ:AMD), Micron Technology (NASDAQ:MU) is one of the stocks on the radar of hedge funds.", "spans": [[15, 21], [153, 156], [159, 165]], "date": "2021-12-15T14:02:30+00:00", "span_values": ["NVIDIA", "AMD", "Micron"]}
{"sentence": "VanEck Morningstar Wide Moat ETF Buys Polaris Inc, The Western Union Co, KLA Corp, Sells Adobe ....", "spans": [[73, 76], [89, 94]], "date": "2021-12-15T04:38:02+00:00", "span_values": ["Adobe", "KLA"]}
{"sentence": "Investment company VanEck Morningstar Wide Moat ETF (Current Portfolio) buys Polaris Inc, The Western Union Co, KLA Corp, Microchip Technology Inc, C.H. Robinson Worldwide Inc, sells Adobe Inc, ServiceNow Inc, BlackRock Inc, Northrop Grumman Corp, Yum Brands Inc during the 3-months ended 2021Q3, according to the most recent filings of the investment company, VanEck Morningstar Wide Moat ETF.", "spans": [[112, 115], [122, 131], [148, 161], [183, 188], [194, 204], [210, 219], [225, 241]], "date": "2021-12-15T04:38:02+00:00", "span_values": ["Microchip", "KLA", "C.H. Robinson", "Adobe", "Northrop Grumman", "BlackRock", "ServiceNow"]}
{"sentence": "If one proposal is adopted, companies such as Applied Materials Inc., KLA Corp. and Lam Research Corp. may find their ability to supply gear to SMIC severely limited.", "spans": [[46, 63], [70, 73], [84, 96]], "date": "2021-12-14T23:17:03+00:00", "span_values": ["KLA", "Lam Research", "Applied Materials"]}
