{"sentence": "American Airlines (NASDAQ:AAL) Delta Air Lines (NYSE:DAL) Southwest Airlines (NYSE:LUV)Airline Stocks to Buy: American Airlines (AAL) American Airlines plane on ramp in Chicago Airport.", "spans": [[31, 46], [58, 76]], "date": "2022-03-28T11:30:07+00:00", "span_values": ["Southwest Airlines", "Delta Air Lines"]}
{"sentence": "Delta Air Lines (DAL) Delta (DAL) airlines plane mid take-offSource: Markus Mainka / Shutterstock.comDelta Air Lines was the first carrier to report a profit coming out of the pandemic.", "spans": [[0, 15], [131, 138]], "date": "2022-03-28T11:30:07+00:00", "span_values": ["carrier", "Delta Air Lines"]}
{"sentence": "Airline Stocks to Buy: Southwest Airlines (LUV)Source: Markus Mainka / Shutterstock.comSouthwest, the largest discount carrier in the U.S., is one of the few airlines whose stock has managed to buck the market downturn this year.", "spans": [[23, 41], [119, 126]], "date": "2022-03-28T11:30:07+00:00", "span_values": ["Southwest Airlines", "carrier"]}
{"sentence": "\"Southwest's support, both at the airport and throughout our city, is what makes Denver a top place to live and work, as well as make it attractive for both business and leisure travelers to come visit the Mile High City.\"\"Swinerton is grateful to have been a part of the Southwest Airlines Technical Operations Complex Team as the general contractor, working alongside industry experts to bring this state-of-of-the-art hangar from conception to completion,\" said John Spight, Vice President of Swinerton's Colorado Division.", "spans": [[178, 187], [272, 290]], "date": "2022-03-24T18:30:00+00:00", "span_values": ["Southwest Airlines", "travelers"]}
{"sentence": "(PRNewsFoto/SOUTHWEST AIRLINES) CisionView original content to download multimedia:SOURCE Southwest Airlines Co.", "spans": [[12, 30], [90, 108]], "date": "2022-03-24T18:30:00+00:00", "span_values": ["Southwest Airlines", "SOUTHWEST AIRLINES"]}
{"sentence": "Delta Air Lines is poised to make a landmark deal with Boeing while American Airlines is resuming the sale of alcohol aboard its aircraft.", "spans": [[0, 15], [55, 61]], "date": "2022-03-18T19:57:34+00:00", "span_values": ["Boeing", "Delta Air Lines"]}
{"sentence": "In the past week, key airline players like American Airlines AAL, Delta Air Lines DAL, United Airlines UAL and Southwest Airlines LUV provided impressive projections (on the revenue front owing to strong air-travel demand) for the first quarter of 2022 at the J.P. Morgan Industrials Conference.", "spans": [[66, 81], [87, 102], [111, 129]], "date": "2022-03-17T17:17:05+00:00", "span_values": ["United Airlines", "Southwest Airlines", "Delta Air Lines"]}
{"sentence": "The catalyst was the impressive projections (particularly on the revenue front owing to strong air-travel demand) issued by key players like American Airlines AAL, Delta Air Lines DAL, United Airlines UAL, Southwest Airlines LUV and JetBlue Airways JBLU at the J.P. Morgan Industrials Conference.", "spans": [[164, 179], [185, 200], [206, 224]], "date": "2022-03-16T17:28:05+00:00", "span_values": ["United Airlines", "Southwest Airlines", "Delta Air Lines"]}
{"sentence": "The upbeat revenue projections resulted in shares of American Airlines, Delta, United Airlines, Southwest Airlines and JetBlue gaining 9.26%, 8.7%, 9.19%, 4.89% and 7.22%, respectively, on Mar 15 from the Mar 14 closing.", "spans": [[79, 94], [96, 114]], "date": "2022-03-16T17:28:05+00:00", "span_values": ["Southwest Airlines", "United Airlines"]}
{"sentence": "Among the most promising investments that could take off later this year are Align Technology (NASDAQ: ALGN) and Southwest Airlines (NYSE: LUV).", "spans": [[77, 82], [113, 131]], "date": "2022-03-16T15:30:00+00:00", "span_values": ["Southwest Airlines", "Align"]}
{"sentence": "Accepted as a form of payment for corporate business travel worldwide by airlines, travel agencies and Amtrak®; UATP accounts are issued by: Aeromexico; Air Canada (TSE: AC); Air China; Air New Zealand (ANZFF: PK); Air Niugini; American Airlines (NASDAQ: AAL); APG Airlines; Austrian Airlines; BCD Travel; China Eastern Airlines (NYSE: CEA); Delta Air Lines (NYSE: DAL); EL AL Israel Airlines; Etihad Airways; Fareportal; Frontier Airlines; GOL Linhas aereas inteligentes S.A. (NYSE: GOL and Bovespa: GOLL4); Hahn Air; High Point; Japan Airlines (9201:JP); JetBlue Airways; Qantas Airways (QUBSF.PK); Shandong Airlines; Sichuan Airlines; Southwest Airlines (NYSE: LUV); Sun Country Airlines; TUIfly GmbH; Turkish Airlines (ISE:THYAO); United Airlines (NYSE: UAL) and WestJet.", "spans": [[342, 357], [638, 656], [735, 750]], "date": "2022-03-16T12:00:00+00:00", "span_values": ["Southwest Airlines", "United Airlines", "Delta Air Lines"]}
{"sentence": "Shares of Delta Air Lines (NYSE: DAL), United Airlines Holdings (NASDAQ: UAL), and American Airlines Group (NASDAQ: AAL) all traded up by as much as 10%, while Southwest Airlines (NYSE: LUV), JetBlue Airways (NASDAQ: JBLU), and Spirit Airlines (NYSE: SAVE) were all up 6% or more.", "spans": [[10, 25], [39, 54], [83, 106], [160, 178]], "date": "2022-03-15T16:55:35+00:00", "span_values": ["United Airlines", "American Airlines Group", "Southwest Airlines", "Delta Air Lines"]}
{"sentence": "Delta Air Lines (NYSE:DAL), Southwest Airlines (NYSE:LUV), United Airlines (NASDAQ:UAL), American Airlines (NASDAQ:AAL) and JetBlue Airways Corp (NASDAQ:JBLU) all rallied on Tuesday.2.", "spans": [[0, 15], [28, 46], [59, 74]], "date": "2022-03-15T15:53:44+00:00", "span_values": ["Southwest Airlines", "United Airlines", "Delta Air Lines"]}
{"sentence": "While Leaving Caribbean Port Putin’s State Media News Is Interrupted: ‘They’re Lying to You’ U.S. Sewer Data Warns of a New Bump in Covid Cases After LullSeveral of the largest carriers, including United Airlines Holdings Inc. and American Airlines Group Inc., cut their capacity forecasts for the first quarter, while Delta Air Lines Inc. held growth to the low end of a previous range, according to regulatory filings ahead of an investor conference Tuesday.", "spans": [[197, 212], [231, 254], [319, 334]], "date": "2022-03-15T14:48:45+00:00", "span_values": ["Delta Air Lines", "American Airlines Group", "United Airlines"]}
{"sentence": "At the time of writing, Delta Air Lines (NYSE:DAL) is at +8%, Southwest Airlines (NYSE:LUV) +5%, United Airlines (NASDAQ:UAL) +9%, American Airlines (NASDAQ:AAL) +9% and JetBlue Airways Corp (NASDAQ:JBLU)", "spans": [[24, 39], [62, 80], [97, 112]], "date": "2022-03-15T12:01:05+00:00", "span_values": ["Southwest Airlines", "United Airlines", "Delta Air Lines"]}
{"sentence": "Shares of Southwest Airlines Co. jumped 1.8% in premarket trading Tuesday, after the air carrier raised its first-quarter revenue outlook, citing improvements seen in March after omicron variant-related softness in January and February.", "spans": [[10, 28], [89, 96]], "date": "2022-03-15T10:51:30+00:00", "span_values": ["Southwest Airlines", "carrier"]}
{"sentence": "Shares of United Airlines Holdings (NASDAQ: UAL) led the way, up as much as 13%, while shares of American Airlines Group (NASDAQ: AAL), Delta Air Lines (NYSE: DAL), Southwest Airlines (NYSE: LUV), JetBlue Airways (NASDAQ: JBLU), and Spirit Airlines (NYSE: SAVE) all traded up at least 5%.", "spans": [[10, 25], [97, 120], [136, 151], [165, 183]], "date": "2022-03-09T18:23:31+00:00", "span_values": ["Delta Air Lines", "American Airlines Group", "Southwest Airlines", "United Airlines"]}
