{"sentence": "Certain Apple suppliers like Qorvo QRVO have been negatively hit as well following the news of the iPhone maker curtailing production.", "spans": [[8, 13], [29, 34]], "date": "2022-03-30T15:44:03+00:00", "span_values": ["Apple", "Qorvo"]}
{"sentence": "Micron Technology (NASDAQ:MU): Solid net income growth of 118.12% in 2021 Qorvo (NASDAQ:QRVO): Down nearly 17% in 2022 and is now very attractive Lam Research (NASDAQ:LRCX):", "spans": [[0, 6], [74, 79], [146, 158]], "date": "2022-03-30T14:40:54+00:00", "span_values": ["Qorvo", "Micron", "Lam Research"]}
{"sentence": "They all have strong fundamentals, are undervalued, and have strong long-term growth prospects:InvestorPlace - Stock Market News, Stock Advice & Trading TipsINTC Intel Corporation $52.43 MU Micron Technologies $85.64 QRVO Qorvo $131.34 LRCX Lam Research $564.04Semiconductor Stocks to Buy: Intel Corporation (INTC)", "spans": [[162, 167], [190, 196], [222, 227], [241, 253], [290, 295]], "date": "2022-03-30T14:40:54+00:00", "span_values": ["Qorvo", "Lam Research", "Micron", "Intel"]}
{"sentence": "What That Means.. Advanced Micro Devices was removed from Goldman’s Conviction List while other semiconductor companies like Microchip Technology, Teradyne, and Qorvo were downgraded to Neutral as the firm sees macro headwinds for the sector.", "spans": [[125, 134], [147, 155], [161, 166]], "date": "2022-03-28T13:50:00+00:00", "span_values": ["Qorvo", "Microchip", "Teradyne"]}
{"sentence": "Shares of some Apple suppliers also fell, with Qorvo Inc. down 2.4% in premarket and Varta AG declining 3.4% in Frankfurt after the Nikkei report.", "spans": [[15, 20], [47, 52]], "date": "2022-03-28T10:38:02+00:00", "span_values": ["Apple", "Qorvo"]}
{"sentence": "Some of the top value stocks in the portfolio of Seth Klarman at the end of December 2021 included Willis Towers Watson Public Limited Company (NASDAQ:WTW), Intel Corporation (NASDAQ:INTC), and Nexstar Media Group, Inc. (NASDAQ:NXST), among others discussed in detail below.", "spans": [[99, 119], [157, 162]], "date": "2022-03-10T19:21:12+00:00", "span_values": ["Willis Towers Watson", "Intel"]}
{"sentence": "Just like Willis Towers Watson Public Limited Company (NASDAQ:WTW), Intel Corporation (NASDAQ:INTC), and Nexstar Media Group, Inc. (NASDAQ:NXST), SS&C Technologies Holdings, Inc. (NASDAQ:SSNC) is one of the stocks on the radar of elite investors.", "spans": [[10, 30], [68, 73]], "date": "2022-03-10T19:21:12+00:00", "span_values": ["Willis Towers Watson", "Intel"]}
{"sentence": "Along with Willis Towers Watson Public Limited Company (NASDAQ:WTW), Intel Corporation (NASDAQ:INTC), and Nexstar Media Group, Inc. (NASDAQ:NXST), Micron Technology (NASDAQ:MU) is one of the stocks that institutional investors are buying.", "spans": [[11, 31], [69, 74], [147, 153]], "date": "2022-03-10T19:21:12+00:00", "span_values": ["Micron", "Willis Towers Watson", "Intel"]}
{"sentence": "A brief look at the hedge fund's portfolio reveals that the top holdings are concentrated in the information technology industry, and since we're focusing on D.E. Shaw's top semiconductor picks, the top three holdings in this subsegment of the portfolio are in QUALCOMM Incorporated (NASDAQ:QCOM), Advanced Micro Devices, Inc. (NASDAQ:AMD), and NVIDIA Corporation (NASDAQ:NVDA).Story continues 10 Best Semiconductor Stocks to Invest in According to DE Shaw's DE Shawl-n-r2tVRjxzFM8-unsplashOur MethodologyIn order to narrow down D.E. Shaw's top ten semiconductor picks from the hundreds of different companies and positions present in its investment portfolio, we took a look at the firm's filings with the Securities and Exchange Commission for the fourth quarter of last year.", "spans": [[261, 269], [335, 338], [345, 351]], "date": "2022-03-10T14:45:33+00:00", "span_values": ["QUALCOMM", "NVIDIA", "AMD"]}
{"sentence": "Advanced Micro Devices, Inc. (NASDAQ:AMD), QUALCOMM Incorporated (NASDAQ:QCOM), and NVIDIA Corporation (NASDAQ:NVDA) are met by Teradyne, Inc. (NASDAQ:TER) as one of D.E. Shaw's favorite chip stocks.9.", "spans": [[37, 40], [43, 51], [84, 90], [128, 136]], "date": "2022-03-10T14:45:33+00:00", "span_values": ["QUALCOMM", "NVIDIA", "Teradyne", "AMD"]}
{"sentence": "”Marvell Technology, Inc. (NASDAQ:MRVL) joins QUALCOMM Incorporated (NASDAQ:QCOM), Advanced Micro Devices, Inc. (NASDAQ:AMD), and NVIDIA Corporation (NASDAQ:NVDA) in the list of D.E. Shaw's top semiconductor picks.", "spans": [[46, 54], [120, 123], [130, 136]], "date": "2022-03-10T14:45:33+00:00", "span_values": ["QUALCOMM", "NVIDIA", "AMD"]}
{"sentence": "Intel Corp. may have gotten a callout in President Joe Biden's State of the Union address earlier in the week, but on Thursday it fell further down Morgan Stanley's list of chip names.", "spans": [[0, 5], [148, 162]], "date": "2022-03-03T16:17:00+00:00", "span_values": ["Morgan Stanley", "Intel"]}
{"sentence": "Meanwhile, smartphone maker Xiaomi Corp., like the majority of mobile electronics vendors, uses chips from Qualcomm Inc., Qorvo Inc., and Skyworks Solutions Inc., according to Bloomberg’s supply chain data analysis.", "spans": [[107, 115], [122, 127], [138, 146]], "date": "2022-03-01T04:44:54+00:00", "span_values": ["Qorvo", "Qualcomm", "Skyworks"]}
{"sentence": "Visit www.qorvo.com to learn how Qorvo connects the world.", "spans": [[10, 15], [33, 38]], "date": "2022-02-28T13:00:00+00:00", "span_values": ["Qorvo", "qorvo"]}
{"sentence": "Visit www.qorvo.com to learn how Qorvo connects the world.", "spans": [[10, 15], [33, 38]], "date": "2022-02-28T13:00:00+00:00", "span_values": ["Qorvo", "qorvo"]}
{"sentence": "Cadence (CDNS) to Play a Pivotal Role in Qorvo's SHIP-RF Program.", "spans": [[0, 7], [41, 46]], "date": "2022-02-16T15:26:03+00:00", "span_values": ["Qorvo", "Cadence"]}
{"sentence": "Cadence’s Involvement in the ProgramCadence will develop methodologies to execute solid design and simulation capabilities for the highest levels of heterogeneous packaging integration, as part of Qorvo’s Design Center team.", "spans": [[0, 7], [197, 202]], "date": "2022-02-16T15:26:03+00:00", "span_values": ["Qorvo", "Cadence"]}
{"sentence": "Amalgamating Cadence ADK solutions into Qorvo’s SHIP-RF Assembly and Test Center (ATC) manufacturing rules will allow comprehensive modeling and product simulation for crucial aerospace and defense applications.", "spans": [[13, 20], [40, 45]], "date": "2022-02-16T15:26:03+00:00", "span_values": ["Qorvo", "Cadence"]}
{"sentence": "Cadence’s involvement in the SHIP-RF program benefits Qorvo as it will integrate Cadence methodologies and flows into Qorvo’s advanced, industry-leading heterogeneous RF packaging, assembly and testing solutions.", "spans": [[0, 7], [54, 59], [81, 88], [118, 123]], "date": "2022-02-16T15:26:03+00:00", "span_values": ["Qorvo", "Cadence"]}
{"sentence": "As an electronic design automation (EDA) company, Cadence will provide Qorvo with expertise to accurately design packages and modules tested in the Qorvo manufacturing facility.", "spans": [[50, 57], [71, 76], [148, 153]], "date": "2022-02-16T15:26:03+00:00", "span_values": ["Qorvo", "Cadence"]}
{"sentence": "While Cadence holds a Zacks Rank of 2 (Buy), Qorvo carries a Zacks Rank of 3 (Hold) currently.", "spans": [[6, 13], [45, 50]], "date": "2022-02-16T15:26:03+00:00", "span_values": ["Qorvo", "Cadence"]}
{"sentence": "Investment company Nvwm, Llc (Current Portfolio) buys Vanguard Ultra-Short Bond ETF, Vanguard Total Stock Market ETF, Vanguard Mega Cap Growth ETF, Vanguard Total International Stock, Freeport-McMoRan Inc, sells Quadratic Interest Rate Volatility And Inflation H, Moderna Inc, BioNTech SE, Skyworks Solutions Inc, Aberdeen Standard Physical Precious Metals Basket during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Nvwm, Llc.", "spans": [[184, 200], [264, 271], [290, 298]], "date": "2022-02-08T15:38:09+00:00", "span_values": ["Skyworks", "Freeport-McMoRan", "Moderna"]}
{"sentence": "New Purchases: VUSB, MGK, SRLN, IT, KLAC, ARES, SPGI, SF, MCO, ODFL, TLT, IWM, ITOT, MPC, PANW, PKI, XLU, EPRF, BNDX, VEA, MUB, IEFA, TFI, EMB, IEMG, SCHD, SCHV, CELH, CAMT, VTIP, CWH, TBUX, IWS, IWN, WE, SHV, VSS, VIOG, TBLT, FULT, HPQ, NTRS, HCA, STAG, WIX, AMC, PAYC, GLOB, TRHC, GBIL, RBLX, CHK, DIBS, TALK, OLPX, KD, ONL, ARKW, BSCM, EFV, Added Positions: VTI, VXUS, FCX, GOOGL, CSCO, TSLA, PAVE, FB, SHY, MSFT, AAPL, ICSH, INTU, WDAY, GM, VWO, TIP, DJP, KEY, FTNT, IJR, XLE, TFC, FND, MELI, JPST, AGG, AMLP, CLF, QQQ, AMZN, IAU, CDNS, DHR, IQV, SCHF, EW, LLY, IDXX, MS, TMO, VBR, ASML, ADBE, AMAT, BRK.B, F, ISRG, NTR, ROK, SLB, ZBRA, NXPI, GOOG, IGV, VTV, CVX, DUK, EL, XOM, GS, LRCX, LEN, LOW, NKE, NUE, QCOM, SBUX, SNPS, TGT, USB, UPS, UNH, WMT, WFC, LULU, V, GNRC, POAHY, MOS, ZTS, HUBS, SEDG, SHOP, SQ, TEAM, TTD, BHVN, DT, BEAM, ABNB, UPST, SOFI, SOFI, AOR, BND, DLN, DVY, FLOT, IWR, MINT, PFF, QQQJ, VOE, XLF, XLK, FLWS, PLD, AEP, AZO, CSX, CME, C, DECK, DXCM, ETN, EA, LHX, IIVI, KNX, LKQ, MGA, MCD, MAA, ORCL, PNC, PG, PGR, REGN, RHI, RHHBY, TXN, TXT, URI, VLO, ANTM, EBAY, ACM, G, LPLA, CDW, AQUA, YETI, UBER, CRWD, SNOW, U, FIGS, EVGO, MTTR, OEF, PGF, SPYV, VV, Reduced Positions: IVOL, MRNA, BNTX, GLTR, ALLY, MA, AXP, INTC, EWZ, TMUS, DD, DOCU, CRNC, ILMN, SHAK, WOOF, DVN, EEM, ADSK, AMD, GE, SPY, CRM, WHR, ICF, MTCH, HON, VZ, JEPI, SMH, XLG, DE, T, PPL, VCSH, VOT, TWLO, O, INMD, VWOB, AI, MDT, SPLV, ITW, GLD, EWG, SCHB, FDX, JNK, BMY, AMT, ACC, VCIT, VIG, IVV, CTXS, KO, BABA, EFA, PSFE, CARR, VTRS, NLOK, COLD, SPCE, TDOC, ZBH, Sold Out: SWKS, WRK, QRVO, GH, YELP, SONO, FTCH, XPO, UUP, ELAN, FISV, CTRE, SQQQ, ZM, SCHO, TRMB, FIS, VIAC, VUG, JETS, CPNG, BMBL, LMND, UROY, SCHP, JMIA, URA, VBK, VEU, ADP, NIO, RGA, NSC, NOC, LIN, RRX, LUV, RTX, VRTX, WDC, VMW, PAGS, STLA, VYGVF, LYB, BAH, FLT, CHGG, MGNI, NVTA,Story continuesWarning!", "spans": [[441, 443], [949, 952], [1083, 1087], [1103, 1106], [1304, 1307], [1309, 1311], [1371, 1374], [1652, 1655], [1725, 1728]], "date": "2022-02-08T15:38:09+00:00", "span_values": ["EBAY", "FIS", "AMD", "GE", "GM", "PPL", "CDW", "ADP", "CSX"]}
{"sentence": "These stocks are Hologic, Inc. (NASDAQ:HOLX), Ubiquiti Inc. (NYSE:UI), Seagate Technology Holdings plc (NASDAQ:STX), Hewlett Packard Enterprise Company (NYSE:HPE), Qorvo Inc (NASDAQ:QRVO), Cincinnati Financial Corporation (NASDAQ:CINF), and Ally Financial Inc (NYSE:ALLY).", "spans": [[17, 24], [71, 78], [117, 143], [164, 169], [189, 209]], "date": "2022-02-07T20:11:14+00:00", "span_values": ["Cincinnati Financial", "Hewlett Packard Enterprise", "Seagate", "Qorvo", "Hologic"]}
{"sentence": "These stocks are Qorvo Inc (NASDAQ:QRVO), Cincinnati Financial Corporation (NASDAQ:CINF), Ally Financial Inc (NYSE:ALLY), Duke Realty Corporation (NYSE:DRE), KB Financial Group, Inc. (NYSE:KB), Healthpeak Properties, Inc. (NYSE:PEAK), and Teradyne, Inc. (NYSE:TER).", "spans": [[17, 22], [42, 62], [122, 133], [194, 204], [239, 247]], "date": "2022-02-07T16:19:38+00:00", "span_values": ["Duke Realty", "Cincinnati Financial", "Teradyne", "Qorvo", "Healthpeak"]}
{"sentence": "Visit www.qorvo.com to learn how Qorvo connects the world.", "spans": [[10, 15], [33, 38]], "date": "2022-02-07T13:00:00+00:00", "span_values": ["Qorvo", "qorvo"]}
{"sentence": "Visit www.qorvo.com to learn how Qorvo connects the world.", "spans": [[10, 15], [33, 38]], "date": "2022-02-07T13:00:00+00:00", "span_values": ["Qorvo", "qorvo"]}
{"sentence": "We will take a look at Cincinnati Financial Corporation (NASDAQ:CINF), Ally Financial Inc (NYSE:ALLY), Duke Realty Corporation (NYSE:DRE), KB Financial Group, Inc. (NYSE:KB), Healthpeak Properties, Inc. (NYSE:PEAK), Teradyne, Inc. (NYSE:TER), and Lyft, Inc. (NASDAQ:LYFT).", "spans": [[23, 43], [103, 114], [175, 185], [216, 224]], "date": "2022-02-06T16:51:56+00:00", "span_values": ["Duke Realty", "Cincinnati Financial", "Healthpeak", "Teradyne"]}
{"sentence": "Irvine, CA, based Investment company Affinity Investment Advisors, Llc (Current Portfolio) buys Kulicke & Soffa Industries Inc, Belden Inc, Tapestry Inc, The Interpublic Group of Inc, TD Synnex Corp, sells Benchmark Electronics Inc, Netgear Inc, AutoZone Inc, 3M Co, Qorvo Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Affinity Investment Advisors, Llc.", "spans": [[140, 148], [158, 175], [246, 254], [260, 262], [267, 272]], "date": "2022-02-04T22:38:03+00:00", "span_values": ["3M", "Interpublic Group", "Tapestry", "Qorvo", "AutoZone"]}
{"sentence": "New Purchases: KLIC, BDC, IPG, SNX, BRK.B, EPAM, EA, DFS, JEF, REGN, UTHR, LEN, UPS, DGX, ABC, WHR, MOH, LKQ, KR, OC, DTE, WSO, EMR, GD, Added Positions: TPR, BBY, HPQ, T, COF, STX, MCD, F, PFE, ARW, PDM, SPG, MED, GILD, ACN, RHI, SKT, CTSH, EXC, CDW, TGT, ALLY, SYF, DELL, CE, MCK, LH, NLOK, IBM, ANTM, PM, DXC, MO, ORCL, MGY, BVS, BLMN, NRG, OMC, HCA, C, RTX, BAX, HAL, Reduced Positions: VZ, EBAY, WK, SAFM, BMY, FUL, AAPL, CUBI, LYB, MSFT, BCC, PHM, THC, JCI, FDX, HZNP, DISH, MET, SM, AOSL, TRUP, ALLO, SBRA, SJM, DRI, WY, COHU, BLDR, UNH, AGG, DVN, ASGN, BAC, MS, GOOGL, WFC, LOW, AVGO, CBRE, QCOM, KHC, DE, CMCSA, VSTO, HD, INSP, AMGN, HMST, HALO, TSLA, JBL, LRCX, MAS, NOC, PIPR, Sold Out: BHE, NTGR, AZO, MMM, BBWI, QRVO, RF, VMW, CFG, IVZ, CMG, KD,Warning!", "spans": [[43, 47], [118, 121], [247, 250], [293, 296], [395, 399], [475, 479], [593, 597]], "date": "2022-02-04T22:38:03+00:00", "span_values": ["EBAY", "IBM", "CBRE", "DTE", "EPAM", "CDW", "DISH"]}
{"sentence": "Otter Creek Advisors, LLC Buys The Walt Disney Co, TJX Inc, Azenta Inc, Sells Qorvo Inc, PayPal ....", "spans": [[40, 46], [78, 83], [89, 95]], "date": "2022-02-04T22:38:02+00:00", "span_values": ["Disney", "Qorvo", "PayPal"]}
{"sentence": "Investment company Otter Creek Advisors, LLC (Current Portfolio) buys The Walt Disney Co, TJX Inc, Azenta Inc, Owl Rock Capital Corp, RH, sells Qorvo Inc, PayPal Holdings Inc, BRP Group Inc, Clarivate PLC, E2open Parent Holdings Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Otter Creek Advisors, LLC.", "spans": [[79, 85], [144, 149], [155, 161]], "date": "2022-02-04T22:38:02+00:00", "span_values": ["Disney", "Qorvo", "PayPal"]}
{"sentence": "New York, NY, based Investment company Boston Partners (Current Portfolio) buys Keurig Dr Pepper Inc, Fidelity National Information Services Inc, Global Payments Inc, CVS Health Corp, Devon Energy Corp, sells Pfizer Inc, Lowe's Inc, Oracle Corp, Progressive Corp, Helmerich & Payne Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Boston Partners.", "spans": [[146, 161], [167, 177], [184, 189], [209, 215], [221, 227], [233, 239], [246, 257]], "date": "2022-02-04T14:38:19+00:00", "span_values": ["Lowe's", "Global Payments", "CVS Health", "Oracle", "Progressive", "Pfizer", "Devon"]}
{"sentence": "New Purchases: KDP, AEO, CHE, COLB, INGR, SCS, VVI, GSM, CTRA, SMG, RRC, BHG, KC, PLTK, POSH, XL, OZON, SLQT, AUGX, REAL, TMDX, EVER, DBX, ONTF, CHK, PCRX, TALK, HLMN, RXST, CDRE, NU, IUSV, IWS, VTV, VXF, STM, ATI, BDSI, BKD, ASUR, GTY, HMC, IONS, KEX, NLS, MD, RRX, OVID, SRI, WW, EHTH, ALLT, PZN, LL, AGCO, SXC, NNDM, HONE, SND, Added Positions: FIS, GPN, CVS, DVN, FLT, CTSH, MIDD, NLOK, QRVO, SNY, CVE, CNC, TPX, AMGN, TJX, REZI, ZBH, WMS, QSR, LBTYA, VLO, WHR, DFS, ATVI, BMY, D, ABBV, COF, CCK, SLB, USFD, VRT, JNJ, NSC, QCOM, CTVA, NVS, GL, BWXT, AXTA, BV, BCO, CCEP, GD, NXST, PII, TNL, TMUS, SSNC, CHNG, AES, AVT, ENS, GPK, GTN, KGC, NVR, OMC, VNOM, TPB, HWM, PETQ, IWD, IWN, FLWS, AMZN, AXL, ATRS, AGX, BJRI, ESTE, CAL, ELY, PRDO, CLS, CHKP, CTO, DBI, EZPW, EVC, ERIC, FCFS, PFC, FL, TGNA, GT, HRB, HDB, HAS, HLF, HOFT, BCOR, IIN, IVC, JBLU, KB, KR, FSTR, LAMR, LNDC, LMT, MTRX, MPAA, CNR, OIS, OSBC, RDCM, TEN, UFI, UEIC, ULH, IMBI, VTR, SMFG, DK, SCU, MAXR, QIPT, RLGT, NOG, STLA, VPG, ARCO, KOS, NBHC, RLGY, SAMG, PBPB, REPH, FFWM, NMG, ISTR, TMST, LNTH, SYF, ENVA, INSE, VIRT, APLE, UNVR, OOMA, RMR, IEA, NEX, HCC, VNTR, ECVT, CURO, IQ, IMXI, NVST, VVOS, APR, SNCY, OB, AGG, BND, Reduced Positions: PFE, LOW, ORCL, PGR, HP, LVS, ALSN, NXPI, ALL, ULTA, LEA, AMAT, CSCO, EBAY, BAC, LRCX, CHTR, NOMD, C, OSK, FITB, AZO, TPR, EOG, MOS, COMM, CHX, MRK, AIG, CAT, DD, HOG, JPM, MU, OC, IGT, LEN, MDT, ASGN, URI, BRK.B, ETN, GNTX, LKQ, NGVT, TFC, COP, GS, GOOGL, KLAC, RHI, UNH, WFC, WDC, FAF, NAVI, CNI, CRI, SCHW, MHK, PXD, MPC, FB, FANG, EVTC, AVTR, CB, ABC, AXS, CNP, CI, DVA, DOV, RE, HBAN, KEY, MCK, NTAP, SONY, SNX, TXT, WAB, WCC, KAR, SYNH, VVV, CNXC, AFL, Y, AME, AON, ARW, BIIB, BA, CRH, CNQ, CW, DE, EXP, EXPD, FCN, FLEX, HUM, HURN, IPG, JBL, KT, KSS, KFY, MRO, MAS, MOH, NEM, RNR, TRV, USB, UNP, UPS, ANTM, WTM, WLL, INT, SPB, L, LDOS, TEL, ST, ICLR, ALLE, WH, OTIS, ATSG, AMSF, ABT, NSP, MO, DOX, AMED, ADI, AJG, AN, ACLS, BP, BIDU, BK, OZK, BZH, BELFB, BDC, CBZ, CF, CRAI, CSV, CX, CLH, CVLG, DBD, EA, ERF, EBF, PACW, FMBH, FFIC, FOSL, ROCK, GHL, HAE, HAL, LHX, HSII, HFWA, HPQ, HXL, HST, IDCC, JLL, KNX, LHCG, LSTR, LYV, MGA, MAN, MKL, MRTN, SPGI, MSFT, MCO, MS, VTRS, NCR, NNBR, HOPE, NOC, NWPX, PCAR, PEBO, PRFT, TPC, PDCE, PVH, BPOP, PKX, LIN, PG, PCYO, PWR, QMCO, RGCO, RMBS, RF, RDS.A, SIVB, SPG, SJI, SM, STFC, STLD, SYK, TMO, UBS, USAK, UCTT, UMH, WSM, TX, WU, ICFI, FRST, KBR, SBH, AER, AIMC, TAST, TA, TIPT, APEI, TNK, WFG, INBK, HROW, PM, RGA, AVGO, DG, FIBK, STNG, RCM, FN, LPLA, NPTN, TROX, HCA, DOOR, THR, MSBI, HMST, PSX, APAM, IQV, CSTM, BRX, GOOG, TSE, BABA, OEC, VEC, JRVR, BOX, CC, BNED, HPE, VST, TUSK, PUMP, LBRT, NESR, RBB, MBIN, LBC, COLD, IBEX, FTDR, SHC, OAS, LSEA, OCDX, BWMN, PWP, DOLE, Sold Out: CONE, XRX, LUV, NTES, EWY, PPD, HUN, ON, DXC, CDK, WRK, DOYU, TACO, CZR, FLR, ACBI, ATUS, PAGS, HUYA, TME, FC, EXC, ZIM, VEI, ULCC, DLO, ATIP, CHT, NR, HY, TGLS, VIPS, AGRO, SPR, EBS, SHG, PRG, YELL, EQC, INVA, GASS, SP, MTW, SKM,Story continuesWarning!", "spans": [[348, 351], [613, 616], [643, 646], [1234, 1236], [1283, 1287], [1362, 1365], [1680, 1683], [1880, 1884], [2248, 2251]], "date": "2022-02-04T14:38:19+00:00", "span_values": ["EBAY", "FIS", "AON", "NVR", "AIG", "AES", "PVH", "OTIS", "HP"]}
{"sentence": "We will take a look at Ubiquiti Inc. (NYSE:UI), Seagate Technology Holdings plc (NASDAQ:STX), Hewlett Packard Enterprise Company (NYSE:HPE), Qorvo Inc (NASDAQ:QRVO), Cincinnati Financial Corporation (NASDAQ:CINF), Ally Financial Inc (NYSE:ALLY), and Duke Realty Corporation (NYSE:DRE).", "spans": [[48, 55], [94, 120], [141, 146], [166, 186], [250, 261]], "date": "2022-02-04T04:05:49+00:00", "span_values": ["Duke Realty", "Cincinnati Financial", "Hewlett Packard Enterprise", "Seagate", "Qorvo"]}
{"sentence": "Sass Investors Services, Inc. (Current Portfolio) buys ON Semiconductor Corp, Vertex Pharmaceuticals Inc, APi Group Corp, Brunswick Corp, AmerisourceBergen Corp, sells NRG Energy Inc, LKQ Corp, Air Products & Chemicals Inc, Sony Group Corp, Globe Life Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, M.d.", "spans": [[78, 84], [138, 155], [168, 178], [194, 206], [241, 251]], "date": "2022-02-03T19:38:01+00:00", "span_values": ["NRG Energy", "Vertex", "Air Products", "Globe Life", "AmerisourceBergen"]}
{"sentence": "Investment company Chesapeake Wealth Management (Current Portfolio) buys Vanguard Short-Term Corporate Bond ETF, Financial Select Sector SPDR, FlexShares iBoxx 5-Year Target Duration TIPS Index, Celanese Corp, Berkshire Hathaway Inc, sells Qorvo Inc, Snap-on Inc, Franklin Resources Inc, Logitech International SA, Rio Tinto PLC during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Chesapeake Wealth Management.", "spans": [[195, 203], [210, 228], [240, 245], [251, 258]], "date": "2022-02-03T18:38:16+00:00", "span_values": ["Celanese", "Berkshire Hathaway", "Snap-on", "Qorvo"]}
{"sentence": "New Purchases: CE, PSA, ZTS, MCO, TREX, AWK, Added Positions: VCSH, AGG, TDTF, XLF, XLK, BRK.B, ENTG, ASML, AMZN, TT, INFY, USHY, SSP, EMR, GLOB, FB, EMN, CTLT, GOOGL, HD, AN, TSCO, BNDX, XLC, GNRC, YETI, BX, KKR, DBEF, ETSY, SCHE, PG, MOH, MCD, BIO, XLE, XOM, XLV, XLU, AGCO, XLB, XLY, XLP, XLI, KMB, A, ADP, CASY, NEE, GILD, V, NSC, SONY, SNPS, TGT, UTHR, DIS, GD, IVE, DRE, CSCO, HES, MSCI, Reduced Positions: BEN, TSLA, TSM, IWV, MSFT, SCHF, SPY, MTCH, SWKS, XEL, SCHM, EA, FISV, IBM, BMY, NVDA, ORCL, JNJ, WMT, TMO, ACN, IWM, SCHZ, CMCSA, AMGN, CTAS, SCHA, UNH, TXN, ADBE, T, SHW, RCII, SCHV, SCHG, SCHB, ICE, INTC, MUB, LLY, LHX, IYF, BURL, PM, XLRE, IVW, ABBV, VLO, NOW, WM, ZNGA, ZBRA, WING, BLK, CCI, DHR, COST, CL, DXCM, CVX, D, CERN, ECL, CVS, HON, ITW, AXP, ALL, LNT, MRVL, ROP, WEN, AFL, CHD, VNQ, UDR, IWF, IWD, EEM, IGSB, GOOG, GNTX, GS, ISRG, LULU, LOW, PNC, PEG, Sold Out: QRVO, SNA, LOGI, RIO, BRK.A, FLWS, CHTR, VICI, MDY, BA, MDT, COF,Warning!", "spans": [[220, 224], [305, 308], [388, 392], [484, 487], [811, 814]], "date": "2022-02-03T18:38:16+00:00", "span_values": ["IBM", "UDR", "MSCI", "ETSY", "ADP"]}
{"sentence": "Visit www.qorvo.com to learn how Qorvo connects the world.", "spans": [[10, 15], [33, 38]], "date": "2022-02-02T21:00:00+00:00", "span_values": ["Qorvo", "qorvo"]}
{"sentence": "Visit www.qorvo.com to learn how Qorvo connects the world.", "spans": [[10, 15], [33, 38]], "date": "2022-02-02T21:00:00+00:00", "span_values": ["Qorvo", "qorvo"]}
{"sentence": "Agf Investments Inc. Buys Sony Group Corp, Lam Research Corp, The AES Corp, Sells Monster ....", "spans": [[43, 55], [66, 69]], "date": "2022-02-02T02:38:12+00:00", "span_values": ["AES", "Lam Research"]}
{"sentence": "Toronto, A6, based Investment company Agf Investments Inc. (Current Portfolio) buys Sony Group Corp, Lam Research Corp, The AES Corp, TFI International Inc, Marvell Technology Inc, sells Monster Beverage Corp, Ulta Beauty Inc, WestRock Co, Restaurant Brands International Inc, United Rentals Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Agf Investments Inc..", "spans": [[101, 113], [124, 127], [187, 203], [210, 221], [227, 235], [277, 291]], "date": "2022-02-02T02:38:12+00:00", "span_values": ["Ulta Beauty", "Monster Beverage", "AES", "United Rentals", "Lam Research", "WestRock"]}
{"sentence": "New Purchases: CPRI, NVEI, AVNT, CCL, LTHM, ZUO, HUN, FRSH, FRSH, MOMO, SPG, PRTK, DHRPA.PFD, UBER, AVTRPA.PFD, BZUN, ETSY, FSLR, BIRD, BACPL.PFD, TCN, WFCPL.PFD, UPWK, PSN, PGEN, C, ANET, BDXB.PFD, WST, SIRI, SBSW, PRU, MTCH, HOPE, PCG, VMW, SFM, MQ, TMCI, AR, CHK, MRVI, U, RKT, VVV, GOOS, BHVN, BKR, SITM, DOCU, GH, MIDD, BIIB, BXP, CERN, FIS, CINF, CGNX, CL, DE, ERF, GME, THG, HAS, HFC, HNP, IDA, IQV, PRGO, RL, ROL, SLB, SON, SRCL, UAL, MTN, WDC, WU, AWI, ABMD, MRTX, CPG, FTNT, Added Positions: SONY, LRCX, AES, TFII, MRVL, WSM, INTU, QCOM, UNH, AMZN, BMO, XLF, XLV, STZ, FNV, TRI, V, ADI, BAM, SQM, CTAS, ACM, XLE, ALB, PDD, OVV, GS, TER, XLK, WH, XLB, APH, ISRG, MAS, SO, HLNE, CMPS, ASML, NVDA, NFLX, NKE, SBUX, MSCI, CIXX, MPC, GLOB, GFL, CNQ, XLY, J, MS, UNP, LULU, ENPH, VICI, ABNB, DSGX, FDX, F, INFY, PLUG, RF, WCN, AWK, MUSA, NOVA, ACN, BRK.B, CSX, CSGP, ETN, ECL, GE, MCHP, MSI, PXD, PSA, RGEN, SBAC, SEB, STN, TTEK, TXN, TREX, UPS, VMI, VRSN, MA, TRGP, KMI, XYL, APTV, BKI, LITE, ROKU, IQ, CRWD, GFLU, OTIS, NEEPQ, AOS, ACAD, SRPT, APD, AKAM, ARE, ALKS, ALL, DOX, AFG, AIG, AMT, AMGN, NLY, ANSS, AJG, AIZ, ADP, AVY, BLL, OZK, BAX, BDX, BBY, BSX, CACI, VIAC, CHRW, CTRA, CDNS, CPT, CPB, COF, CAT, LUMN, CME, CHD, CRUS, CTXS, CTSH, CBSH, CNMD, COP, CNX, CMI, DHI, DTE, DXCM, DLB, DPZ, DD, DUK, EMN, EA, LLY, EMR, ERIE, ESS, EXEL, EXPD, FFIV, FCN, FCFS, FLO, GIS, GPC, GILD, HRB, EQC, HAIN, HOG, HIG, HELE, HSIC, HOLX, INFO, IDXX, INCY, TT, INTC, IP, SJM, ZD, JKHY, KGC, LECO, MGM, MKTX, MMC, MAT, MMS, MCY, NDAQ, NYCB, NYT, NEU, NI, NSC, NUAN, OTEX, PNM, PKG, PAYX, PBCT, PGR, DGX, QDEL, RSG, STX, SCI, SLGN, SNA, LSI, NLOK, TGT, TXT, THO, WEN, TRMB, TYL, CUBE, UMBF, UTHR, VRNT, VRTX, VNO, EVRG, WLK, WTM, WEC, DEI, BR, DAL, CELH, AGNC, LOPE, CVE, CHTR, BWXT, BAH, NLSN, SPLK, PNR, AMBA, FANG, BFAM, SAIC, PINC, AAL, GOOG, MGNI, FIVN, TMX, BABA, WMS, KEYS, NEWR, VIRT, PYPL, OLLI, PEN, SQ, YUMC, KREF, ALTR, DBX, BE, ETRN, MRNA, CVET, FOXA, LEVI, LSPD, VIR, DNB, BEPC, UPST, ASHR, BNDX, KRBN, LEMB, VGK, XLRE, Reduced Positions: MNST, ULTA, QSR, URI, MDT, TD, GRMN, MFC, CP, GLW, CNI, XLI, HD, AMED, NTR, TCOM, PM, JPM, TU, WMT, GRP.U, XLP, MCD, RY, SBNY, CMCSA, AMAT, DVN, XOM, EWS, MCHI, XLU, AEM, GIB, DISH, JNJ, PEP, SU, BNS, HON, WPM, TJX, INDA, CB, T, WM, MMM, CVS, NOC, BIP, AQN, EWY, ENB, NEE, MDLZ, MET, MCO, NEM, ROK, SHW, ANTM, WFG, PANW, ABBV, MDB, AFL, AXP, DLR, EQT, FITB, CIGI, GOOGL, ICE, LH, LNC, LMT, MU, MSFT, ORCL, PNC, PH, BKNG, SSRM, SLF, RTX, VLO, DIS, WMB, KL, AVGO, PRI, RH, HLT, SYF, BYND, AQNU, FLJP, XLC, AGCO, AMD, AMP, IVZ, TFC, BMY, CF, LNG, TPR, NNN, ED, WOLF, CCI, EIX, EFX, FISV, IBM, KR, MTB, RBA, CRM, SNPS, TROW, TS, TEVA, TMO, TKR, TRP, WTS, ET, MELI, BEP, DISCK, DG, TSLA, PVG, FB, NOW, ZTS, HASI, NEP, SHOP, NTRA, BILI, ELAT, IVV, PLD, ABT, ADBE, ALNY, AEP, AZO, BCE, BAC, BK, GOLD, BHC, BLK, BA, CAE, CM, CVX, CSCO, KO, CPRT, CACC, EQIX, GIL, IMO, IFF, IRM, JCI, KNX, LOW, SPGI, MRK, NTES, ORLY, ON, PTC, PG, REGN, RGLD, POOL, SRE, SUI, VZ, VMC, EBAY, CMG, FTS, MLCO, BTG, CBOE, GM, HCA, HII, SAND, JD, SEDG, FSV, ASIX, ZTO, ORLA, SNAP, BHF, ELAN, ZM, CHWY, SNOW, AESC, DOCN, GTX, EMB, ERUS, EWD, EWG, EWJ, EWL, EWN, EWT, EWU, EWW, FLIN, GOVT, IAGG, MBB, PFF, SMIN,", "spans": [[118, 122], [342, 345], [514, 517], [722, 726], [860, 863], [881, 883], [1020, 1024], [1087, 1090], [1124, 1127], [1280, 1283], [2222, 2226], [2556, 2559], [2631, 2634], [2958, 2961], [3004, 3008], [3031, 3035], [3037, 3039]], "date": "2022-02-02T02:38:12+00:00", "span_values": ["IBM", "EBAY", "FIS", "DTE", "AMD", "AIG", "PTC", "GE", "MSCI", "AES", "GM", "ETSY", "CBOE", "ADP", "OTIS", "DISH", "CSX"]}
{"sentence": "Qualcomm currently has an Earnings ESP of 0.00% and a Zacks Rank #2.Story continuesQUALCOMM Incorporated Price and EPS SurpriseQUALCOMM Incorporated price-eps-surprise | QUALCOMM Incorporated QuoteYou can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.", "spans": [[0, 8], [170, 178]], "date": "2022-02-01T13:35:01+00:00", "span_values": ["QUALCOMM", "Qualcomm"]}
{"sentence": "QuoteZacks Rank: Qorvo currently carries a Zacks Rank #3.Stocks to ConsiderHere are some companies that you may want to consider as our model shows that these have the right combination of elements to post an earnings beat this quarter:Hasbro, Inc. HAS is slated to release fourth-quarter 2021 results on Feb 7.", "spans": [[17, 22], [236, 242]], "date": "2022-01-31T15:17:03+00:00", "span_values": ["Qorvo", "Hasbro"]}
{"sentence": "Beauty Inc, Lam Research Corp, Cisco Systems Inc, SVB Financial Group, sells DocuSign Inc, Roku Inc, , Amgen Inc, Eagle Materials Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Wd Rutherford Llc.", "spans": [[12, 24], [31, 36], [50, 63], [103, 108]], "date": "2022-01-29T02:38:02+00:00", "span_values": ["Cisco", "Amgen", "SVB Financial", "Lam Research"]}
{"sentence": "Overland Park, KS, based Investment company Meritage Portfolio Management (Current Portfolio) buys Fidelity National Financial Inc, ASML Holding NV, Materials Select Sector SPDR, Lam Research Corp, Vanguard Short-Term Corporate Bond ETF, sells Illumina Inc, Dropbox Inc, General Motors Co, Trane Technologies PLC, Nomad Foods during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Meritage Portfolio Management.", "spans": [[179, 191], [244, 252], [290, 308]], "date": "2022-01-28T22:38:25+00:00", "span_values": ["Illumina", "Trane Technologies", "Lam Research"]}
{"sentence": "New Purchases: FNF, ASML, XLB, VCSH, GPI, VLUE, ARW, VMW, AEPPZ, HMC, UL, CMI, NGLOY, PCH, PNW, SLG, MDC, RGR, GRMN, CP, EAF, MXL, OXM, BLDR, GOOD, PBH, NXGN, EMLC, FIX, THRM, KTB, CAMT, CARG, MCFE, AVIR, IWV, SPDW, AUDC, VWO, GES, SITE, WMS, MTDR, USNA, UTHR, TXRH, SM, SKY, SSD, CORT, PSB, NUS, NYCB, MTX, Added Positions: LRCX, MRNA, CSCO, CVX, NWE, BMY, SPYG, VIRT, TRTN, VLVLY, IVV, IGIB, SCHP, SCHO, LEG, ELUXY, ILPT, SCHR, XLF, NVO, SPG, TNET, CUBI, VYM, PDCE, VTI, MUB, FCN, BRK.B, EXR, BP, CRUS, ASO, COKE, ASIX, ATKR, CNO, NSA, CW, IBP, EVTC, ICLR, SUPN, YELP, DECK, PRI, MYRG, AMAT, HTH, AEL, VTV, ABC, VO, VBR, SRLN, AIT, CATY, OZK, NYF, BA, ESGV, COF, XPEL, DELL, LSCC, NVMI, EME, NHC, MTH, MCK, MTG, MDU, EMR, EXP, LKQ, KR, HBNC, HWKN, THG, GS, GIII, FWRD, STLD, DIOD, TTGT, FBMS, WAL, WFC, TMO, SYNA, SF, DAN, EOG, RCII, RDN, PRU, AYI, ASGN, ODFL, Reduced Positions: ILMN, DBX, GM, IGSB, XLP, SPYV, BAC, PM, GD, KMI, FB, AAPL, CROX, IWF, STX, AMZN, GOOGL, GVI, FL, GNRC, BIO, C, COP, DHR, XOM, KEY, PFE, TPX, VZ, VOD, WPC, ZBRA, MA, AVGO, FTNT, SSNC, ABBV, APAM, EBND, IJR, IWD, SCHF, ADBE, MO, AME, BTI, BKE, CBT, CTRA, CNQ, NNN, LCII, GPC, GILD, HR, KLAC, SPGI, MET, NFG, OGE, ORI, OMC, PPL, PFG, O, RIO, ANTM, EVRG, BNPQY, UOVEY, AIMC, NOVT, CTRE, KEYS, NVT, DIA, IUSG, IWM, SCHA, SCHG, SLYV, SPHD, SPY, USHY, VXUS, XLU, ALGN, CR, LLY, FISV, GE, IBM, IDXX, MCD, TYL, DIS, GOOG, MC, CC, EFA, SDY, SHM, VBK, VDC, Sold Out: TT, NOMD, XLC, MNST, QRVO, ERIC, ATVI, CAH, MGP, DOW, STT, FHI, LNVGY, WMB, NTR, HPQ, NTB, LMT, KSU, SIMO, WNS, ONEQ, SCPL, CRSP, MDP, HNI, HELE, INT, REVG, WHD, RCKY, IWO, MRK, CNX,Story continuesWarning!", "spans": [[893, 895], [1204, 1207], [1360, 1362], [1364, 1367], [1488, 1491]], "date": "2022-01-28T22:38:25+00:00", "span_values": ["IBM", "GE", "GM", "DOW", "PPL"]}
{"sentence": "Investment company Kendall Capital Management (Current Portfolio) buys JPMorgan Ultra-Short Income ETF, FlexShares iBoxx 5-Year Target Duration TIPS Index, iShares Russell 2500 ETF, iShares Micro-Cap ETF, Qorvo Inc, sells Cadence Bank, Cadence Bank, Magna International Inc, AT&T Inc, Generac Holdings Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Kendall Capital Management.", "spans": [[205, 210], [222, 229], [236, 243], [275, 279], [285, 292]], "date": "2022-01-28T18:38:03+00:00", "span_values": ["Qorvo", "Cadence", "Generac", "AT&T"]}
{"sentence": "New Purchases: SMMD, QRVO, MED, VSTO, NLOK, WGO, MLI, AVT, INVA, MDC, CMRE, CADE, CADE, BECN, MCK, TMO, SCPL, CVX, Added Positions: JPST, TDTF, IWC, TGNA, DTD, VCTR, HPQ, PAG, CBNK, AVGO, THO, CSGS, ARW, HI, MAS, VO, BMY, REZ, GLDM, GUNR, EVR, AAWW, HZO, RCII, NUS, VTI, OMC, ECPG, UGI, NXST, EBS, GPN, MRK, INTC, HIBB, VB, FISV, ACI, CDW, DFS, EQH, JNJ, TXN, CBOE, MO, QCOM, DGX, JPM, GPI, CSCO, TVTY, TMHC, IJK, PRGS, MSFT, Reduced Positions: MGA, T, GNRC, URI, GOOGL, VSEC, QSR, LEA, SPGI, WBA, UNP, KLAC, JAZZ, AAPL, CCSI, BIIB, UNM, OMF, SCS, FHI, VST, ABBV, SASR, CBRE, DLX, ZD, BHF, MEDP, NSC, VIAC, WERN, NAVI, AMCX, BWA, ORCL, IBM, AES, DHR, REGN, LYB, CACI, HBI, ACN, VLO, CMI, IJS, IWB, XOM, TGT, MCO, IWP, ABR, ORLY, SFM, DOOR, AN, SLM, SJM, WW, AZN, ICLR, WWE, SYK, Sold Out: CADE, CADE, PENN, FIS, TFC, VMW, DELL,Warning!", "spans": [[335, 338], [360, 364], [570, 574], [636, 639], [641, 644], [807, 810]], "date": "2022-01-28T18:38:03+00:00", "span_values": ["IBM", "CBRE", "FIS", "AES", "CBOE", "CDW"]}
{"sentence": "Investment company Emfo, Llc (Current Portfolio) buys BHP Group, P3 Health Partners Inc, American Express Co, CubeSmart, Unum Group, sells Foresight Acquisition Corp, Amgen Inc, 3M Co, SPDR Gold Shares ETF, FedEx Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Emfo, Llc.", "spans": [[89, 105], [167, 172], [178, 180], [207, 212]], "date": "2022-01-27T22:38:32+00:00", "span_values": ["Amgen", "3M", "FedEx", "American Express"]}
{"sentence": "New Purchases: BHP, PIII, AXP, CUBE, UNM, STEM, XLE, C, GPN, BACPL.PFD, CRGY, QQQ, SBCF, IVT, CP, BX, PINS, DSS, Added Positions: GS, SCHP, CRM, BA, KO, DOW, SKIN, VEA, ACGL, NXPI, F, AMZN, RSP, YOLO, PLTR, U, REKR, STRA, SCHE, SCHM, MBIO, Reduced Positions: AMGN, MMM, GLD, FDX, VZ, V, PLUG, MRNA, UBER, INTC, PYPL, SWK, MDT, CKPT, GM, PLAN, CLVS, VIGI, IEP, SRNE, RBLX, COIN, BDSI, USMV, RODM, PFE, CMCSA, BBY, TALK, ATXI, PTPI, MRK, DVY, HACK, LAZR, IHI, T, TLRY, TLRY, PBA, OGN, BIPC, BMRN, HYG, JG, KRE, VTRS, Sold Out: FORE, VIAC, QRVO, MTCH, SOFI, SOFI, MLM, MCF, LIDR, PSFE, PCI, ALT, PSA, ALLY, RDS.A, UVXY, EDIT, UL, NVAX, KSU, KVHI, ACB, PNW, AVPT, GILD, BP, OPK, COUP,Warning!", "spans": [[153, 156], [333, 335]], "date": "2022-01-27T22:38:32+00:00", "span_values": ["GM", "DOW"]}
