{"sentence": "Other Stocks to ConsiderSome other top-ranked stocks from the finance sector are United Fire Group, Inc. UFCS, Cincinnati Financial Corp. CINF and Berkshire Hathaway Inc. (BRK.B).", "spans": [[111, 131], [147, 165]], "date": "2022-04-01T23:35:11+00:00", "span_values": ["Berkshire Hathaway", "Cincinnati Financial"]}
{"sentence": "United Fire and Cincinnati Financial currently sport a Zacks Rank #1 (Strong Buy), whereas Berkshire Hathaway carries a Zacks Rank #2.", "spans": [[16, 36], [91, 109]], "date": "2022-04-01T23:35:11+00:00", "span_values": ["Berkshire Hathaway", "Cincinnati Financial"]}
{"sentence": "HARTFORD, Conn., March 30, 2022--(BUSINESS WIRE)--The Travelers Companies, Inc. (NYSE: TRV) today announced the results of the 2022 Travelers Risk Index on distracted driving, revealing that dangerous behaviors continue on U.S. roadways.", "spans": [[0, 8], [54, 63], [132, 141]], "date": "2022-03-30T13:19:00+00:00", "span_values": ["Travelers", "HARTFORD"]}
{"sentence": "A component of the Dow Jones Industrial Average, Travelers has approximately 30,000 employees and generated revenues of approximately $35 billion in 2021.", "spans": [[19, 22], [49, 58]], "date": "2022-03-30T13:19:00+00:00", "span_values": ["Dow", "Travelers"]}
{"sentence": "HARTFORD, Conn., March 28, 2022--(BUSINESS WIRE)--The Travelers Institute, the public policy division of The Travelers Companies, Inc. (NYSE: TRV), today announced the upcoming sessions of the Wednesdays with Woodward® series.", "spans": [[0, 8], [54, 63], [109, 118]], "date": "2022-03-28T12:00:00+00:00", "span_values": ["Travelers", "HARTFORD"]}
{"sentence": "HARTFORD, Conn., March 24, 2022--(BUSINESS WIRE)--The Travelers Companies, Inc. (NYSE: TRV) today announced the 2022 recipients of its Personal Insurance Agent of the Year Award.", "spans": [[0, 8], [54, 63]], "date": "2022-03-24T12:30:00+00:00", "span_values": ["Travelers", "HARTFORD"]}
{"sentence": "A component of the Dow Jones Industrial Average, Travelers has approximately 30,000 employees and generated revenues of approximately $35 billion in 2021.", "spans": [[19, 22], [49, 58]], "date": "2022-03-24T12:30:00+00:00", "span_values": ["Dow", "Travelers"]}
{"sentence": "HARTFORD, Conn., March 14, 2022--(BUSINESS WIRE)--The Travelers Institute, the public policy division of The Travelers Companies, Inc. (NYSE: TRV), will host a webinar on Wednesday, March 16, titled \"Global Hot Spots and Geopolitical Risks with Former U.S. Secretary of Defense Chuck Hagel.\"", "spans": [[0, 8], [54, 63], [109, 118]], "date": "2022-03-14T12:30:00+00:00", "span_values": ["Travelers", "HARTFORD"]}
{"sentence": "A component of the Dow Jones Industrial Average, Travelers has approximately 30,000 employees and generated revenues of approximately $35 billion in 2021.", "spans": [[19, 22], [49, 58]], "date": "2022-03-11T14:00:00+00:00", "span_values": ["Dow", "Travelers"]}
{"sentence": "Stocks to ConsiderSome better-ranked stocks from the same space include Cincinnati Financial Corporation CINF, Everest Re Group RE and W.R. Berkley Corporation WRB, each sporting a Zacks Rank #1 (Strong Buy).", "spans": [[72, 92], [111, 118], [140, 147]], "date": "2022-03-01T16:17:04+00:00", "span_values": ["Berkley", "Everest", "Cincinnati Financial"]}
{"sentence": "HARTFORD, Conn., February 28, 2022--(BUSINESS WIRE)--The Travelers Institute, the public policy division of The Travelers Companies, Inc. (NYSE: TRV), will host a webinar on Wednesday, March 2, at 1:00 pm ET, titled \"Power Up: Growth Opportunities in Renewable Energy.\"", "spans": [[0, 8], [57, 66], [112, 121]], "date": "2022-02-28T13:30:00+00:00", "span_values": ["Travelers", "HARTFORD"]}
{"sentence": "Only three Dow components were in the green (slightly): Amgen, Travelers and McDonald's.", "spans": [[11, 14], [56, 61], [63, 72], [77, 87]], "date": "2022-02-22T19:32:10+00:00", "span_values": ["Dow", "McDonald's", "Amgen", "Travelers"]}
{"sentence": "Performance of Other Property & Casualty InsurersOf the insurance industry players that have reported fourth-quarter results so far, The Travelers Companies TRV, RenaissanceRe Holdings Ltd. RNR and The Progressive Corporation PGR beat the Zacks Consensus Estimate for earnings.", "spans": [[137, 146], [202, 213]], "date": "2022-02-16T15:17:03+00:00", "span_values": ["Progressive", "Travelers"]}
{"sentence": "Large-Cap ETF, sells Vanguard Short-Term Bond ETF, Schlumberger, AT&T Inc, Vanguard Total Bond Market ETF, 3M Co during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Van Strum & Towne Inc..", "spans": [[51, 63], [65, 69], [107, 109]], "date": "2022-02-08T19:38:23+00:00", "span_values": ["3M", "Schlumberger", "AT&T"]}
{"sentence": "New Purchases: CMF, TIP, ICE, PFF, IWD, TRV, Added Positions: VTIP, SCHJ, VCSH, SCHX, DIS, JNJ, SCHP, PEP, ABBV, GOOGL, SCHV, AMGN, VTI, AMZN, ALL, BRK.B, NTR, Reduced Positions: MSFT, VOO, SLB, IBM, SIVB, IGIB, MMM, COF, LQD, VZ, GE, NVS, SCHI, TMO, INTC, DHR, PPG, TGT, UNP, CMCSA, WFC, SCHW, CDNS, AAPL, ADBE, Sold Out: BSV, T, BND, KD,Warning!", "spans": [[195, 198], [231, 233]], "date": "2022-02-08T19:38:23+00:00", "span_values": ["IBM", "GE"]}
{"sentence": "Kinneret Advisory, LLC Buys Visa Inc, WEC Energy Group Inc, The Travelers Inc, Sells Waters ....", "spans": [[28, 32], [38, 54], [64, 73], [85, 91]], "date": "2022-02-08T18:38:04+00:00", "span_values": ["Waters", "Visa", "Travelers", "WEC Energy Group"]}
{"sentence": "New York, NY, based Investment company Kinneret Advisory, LLC (Current Portfolio) buys Visa Inc, WEC Energy Group Inc, The Travelers Inc, McCormick Inc, Canadian Pacific Railway, sells Waters Corp, Wells Fargo, Workday Inc, , McCormick Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Kinneret Advisory, LLC.", "spans": [[87, 91], [97, 113], [123, 132], [138, 147], [185, 191], [198, 209], [226, 235]], "date": "2022-02-08T18:38:04+00:00", "span_values": ["McCormick", "Travelers", "Wells Fargo", "Waters", "WEC Energy Group", "Visa"]}
{"sentence": "Investment company Atlas Private Wealth Management (Current Portfolio) buys Coinbase Global Inc, S&P Global Inc, 3M Co, West Pharmaceutical Services Inc, Merck Inc, sells Verisk Analytics Inc, The Travelers Inc, PIMCO Enhanced Short Maturity Active Exchange-Trad, Charles Schwab Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Atlas Private Wealth Management.", "spans": [[97, 107], [113, 115], [120, 148], [154, 159], [171, 177], [197, 206], [264, 278]], "date": "2022-02-08T01:38:09+00:00", "span_values": ["Charles Schwab", "West Pharmaceutical Services", "Verisk", "Merck", "3M", "S&P Global", "Travelers"]}
{"sentence": "Buys Sysco Corp, Corning Inc, Everest Re Group, Sells ....", "spans": [[5, 10], [17, 24], [30, 37]], "date": "2022-02-07T22:38:18+00:00", "span_values": ["Sysco", "Everest", "Corning"]}
{"sentence": "Dayton, OH, based Investment company Buckingham Capital Management, Inc. (Current Portfolio) buys Sysco Corp, Corning Inc, Everest Re Group, JPMorgan Ultra-Short Municipal Income ETF, Restaurant Brands International Inc, sells Raytheon Technologies Corp, Delta Air Lines Inc, Royal Caribbean Group, Texas Instruments Inc, The Travelers Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Buckingham Capital Management, Inc..", "spans": [[98, 103], [110, 117], [123, 130], [227, 248], [255, 270], [276, 297], [299, 316], [326, 335]], "date": "2022-02-07T22:38:18+00:00", "span_values": ["Sysco", "Travelers", "Royal Caribbean Group", "Corning", "Raytheon Technologies", "Everest", "Texas Instruments", "Delta Air Lines"]}
{"sentence": "New Purchases: JMST, FDS, ABBV, Added Positions: SYY, GLW, RE, QSR, VEU, PYPL, SCHM, UNP, SCHA, AMZN, AES, DIS, V, MDT, AZN, TMUS, DG, HON, SYK, FB, ABT, XLB, W, TTE, GOOGL, NVDA, ENB, KO, Reduced Positions: GSY, SPSB, AAPL, HD, PEP, MSFT, CRM, AVGO, WM, ADI, NKE, LLY, DLR, DAL, BLK, AMAT, LHX, NEAR, RCL, SCHB, SCHF, PGR, VMW, QUAL, C, AEP, NEE, IVV, UPS, PRU, JBHT, IJH, PPL, T, MRK, MAS, SCHD, GE, DPZ, CMCSA, CSCO, ALGN, ORCL, USMV, VWO, DBEF, VFC, UL, SBUX, PFE, MET, INFY, ETN, CVS, BDX, ACN, Sold Out: RTX, TXN, TRV,Warning!", "spans": [[102, 105], [374, 377], [398, 400]], "date": "2022-02-07T22:38:18+00:00", "span_values": ["PPL", "GE", "AES"]}
{"sentence": "We will take a look at SVB Financial Group (NASDAQ:SIVB), The Travelers Companies Inc (NYSE:TRV), Kinder Morgan Inc (NYSE:KMI), The Allstate Corporation (NYSE:ALL), DiDi Global Inc. (NYSE:DIDI), Manulife Financial Corporation (NYSE:MFC), and Xilinx, Inc. (NASDAQ:XLNX).", "spans": [[23, 36], [62, 71], [98, 111], [132, 140]], "date": "2022-02-07T19:21:40+00:00", "span_values": ["Allstate", "Kinder Morgan", "Travelers", "SVB Financial"]}
{"sentence": "We will take a look at Kinder Morgan Inc (NYSE:KMI), The Allstate Corporation (NYSE:ALL), DiDi Global Inc. (NYSE:DIDI), Manulife Financial Corporation (NYSE:MFC), Xilinx, Inc. (NASDAQ:XLNX), Telefonaktiebolaget LM Ericsson (publ) (NASDAQ:ERIC), and Banco Bradesco SA (NYSE:BBD).", "spans": [[23, 36], [57, 65]], "date": "2022-02-07T17:30:36+00:00", "span_values": ["Allstate", "Kinder Morgan"]}
{"sentence": "We will take a look at Cognizant Technology Solutions Corp (NASDAQ:CTSH), Ross Stores, Inc. (NASDAQ:ROST), ResMed Inc. (NYSE:RMD), Republic Services, Inc. (NYSE:RSG), SVB Financial Group (NASDAQ:SIVB), Travelers Companies Inc (NYSE:TRV), and Kinder Morgan Inc (NYSE:KMI).", "spans": [[23, 32], [74, 78], [107, 113], [131, 148], [167, 180], [202, 211], [242, 255]], "date": "2022-02-06T21:40:40+00:00", "span_values": ["Cognizant", "ResMed", "SVB Financial", "Ross", "Kinder Morgan", "Republic Services", "Travelers"]}
{"sentence": "These stocks are Travelers Companies Inc (NYSE:TRV), Kinder Morgan Inc (NYSE:KMI), The Allstate Corporation (NYSE:ALL), DiDi Global Inc. (NYSE:DIDI), Manulife Financial Corporation (NYSE:MFC), Xilinx, Inc.", "spans": [[17, 26], [53, 66], [87, 95]], "date": "2022-02-06T16:57:39+00:00", "span_values": ["Allstate", "Kinder Morgan", "Travelers"]}
{"sentence": "Capital Wealth Planning, LLC Buys Marathon Petroleum Corp, Procter &amp; Gamble Co, Cisco ....", "spans": [[34, 52], [84, 89]], "date": "2022-02-04T22:38:30+00:00", "span_values": ["Marathon Petroleum", "Cisco"]}
{"sentence": "Naples, FL, based Investment company Capital Wealth Planning, LLC (Current Portfolio) buys Marathon Petroleum Corp, Procter & Gamble Co, Cisco Systems Inc, Nike Inc, The Home Depot Inc, sells 3M Co, Medtronic PLC, Newmont Corp, Johnson & Johnson, Verizon Communications Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Capital Wealth Planning, LLC.", "spans": [[91, 109], [116, 132], [137, 142], [156, 160], [170, 180], [192, 194], [199, 208], [214, 221], [228, 245], [247, 254]], "date": "2022-02-04T22:38:30+00:00", "span_values": ["Home Depot", "Verizon", "Nike", "Johnson & Johnson", "3M", "Cisco", "Medtronic", "Procter & Gamble", "Marathon Petroleum", "Newmont"]}
{"sentence": "New Purchases: MPC, TRV, IYT, ZS, AMD, ZTS, TXN, PAYC, PH, MPWR, MDB, MCHP, MMC, K, INTC, FTNT, DXCM, DDOG, NET, BILL, DIVO, JCI, EXC, STT, SYK, Added Positions: PG, CSCO, NKE, HD, JPM, DIA, UNH, MCD, GS, HON, CVX, DUK, AAPL, CSX, CAT, V, WMT, ICE, RJF, SPY, GOOGL, DOW, XME, XLE, QQQ, NVDA, GLD, AMZN, NFLX, SH, TMO, AMGN, CME, AVGO, ACN, ADBE, UNP, TEL, AXP, ADP, NOW, BA, ABT, PEP, PYPL, CMCSA, MDLZ, FB, COP, LOW, COST, Reduced Positions: MMM, MDT, NEM, JNJ, VZ, UPS, MSFT, DBC, MRK, CAG, BAC, DIS, XOM, KO, BMY, ORCL, SBUX, GDX, Sold Out: SCHB, CLX, XLV, EDV, SCHH, AWK, SOXX, BIL, LMT, BP, WTRG, XLC, VPU, SOXL, SCHF, QLD, LQD, DOCU, WFC, VFC, SJW, LW, PINS, EW, CWT, CRM, BABA, AWR, ABBV, ISRG, GOOG,Warning!", "spans": [[34, 37], [226, 229], [266, 269], [361, 364]], "date": "2022-02-04T22:38:30+00:00", "span_values": ["AMD", "DOW", "ADP", "CSX"]}
{"sentence": "Heron Financial Group, Llc Buys Bank of America Corp, M&amp;T Bank Corp, NVIDIA Corp, Sells ....", "spans": [[32, 47], [73, 79]], "date": "2022-02-04T22:38:16+00:00", "span_values": ["NVIDIA", "Bank of America"]}
{"sentence": "Investment company Heron Financial Group, Llc (Current Portfolio) buys Bank of America Corp, M&T Bank Corp, NVIDIA Corp, Advanced Micro Devices Inc, Cummins Inc, sells Moderna Inc, Plexus Corp, eBay Inc, Deutsche Bank AG, Sunrun Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Heron Financial Group, Llc.", "spans": [[71, 86], [93, 101], [108, 114], [149, 156], [168, 175], [194, 198]], "date": "2022-02-04T22:38:16+00:00", "span_values": ["NVIDIA", "Moderna", "Bank of America", "eBay", "M&T Bank", "Cummins"]}
{"sentence": "New Purchases: BAC, MTB, AMD, CMI, TRV, FB, ARW, CAH, Added Positions: IWP, IWO, NVDA, EFAV, IVV, VB, IWR, JPEM, VYM, VOO, VUG, TMUS, IBM, MA, NFLX, NEE, GOOG, INTC, PYPL, VZ, GPC, MSFT, JNJ, DUK, DTE, CMC, CVS, BDX, AMAT, ADBE, AMGN, BIV, SJM, GOOGL, FDX, EMR, ETN, CAT, ADI, NKE, IEMG, MRK, ADP, Reduced Positions: RUN, INTU, JPM, MS, SON, PFF, PGR, PSX, PIE, SEE, PFE, VLO, AVGO, MPC, ORAN, CACI, WMB, UNH, HDV, PAG, QCOM, UL, TGT, SYK, T, PG, MMC, FISV, CVX, BIIB, MCD, LOW, MDLZ, DEO, DTM, IJR, BMY, Sold Out: MRNA, PLXS, EBAY, DB,Warning!", "spans": [[25, 28], [134, 137], [197, 200], [293, 296], [527, 531]], "date": "2022-02-04T22:38:16+00:00", "span_values": ["DTE", "EBAY", "AMD", "ADP", "IBM"]}
{"sentence": "The sale prices were between $84.14 and $97.73, with an estimated average price of $92.35.Sold Out: eBay Inc (EBAY)Heron Financial Group, Llc sold out a holding in eBay Inc.", "spans": [[100, 104], [110, 114], [164, 168]], "date": "2022-02-04T22:38:16+00:00", "span_values": ["EBAY", "eBay"]}
{"sentence": "We will take a look at ResMed Inc. (NYSE:RMD), Republic Services, Inc. (NYSE:RSG), SVB Financial Group (NASDAQ:SIVB), The Travelers Companies Inc (NYSE:TRV), Kinder Morgan Inc (NYSE:KMI), The Allstate Corporation (NYSE:ALL), and DiDi Global Inc. (NYSE:DIDI).", "spans": [[23, 29], [47, 64], [83, 96], [122, 131], [158, 171], [192, 200]], "date": "2022-02-04T22:05:56+00:00", "span_values": ["Allstate", "ResMed", "SVB Financial", "Kinder Morgan", "Republic Services", "Travelers"]}
{"sentence": "Large-Cap Value ETF, sells Invesco BulletShares 2021 Corporate Bond ETF, iShares iBonds Dec 2021 Term Corporate ETF, Cisco Systems Inc, Becton, Dickinson and Co, Occidental Petroleum Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Ironwood Financial, llc.", "spans": [[27, 34], [117, 122], [162, 182]], "date": "2022-01-28T14:38:09+00:00", "span_values": ["Cisco", "Occidental Petroleum", "Invesco"]}
{"sentence": "Added Positions: IVV, IVE, IVW, IJR, AXDX, BSJQ, SHY, BSCQ, BSCP, VTI, BSJO, VT, BSJP, IJH, VEA, BSCO, SCHV, EFA, ITOT, QQQ, RSP, IJT, VEU, IJK, HDV, BSJN, VNQ, IJJ, IJS, SCHB, XLY, IEV, BSCN, VO, DFAS, VB, TSLA, SPYX, SPY, GLD, Reduced Positions: BSCM, BSJM, IYE, AMGN, PEJ, IECS, IWO, VV, SCHM, SCHX, IETC, AMH, IWF, PFF, SOXX, INTU, IEDI, LMT, XLF, INTC, VZ, Sold Out: BSCL, IBDM, CSCO, BDX, OXY, IGV, SCHG, SLV, PSMT, TRV, WFC, BSJL, DIA, EIS, FDN, JKD, JKJ, VGT, FB, FTNT, REGN, C, CRM, PNM, SSD, IBHA, CRBN, FHLC, FLOT, IEFA, IUSV, IWB, IWD, IXJ, LIT, PDP, PPA, SLYV, VLUE, VXF, ICLN, VTRS, TXN, ULTA, A, AEP, AXP, CVX, DHR, DD, GIS, HPE, HPQ, MA, PG, SWK, T, V, WPC, ETB, DOW, CTVA, AVDV, AVUV, IBDN, SLQD, AVSF, DFAE, QPX, AOM, ARKW, CGW, DBO, DIG, DON, FBT, IDLV, IDU, IEMG, IHE, ITA, IUSG, IWV, IYK, IYT, JETS, JKE, JKH, KXI, LQD, PBD, PGX, PHO, SCHO, SPXU, TAN, UPRO, USMV, VBK, VIG, VOE, VOT, XLP, XLRE, XLU, XT, ADBE, CNMD, DOX, FFIV, HRTX, ORLY, QCOM, SNPS, SOCL, NLOK, TLT, ADM, AEE, AJG, BABA, BAC, BRK.B, CCI, CUZ, CXP, DE, DFS, DG, EMR, ESS, EXC, FCX, FSK, GE, HBM, HCA, HRC, KEYS, LDOS, LUV, MO, NVS, SPGI, ST, TGT, UA, URI, XOM, BFK, GIM, BYM, DBX, DELL, FIVG, QTUM, DIVB, IEFN, IEIH, THCX, CARR, OTIS, IBBJ, AVIG, DFAI, DFAU, QPT, ERTH, HOOD, GRC, SENS, ASXC, XPL, AGZ, AOA, AOK, ARKG, ARKK, ARKQ, BSV, IGIB, CMBS, COPX, CPER, DSI, EEM, EFAV, EMLP, EWC, EWJ, EWO, EWY, EWZ, FAS, FBND, FCOM, FDIS, FEU, FIDU, FSTA, FTEC, FXI, GDX, HACK, HYS, IAK, IAT, ICF, IEF, IEO, IEZ, ILF, IOO, IPO, ISTB, ITB, IWN, IWS, IXG, IXP, IYC, IYJ, IYM, JKF, LABU, MBB, MDY, MDYV, MGK, NANR, NOBL, OEF, PICK, PIN, PSLV, QQQE, QUAL, REM, RETL, RFV, RWK, RWR, SCHE, SCHZ, SDY, SGOL, SMDD, SPHD, SPLV, STIP, TIP, UDOW, URTY, USO, VBR, VGK, VOOG, VSS, VWO, XAR, XBI, XHB, XLG, XLI, XLK, XLV, XMLV, AAL, ARCT, AEZS, RIOT, ATVI, BPTH, BSQR, CERN, CHEK, CLNE, EGHT, EUFN, FINX, FTSM, GILD, OCGN, HTGM, IBB, IGF, IMGN, JD, JKI, KHC, LIFE, LLNW, LMBS, LULU, MAR, MVIS, NFLX, NTNX, NVDA, NWSA, OMEX, ONTX, PACW, BKNG, PDBC, RAVE, RMR, RUN, SBUX, STLD, STX, SWBI, TDIV, TQQQ, VCLT, VCSH, VCYT, VMBS, VTIP, IMUX, VXUS, WDC, WKHS, WPRT, ZYNE, ABB, ACN, AEG, AES, AIG, ALL, AOS, ARE, AA, ASIX, AUY, AZO, BAX, TFC, BCE, CAH, CAT, CCL, CHT, CL, CNC, CNP, TPR, COP, DXC, CVS, CYH, DAL, DDD, DEO, DIN, DUK, ENB, ES, FDX, GLW, GM, GME, GPC, GVA, WELL, HII, ITW, KMI, KO, LEG, MET, MFC, MGM, MS, MYOV, NAT, NAZ, NEM, NMM, OHI, OMC, PFG, PGR, PH, PM, PPG, PPL, PRU, PSX, RGR, RIG, RPM, SHW, WPM, SU, SYY, TEVA, TJX, UAL, UNP, UPS, USB, VFC, WAB, WSO, ACB, TLRY, TLRY, RMBL, TAK, ZOM, HWM, OKTA, SOS, RA, RDFN, MFGP, DBL, VYNE, BRSP, SPEM, SPSM, BLOK, EFAX, KARS, MJ, SPTL, DOCU, SPIB, NAKD, NIO, PLAN, REZI, TWST, HOTH, CTRM, IGLB, ALC, ARKF, ESPO, CNYA, IFRA, IZRL, PRNT, REGL, XSHD, GNLN, ZM, IDRV, BYND, UBER, IHAK, XMVM, XSVM, SNDL, SDC, PTON, PGNY, MOTO, VVNT, FNDF, ARNC, LEGN, NKLA, EBON, AOUT, USHY, IBDO, PLTR, VLDR, LAZR, SPAK, CHK, COIN, HNST, GTX, OGN, CMMB, CMMB, ME, MCW, LCID, VLTA,Story continuesWarning!", "spans": [[679, 682], [989, 992], [1075, 1077], [1217, 1221], [2144, 2147], [2149, 2152], [2307, 2309], [2434, 2437]], "date": "2022-01-28T14:38:09+00:00", "span_values": ["PPL", "ADM", "GE", "AES", "GM", "DOW", "AIG", "OTIS"]}
{"sentence": "Investment company Manning & Napier Group, Llc (Current Portfolio) buys Activision Blizzard Inc, Anaplan Inc, United Parcel Service Inc, FedEx Corp, PayPal Holdings Inc, sells Expedia Group Inc, Cameco Corp, EQT Corp, NVIDIA Corp, ConocoPhillips during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Manning & Napier Group, Llc.", "spans": [[72, 91], [110, 131], [137, 142], [149, 155], [176, 189], [218, 224], [231, 245]], "date": "2022-01-27T18:38:13+00:00", "span_values": ["ConocoPhillips", "NVIDIA", "Activision Blizzard", "FedEx", "PayPal", "United Parcel Service", "Expedia Group"]}
{"sentence": "New Purchases: ATVI, UPS, FDX, OLED, AMED, LHCG, BUD, MELI, FNF, SNOW, KD, Added Positions: PLAN, PYPL, STZ, MA, V, AEM, SE, APLE, UL, CHTR, GOLD, STNE, RADI, IIPR, MUB, SHM, ACC, VTR, UDR, GSIE, GSLC, IAU, SKM, SMIN, SPIB, VB, VCLT, VEA, VGIT, VGSH, VWO, Reduced Positions: EXPE, CCJ, EQT, NVDA, COP, DLTR, NSP, CTRA, AZO, XOM, SBAC, CNI, HD, AMZN, FMC, GOOGL, ICE, PG, TMO, WMT, CSCO, CMCSA, JNJ, MAA, VZ, DIS, NOW, MMM, CB, ADBE, ADP, BMY, CPRT, EQIX, GPK, HON, IBM, INTC, JPM, MDLZ, LMT, MLM, SPGI, MRK, MCO, NKE, ORCL, LIN, QCOM, UNP, ZTS, PLD, ALL, AXP, ADI, ADM, BP, BBY, BLK, CF, CPT, CAT, CINF, C, CLX, CL, CMI, DRE, EWBC, ETN, EMR, ESS, EXR, FITB, GD, GIS, GPC, GILD, LHX, HSY, HUM, IDXX, ITW, IFF, JCI, KMB, KR, MSI, NEM, NOC, PEP, PSA, DGX, RSG, TSN, USB, UNH, VMC, WM, RDS.B, BR, LULU, DG, CBOE, PANW, REXR, GOOG, NXRT, KHC, BND, AOS, BTI, BG, CHRW, CDNS, CPB, CMA, CAG, DLR, EMN, ELS, RE, GRMN, HIG, HSKA, HUBB, HBAN, ISRG, SJM, NTAP, NUE, OMC, PKG, PKX, RPM, RF, RS, SNA, LSI, STLD, SUI, GWW, WHR, WSM, PAC, BAH, CDW, AMH, INVH, SWCH, OGN, EMB, ESGD, ESGU, GIGB, HYG, JNK, MLPA, SCHD, SPTS, SUSC, USHY, VNQ, VYM, VYMI, Sold Out: TTE, TRV, ASR, VLRS, BBL, HLT, JEF, EOG,Warning!", "spans": [[185, 188], [350, 353], [433, 436], [465, 468], [565, 568], [803, 807], [1028, 1031]], "date": "2022-01-27T18:38:13+00:00", "span_values": ["FMC", "ADM", "UDR", "CDW", "IBM", "ADP", "CBOE"]}
{"sentence": "Muncie, IN, based Investment company First Merchants Corp (Current Portfolio) buys Communication Services Select Sector SPDR Fund, Vanguard Short-Term Corporate Bond ETF, PayPal Holdings Inc, Vanguard Total International Bond ETF, Meta Platforms Inc, sells Ball Corp, Franklin Electric Co Inc, Eli Lilly and Co, Newell Brands Inc, The Walt Disney Co during the 3-months ended 2021Q4, according to the most recent filings of the investment company, First Merchants Corp.", "spans": [[171, 177], [231, 235], [257, 261], [298, 303], [312, 325], [340, 346]], "date": "2022-01-27T14:38:01+00:00", "span_values": ["Lilly", "Ball", "Meta", "PayPal", "Disney", "Newell Brands"]}
{"sentence": "New Purchases: VCSH, DEO, GIS, MS, NVS, OEF, VUG, OTLK, Added Positions: XLC, AGG, GSY, CB, TXN, AMZN, PYPL, BNDX, IJR, FB, NOW, UNH, BIV, CMCSA, COP, V, GOOGL, TJX, JNJ, SPGI, CMI, UNP, XLI, SYK, XLF, LRCX, ECL, IBB, XLY, SPY, XLV, XLU, ABBV, SCHD, IEMG, EMB, VB, ALC, XLB, VV, VCIT, EFA, PLD, SCHW, CTSH, DLR, CERN, CASY, WMT, BLK, EQIX, TFC, HON, KMB, MDU, MCHP, NFLX, ABT, O, ROP, ANSS, XLE, ARE, PFF, VTEB, VO, SCHP, EMR, IYZ, IWD, IJH, LZB, MKTX, NKE, USB, Reduced Positions: BLL, LLY, DIS, AAPL, T, MCD, TRV, BWX, PEP, ADBE, IVW, AMGN, PFE, VGT, ABC, CNI, XLNX, DHR, XLRE, IJK, IJJ, DVY, DGRO, IVV, AFL, PSX, VLO, MDY, LMT, BRK.B, SCHR, CVX, CL, SCHO, GLW, IWM, XOM, D, VZ, WM, IWF, ACN, IWC, MASI, TSLA, SITE, KO, AMT, VNQ, EEM, IJT, IJS, VYM, SBUX, FRME, RSP, HRL, IBM, ITW, INTC, SJM, EA, BDX, NVDA, JNK, OMCL, ORCL, MMM, PG, POOL, SNBR, ADP, IYJ, IYH, IWO, UPS, ORLY, BRO, CVS, CRL, CFR, DE, DRE, GPC, MRK, NUE, IDV, BANF, TTC, BMY, ANTM, BX, FTV, EYE, GLD, Sold Out: FELE, NWL, ATVI, PGX, HDV, MO, RE, GDV, BA, CCL, PM,Warning!", "spans": [[774, 777], [848, 851]], "date": "2022-01-27T14:38:01+00:00", "span_values": ["ADP", "IBM"]}
{"sentence": "Large-Cap Value ETF, Vanguard Short-Term Inflation-Protected Securities, Alphabet Inc, Coca-Cola Co, sells The Travelers Inc, Amgen Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Northwest Quadrant Wealth Management, LLC.", "spans": [[73, 81], [87, 96], [111, 120], [126, 131]], "date": "2022-01-26T14:38:11+00:00", "span_values": ["Amgen", "Alphabet", "Travelers", "Coca-Cola"]}
{"sentence": "Lederer &amp; Associates Investment Counsel Buys Live Nation Entertainment Inc, Honeywell ....", "spans": [[49, 74], [80, 89]], "date": "2022-01-25T02:38:15+00:00", "span_values": ["Honeywell", "Live Nation Entertainment"]}
{"sentence": "Investment company Lederer & Associates Investment Counsel (Current Portfolio) buys Live Nation Entertainment Inc, Honeywell International Inc, Schwab U.S. REIT ETF, American Tower Corp, Verizon Communications Inc, sells Intel Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Lederer & Associates Investment Counsel.", "spans": [[84, 109], [115, 124], [166, 180], [187, 194], [221, 226]], "date": "2022-01-25T02:38:15+00:00", "span_values": ["Verizon", "Honeywell", "American Tower", "Live Nation Entertainment", "Intel"]}
{"sentence": "New Potomac Partners, LLC Buys Simon Property Group Inc, Invesco BulletShares 2027 Corporate .... Investment company New Potomac Partners, LLC (Current Portfolio) buys Simon Property Group Inc, Invesco BulletShares 2027 Corporate Bond ETF, sells Invesco BulletShares 2021 Corporate Bond ETF, AT&T Inc, Invesco BulletShares 2022 Corporate Bond ETF, Duke Energy Corp, Sempra Energy during the 3-months ended 2021Q4, according to the most recent filings of the investment company, New Potomac Partners, LLC.", "spans": [[31, 36], [57, 64], [168, 173], [194, 201], [246, 253], [292, 296], [302, 309], [348, 359], [366, 379]], "date": "2022-01-21T14:38:02+00:00", "span_values": ["Sempra Energy", "Duke Energy", "Invesco", "AT&T", "Simon"]}
{"sentence": "Investment company CRA Financial Services, LLC (Current Portfolio) buys South Jersey Industries Inc, Innovator U.S. Equity Buffer ETF - December, Vanguard Ultra-Short Bond ETF, Eaton Corp PLC, Johnson & Johnson, sells Vanguard Total Bond Market ETF, iShares 20+ Year Treasury Bond ETF, Clorox Co, ProShares UltraPro Short Dow30, Norwegian Cruise Line Holdings during the 3-months ended 2021Q4, according to the most recent filings of the investment company, CRA Financial Services, LLC.", "spans": [[177, 182], [193, 210], [286, 292], [329, 359]], "date": "2022-01-20T22:38:02+00:00", "span_values": ["Johnson & Johnson", "Clorox", "Norwegian Cruise Line Holdings", "Eaton"]}
{"sentence": "New Purchases: BDEC, VUSB, ETN, TRV, FDRR, ADBE, AVUV, IWP, NSC, PFG, TSM, CFG, VOT, IJS, ESGA, LIN, HLX, Added Positions: SCHD, SJI, IVV, QQQ, SCHG, JNJ, SCHB, PEG, VCSH, CVX, PYPL, NEE, VIG, JPM, HD, SCHM, SCHF, DIS, XOM, FDX, MUB, IWD, FB, IWF, SCHA, IEFA, NVDA, XLF, NFLX, IJR, GOOG, BLK, IWM, BA, VO, ONEQ, IBM, VNQ, RSP, VTI, VGT, SCHV, XLK, XLV, AVGO, LOW, AMGN, BAC, BRK.B, CVS, CMCSA, F, GS, INTC, LMT, MCD, MRK, TGT, ARKK, PTON, PM, MA, DNP, UNH, SSO, PGX, FISV, DVY, KO, MMM, VOO, SQ, XLC, UPS, ADP, PEP, Reduced Positions: BND, TLT, T, BABA, SCHZ, JAGG, D, XBI, VZ, COIN, GE, DIA, COP, AGG, IJK, XLU, GLD, IJJ, IVOO, MTUM, RYH, SUB, VCIT, VNLA, FPE, AVUS, EXC, HON, TD, OCFC, PG, PPL, PNC, ORCL, BMY, XLI, NKE, LQD, IWR, WMT, ITA, GM, EEM, Sold Out: CLX, SDOW, NCLH, ZM, DKNG, IP, MGC, SOXS, SLVM,Warning!", "spans": [[312, 315], [506, 509], [584, 586], [692, 695], [743, 745]], "date": "2022-01-20T22:38:02+00:00", "span_values": ["PPL", "GE", "ADP", "IBM", "GM"]}
{"sentence": "Dow Jones insurance leader Travelers Companies and Matson both rose near buy points.", "spans": [[0, 3], [27, 36]], "date": "2022-01-20T16:34:48+00:00", "span_values": ["Dow", "Travelers"]}
{"sentence": "State Street (NYSE:STT), and Bank of New York Mellon (NYSE:BK) -- both of which were under pressure a day earlier following quarterly earnings that fell short of Wall Street forecasts - gained more than 1%.M&T Bank (NYSE:MTB) and Regional Financials, however, were in the red, after quarterly results missed analysts’ expectations.", "spans": [[0, 12], [206, 214]], "date": "2022-01-20T15:46:47+00:00", "span_values": ["State Street", "M&T Bank"]}
{"sentence": "Amazon (NASDAQ:AMZN) was the notable decliner among the FAANG names, while Alphabet (NASDAQ:GOOGL), Meta Platforms (NASDAQ:FB), Microsoft (NASDAQ:MSFT) and Apple (NASDAQ:AAPL) traded higher.", "spans": [[0, 6], [75, 83], [100, 104], [128, 137], [156, 161]], "date": "2022-01-20T15:46:47+00:00", "span_values": ["Microsoft", "Apple", "Meta", "Amazon", "Alphabet"]}
{"sentence": "Recovering somewhat from the selloff, megacap growth companies including Microsoft Corp, Alphabet Inc , Amazon, Tesla Inc, Meta Platforms Inc rose 1.6% in premarket trading.", "spans": [[73, 82], [89, 97], [104, 110], [112, 117], [123, 127]], "date": "2022-01-20T12:49:10+00:00", "span_values": ["Microsoft", "Meta", "Amazon", "Tesla", "Alphabet"]}
{"sentence": "Several heavyweight growth stocks have underperformed the Nasdaq since its last record close on Nov. 19, with Amazon, Tesla and Nvidia down 15%, 12% and 24%, respectively.", "spans": [[110, 116], [118, 123], [128, 134]], "date": "2022-01-20T12:49:10+00:00", "span_values": ["Tesla", "Nvidia", "Amazon"]}
{"sentence": "The bills would bar tech platforms like Amazon from giving preference to their own businesses on their websites and big app stores like Apple from requiring app providers to use their payment system.", "spans": [[40, 46], [136, 141]], "date": "2022-01-20T12:49:10+00:00", "span_values": ["Apple", "Amazon"]}
{"sentence": "U.S. railroad operator Union Pacific Corp and trust bank Northern Trust Corp will also be reporting results later in the day for the final quarter of 2022.(Reporting by Bansari Mayur Kamdar in Bengaluru; Editing by Aditya Soni)", "spans": [[23, 36], [57, 71]], "date": "2022-01-20T12:49:10+00:00", "span_values": ["Northern Trust", "Union Pacific"]}
{"sentence": "Travelers (NYSE:TRV) stock rose 3.7% after reporting a quarter in which record investment returns more than offset a hit from catastrophe-related claims Union Pacific (NYSE:UNP) stock rose 0.6% after the railroad operator said its profit rose 24% on the year due to higher shipments of industrial products, metals and lumber.", "spans": [[0, 9], [153, 166]], "date": "2022-01-20T08:48:39+00:00", "span_values": ["Travelers", "Union Pacific"]}
{"sentence": "By 6:20 AM ET, Dow Jones futures were up 151 points, or. 0.4%, while S&P 500 futures were up 0.6% and Nasdaq 100 futures were up 0.9%.Stocks likely to be in focus later include Amazon (NASDAQ:AMZN), which announced it will open its first brick-and-mortar fashion store in California, and United Airlines, which admitted late Wednesday that it will take another year to get back to 2019 capacity levels.", "spans": [[15, 18], [177, 183], [288, 303]], "date": "2022-01-20T06:43:09+00:00", "span_values": ["Dow", "Amazon", "United Airlines"]}
{"sentence": "Netflix earnings are the highlight of the late session, while railroad operators Union Pacific (NYSE:UNP) and CSX (NASDAQ:CSX) report earlier, as do Travelers (NYSE:TRV), Baker Hughes and American Airlines (NASDAQ:AAL).4.", "spans": [[0, 7], [81, 94], [110, 113], [122, 125], [149, 158], [171, 183]], "date": "2022-01-20T06:43:09+00:00", "span_values": ["CSX", "Netflix", "Baker Hughes", "Travelers", "Union Pacific"]}
{"sentence": "Tips ETF, FIRST TR EXCH VII, Berkshire Hathaway Inc, sells BTC iShares Intermediate Government/Credit Bond ET, PIMCO Short Term Municipal Bond Active Exchange-Tr, The Travelers Inc, Block Inc, VanEck Investment Grade Floating Rate ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Mjp Associates Inc .", "spans": [[29, 47], [167, 176]], "date": "2022-01-18T14:38:20+00:00", "span_values": ["Berkshire Hathaway", "Travelers"]}
{"sentence": "New Purchases: BRK.A, SCHP, FTGC, QAI, HUBB, CDNS, MRVL, VRSK, ADI, XLF, SO, MPWR, LOW, GIS, DEO, ADSK, PLD, WMB, AGR, DFAX, DFUS, DIV, D, AMRS, Added Positions: JMST, SPSM, BRK.B, NFJ, VYM, GTO, MSFT, FTSL, VIG, AMZN, RZV, KBWB, PFE, IDV, GOOGL, COST, EW, VUG, SPTM, DFAC, DFAI, FPE, V, FB, ABBV, TMO, PEP, NVDA, AMAT, AMD, HD, AMT, DHR, MA, GOOG, ADBE, QCOM, PG, IDXX, FPXI, NKE, INTU, JEPI, SPMD, CVX, ACN, TRU, ASML, NOW, PXF, TSLA, CMI, MMM, LMT, SPGI, JNJ, CSCO, INTC, PAYX, SBUX, TXN, VZ, WST, XOM, LLY, MSCI, AWK, DUK, NEE, KO, MET, ADM, BMY, NSC, ZTS, CTAS, BX, Reduced Positions: RSP, EMNT, AAPL, VOO, FLTR, WEC, T, VGSH, UNH, NUV, JPM, AMGN, ROKU, WMT, CRM, CCI, EVV, PM, BIL, MRK, MCD, JPST, MINT, SUSA, CATH, GS, VEU, CMCSA, Sold Out: GVI, SMMU, TRV, SQ, MO, DOW, GOVT, MRNA, LEO, SBI,Warning!", "spans": [[320, 323], [511, 515], [541, 544], [772, 775]], "date": "2022-01-18T14:38:20+00:00", "span_values": ["AMD", "ADM", "DOW", "MSCI"]}
{"sentence": "The sale prices were between $42.64 and $48.7, with an estimated average price of $45.81.Sold Out: Dow Inc (DOW)Mjp Associates Inc sold out a holding in Dow Inc.", "spans": [[99, 102], [108, 111], [153, 156]], "date": "2022-01-18T14:38:20+00:00", "span_values": ["Dow", "DOW"]}
{"sentence": "The Zacks Analyst Blog Highlights: The PNC Financial Services Group Inc., United Airlines Holdings Inc., Discover Financial Services, The Travelers Companies Inc. and American Airlines Group Inc.", "spans": [[39, 61], [74, 89], [105, 113], [138, 147], [167, 190]], "date": "2022-01-18T12:18:12+00:00", "span_values": ["American Airlines Group", "United Airlines", "PNC Financial Services", "Travelers", "Discover"]}
{"sentence": "Stocks recently featured in the blog include: The PNC Financial Services Group Inc. PNC, United Airlines Holdings Inc.", "spans": [[50, 72], [89, 104]], "date": "2022-01-18T12:18:12+00:00", "span_values": ["PNC Financial Services", "United Airlines"]}
{"sentence": "UAL, Discover Financial Services DFS, The Travelers Companies Inc.", "spans": [[5, 13], [42, 51]], "date": "2022-01-18T12:18:12+00:00", "span_values": ["Travelers", "Discover"]}
{"sentence": "Five large-cap companies — The PNC Financial Services Group Inc., United Airlines Holdings Inc., Discover Financial Services, The Travelers Companies Inc. and American Airlines Group Inc. — are slated to release their fourth-quarter 2021 earnings results this week.", "spans": [[31, 53], [66, 81], [97, 105], [130, 139], [159, 182]], "date": "2022-01-18T12:18:12+00:00", "span_values": ["American Airlines Group", "United Airlines", "PNC Financial Services", "Travelers", "Discover"]}
