{"sentence": "To enable today’s needs and tomorrow’s next big ideas, we must innovate, collaborate and keep pace as an industry in bringing new standards and architectures to life,\" said Rob Soderbery, EVP and GM, Flash Business Unit at Western Digital.", "spans": [[196, 198], [223, 238]], "date": "2022-03-30T08:00:00+00:00", "span_values": ["GM", "Western Digital"]}
{"sentence": "To enable today’s needs and tomorrow’s next big ideas, we must innovate, collaborate and keep pace as an industry in bringing new standards and architectures to life,\" said Rob Soderbery, EVP and GM, Flash Business Unit at Western Digital.", "spans": [[196, 198], [223, 238]], "date": "2022-03-30T00:00:00+00:00", "span_values": ["GM", "Western Digital"]}
{"sentence": "Story continuesIn 2021, Seagate teamed up with Equinix EQIX to expand the accessibility of the Lyve service.", "spans": [[24, 31], [47, 54]], "date": "2022-03-18T12:24:12+00:00", "span_values": ["Seagate", "Equinix"]}
{"sentence": "Yet buying these stocks to benefit from Apple’s metrics is a portfolio strategy often overlooked by investors.7 Safe Investments for Seniors to Consider in 2022With that strategy in mind, here are seven Apple supplier stocks that should benefit from robust sales of Apple devices in 2022:Analog Devices (NASDAQ:", "spans": [[40, 45], [203, 208], [266, 271], [288, 302]], "date": "2022-03-17T11:06:12+00:00", "span_values": ["Analog Devices", "Apple"]}
{"sentence": "ADI) Broadcom (NASDAQ:AVGO) NXP Semiconductors (NASDAQ:NXPI) Qualcomm (NASDAQ:QCOM) Skyworks Solutions (NASDAQ:SWKS)", "spans": [[5, 13], [28, 31], [61, 69], [84, 92]], "date": "2022-03-17T11:06:12+00:00", "span_values": ["NXP", "Qualcomm", "Skyworks", "Broadcom"]}
{"sentence": "Texas Instruments (NASDAQ:TXN) Western Digital (NASDAQ:WDC)Apple Supplier Stocks to Buy: Analog Devices (ADI) Analog Devices (ADI) sign outside of buildingSource: jejim / Shutterstock.com52-week range: $143.85 – $191.95 Dividend yield: 2.06%Wilmington, Massachusetts-based Analog Devices is a leading semiconductor company focused on manufacturing integrated circuits that process analog and digital signals.", "spans": [[0, 17], [31, 46], [59, 64], [89, 103], [110, 124], [273, 287]], "date": "2022-03-17T11:06:12+00:00", "span_values": ["Analog Devices", "Texas Instruments", "Western Digital", "Apple"]}
{"sentence": "Broadcom (AVGO) broadcom (AVGO) logo outside office buildingSource: Sasima / Shutterstock.com52-week range: $419.14 – $677.76 Dividend Yield: 2.84%Our next stock is another chip giant, namely Broadcom — one of the largest chipmakers by market capitalization.", "spans": [[0, 8], [16, 24], [192, 200]], "date": "2022-03-17T11:06:12+00:00", "span_values": ["Broadcom", "broadcom"]}
{"sentence": "The 12-month median price forecast for Broadcom stock is at $700.Apple Supplier Stocks to Buy:", "spans": [[39, 47], [65, 70]], "date": "2022-03-17T11:06:12+00:00", "span_values": ["Apple", "Broadcom"]}
{"sentence": "Qualcomm’s chips power the Oculus Quest 2 VR headsets manufactured by Meta Platforms (NASDAQ:FB).", "spans": [[0, 8], [70, 74]], "date": "2022-03-17T11:06:12+00:00", "span_values": ["Qualcomm", "Meta"]}
{"sentence": "Finally, the 12-month median price forecast for Qualcomm stock is at $220.Apple SupplierStocks to Buy: Skyworks Solutions (SWKS) the Skyworks (SWKS) website is loading on a smartphoneSource: madamF / Shutterstock.com52-week range: $127.34 – $204.00 Dividend Yield: 1.76%Irvine, California-based Skyworks Solutions manufactures semiconductors for use in radio frequency (RF) and mobile communications systems.", "spans": [[48, 56], [74, 79], [103, 111], [133, 141], [295, 303]], "date": "2022-03-17T11:06:12+00:00", "span_values": ["Skyworks", "Qualcomm", "Apple"]}
{"sentence": "The 12-month median price forecast for Skyworks stock stands at $180.Texas Instruments (TXN) Texas Instruments (TXN) logo on its world headquarters located in Dallas, Texas.", "spans": [[39, 47], [69, 86], [93, 110]], "date": "2022-03-17T11:06:12+00:00", "span_values": ["Texas Instruments", "Skyworks"]}
{"sentence": "Meanwhile, the 12-month median price forecast for Texas Instruments stock is at $199.Apple Supplier Stocks to Buy: Western Digital (WDC) Front of a Western Digital (WDC) building in Malpitas, California.", "spans": [[50, 67], [85, 90], [115, 130], [148, 163]], "date": "2022-03-17T11:06:12+00:00", "span_values": ["Texas Instruments", "Apple", "Western Digital"]}
{"sentence": "\"Story continues\"It goes without saying that trust is paramount to any relationship with business partners, and DDN is pleased to see Western Digital recognized for their integrity and respected position in the industry,\" said Kurt Kuckein, VP of Marketing at DDN.", "spans": [[54, 63], [134, 149]], "date": "2022-03-15T12:00:00+00:00", "span_values": ["Western Digital", "paramount"]}
{"sentence": "A brief look at the hedge fund's portfolio reveals that the top holdings are concentrated in the information technology industry, and since we're focusing on D.E. Shaw's top semiconductor picks, the top three holdings in this subsegment of the portfolio are in QUALCOMM Incorporated (NASDAQ:QCOM), Advanced Micro Devices, Inc. (NASDAQ:AMD), and NVIDIA Corporation (NASDAQ:NVDA).Story continues 10 Best Semiconductor Stocks to Invest in According to DE Shaw's DE Shawl-n-r2tVRjxzFM8-unsplashOur MethodologyIn order to narrow down D.E. Shaw's top ten semiconductor picks from the hundreds of different companies and positions present in its investment portfolio, we took a look at the firm's filings with the Securities and Exchange Commission for the fourth quarter of last year.", "spans": [[261, 269], [335, 338], [345, 351]], "date": "2022-03-10T14:45:33+00:00", "span_values": ["AMD", "QUALCOMM", "NVIDIA"]}
{"sentence": "Advanced Micro Devices, Inc. (NASDAQ:AMD), QUALCOMM Incorporated (NASDAQ:QCOM), and NVIDIA Corporation (NASDAQ:NVDA) are met by Teradyne, Inc. (NASDAQ:TER) as one of D.E. Shaw's favorite chip stocks.9.", "spans": [[37, 40], [43, 51], [84, 90], [128, 136]], "date": "2022-03-10T14:45:33+00:00", "span_values": ["AMD", "Teradyne", "QUALCOMM", "NVIDIA"]}
{"sentence": "”Marvell Technology, Inc. (NASDAQ:MRVL) joins QUALCOMM Incorporated (NASDAQ:QCOM), Advanced Micro Devices, Inc. (NASDAQ:AMD), and NVIDIA Corporation (NASDAQ:NVDA) in the list of D.E. Shaw's top semiconductor picks.", "spans": [[46, 54], [120, 123], [130, 136]], "date": "2022-03-10T14:45:33+00:00", "span_values": ["AMD", "QUALCOMM", "NVIDIA"]}
{"sentence": "Let's delve deeper into each type of owner, to discover more about Western Digital.", "spans": [[47, 55], [67, 82]], "date": "2022-03-03T13:29:18+00:00", "span_values": ["discover", "Western Digital"]}
{"sentence": "BlackRock, Inc. is the second largest shareholder owning 8.0% of common stock, and State Street Global Advisors, Inc. holds about 4.0% of the company stock.", "spans": [[0, 9], [83, 95]], "date": "2022-03-03T13:29:18+00:00", "span_values": ["State Street", "BlackRock"]}
{"sentence": "The sector includes companies with the largest market capitalizations in the world, such as Apple Inc. (AAPL), Microsoft Corp. (MSFT), and Amazon.com Inc. (AMZN).", "spans": [[92, 97], [111, 120], [139, 145]], "date": "2022-02-23T19:50:13+00:00", "span_values": ["Apple", "Microsoft", "Amazon"]}
{"sentence": "SAN JOSE, Calif., February 16, 2022--(BUSINESS WIRE)--Western Digital Corp. (NASDAQ: WDC) today announced management participation in the upcoming investor conferences:Event: Susquehanna Eleventh Annual Technology Conference Presentation: Thursday, March 3, 2022 at 10:00 a.m. PT / 1:00 p.m. ET Event: Morgan Stanley Technology, Media & Telecom Conference Presentation: Thursday, March 10, 2022 at 2:25 p.m. PT / 5:25 p.m.", "spans": [[54, 69], [302, 316]], "date": "2022-02-16T22:00:00+00:00", "span_values": ["Western Digital", "Morgan Stanley"]}
{"sentence": "Also, Wall Street opinions on Pfizer, Check Point Software, Kite Realty Group, Linde, and Phathom Pharmaceuticals.", "spans": [[30, 36], [79, 84]], "date": "2022-02-12T01:52:00+00:00", "span_values": ["Linde", "Pfizer"]}
{"sentence": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips7 Oil Stocks to Buy as Multiple Catalysts ConvergeWith that said, here are seven undervalued stocks to buy that have significant potential to beat the market in 2022.Coinbase Global (NASDAQ:COIN) General Motors (NYSE:GM) HP (NYSE:HPQ) Netflix (NASDAQ:", "spans": [[279, 281], [283, 285], [297, 304]], "date": "2022-02-11T18:07:05+00:00", "span_values": ["GM", "HP", "Netflix"]}
{"sentence": "The 12-month median price forecast for Qualcomm stock stands at $220.Western Digital (WDC) Front of a Western Digital (WDC) building in Malpitas, California.", "spans": [[39, 47], [69, 84], [102, 117]], "date": "2022-02-11T18:07:05+00:00", "span_values": ["Qualcomm", "Western Digital"]}
{"sentence": "Compared to Meta Platforms (NASDAQ:FB), previously known as Facebook, Microsoft’s Activision buy is relatively small.", "spans": [[12, 16], [70, 79]], "date": "2022-02-10T21:23:28+00:00", "span_values": ["Microsoft", "Meta"]}
{"sentence": "Micron, Western Digital Shares Are Surging.", "spans": [[0, 6], [8, 23]], "date": "2022-02-10T16:15:00+00:00", "span_values": ["Western Digital", "Micron"]}
{"sentence": "Micron’s stock rose about 2% in late trading following Western Digital’s announcement.", "spans": [[0, 6], [55, 70]], "date": "2022-02-10T00:57:14+00:00", "span_values": ["Western Digital", "Micron"]}
{"sentence": "Micron’s stock rose about 2% in late trading following Western Digital’s announcement.", "spans": [[0, 6], [55, 70]], "date": "2022-02-10T00:57:14+00:00", "span_values": ["Western Digital", "Micron"]}
{"sentence": "Edinburgh, X0, based Investment company Artemis Investment Management LLP (Current Portfolio) buys Amazon.com Inc, PACCAR Inc, Planet Fitness Inc, Celanese Corp, Expedia Group Inc, sells Visa Inc, WEX Inc, Synchrony Financial, PayPal Holdings Inc, Booking Holdings Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Artemis Investment Management LLP.", "spans": [[99, 105], [115, 121], [147, 155], [162, 175], [187, 191], [206, 215], [227, 233], [248, 264]], "date": "2022-02-08T19:38:24+00:00", "span_values": ["PayPal", "Amazon", "Synchrony", "Booking Holdings", "Expedia Group", "PACCAR", "Visa", "Celanese"]}
{"sentence": "New Purchases: INTU, XLNX, CZOO, KHC, COP, UPST, SIVB, OMI, WY, PNC, GH, ZEN, TRMB, NFLX, USER, ARHS, MRK, ABT, HRT, COST, TMHC, STT, NKE, ASML, INTC, LUV, MFC, HUN, FL, EW, BE, MCO, SNPS, TEAM, FCF, PANW, AI, FWRG, NXST, CMC, RS, BLMN, LYLT, NTRS, SKM, Added Positions: AMZN, PCAR, PLNT, CE, EXPE, WDC, TSLA, VSCO, LOW, NSC, ALLY, AGCO, MRVI, GOOGL, SAIA, BXMT, C, SBNY, ANTM, WSC, WMS, CLH, POOL, UNP, DAR, PPL, TFII, SUMO, BNS, ITT, PNFP, TJX, FTV, AVB, TPR, TDG, SPLK, TENB, SYNH, ADI, JEF, WMT, LPLA, TRU, TAP, PG, KRNT, BIO, MSFT, DIS, CRWD, GXO, AVGO, AIG, BC, CGNX, TECH, NEP, A, ADM, CP, CNC, HPQ, J, STLD, AXON, TDC, FRC, ABBV, DOOO, AVY, VIAC, CVS, CM, CL, PACW, KLAC, SPG, UPS, UNH, VMI, WAL, VG, FIVE, SGH, SMAR, LEVI, NVST, AMAT, TT, STX, TER, TD, EBAY, PODD, CIT, CHTR, AMRS, WING, FND, MQ, STAA, TTEK, OLED, RCEL, VCYT, FFWM, SEDG, SHOP, PEN, EVBG, BAND, BTAI, DOCU, MRNA, BYND, MEG, TDUP, COUR, Reduced Positions: V, WEX, BKNG, XOM, GS, JPM, TMUS, GOOG, AXP, AAPL, ISRG, EFX, ESTC, ILMN, IQV, AGNC, CSCO, CHGG, SPGI, MA, ADS, SPB, ADSK, CFX, QCOM, KKR, BBWI, LIN, COIN, HES, BMBL, AB, EQH, AZEK, PFE, CNHI, FCX, CMCSA, CRM, OMF, PLD, NVDA, CHDN, ZTS, SPR, JXN, BSX, WOOF, SHW, PBR, SBLK, TRTN, INTA, LAZ, MCD, MET, PFG, TMO, TGT, BRLT, HLI, GSHD, BURL, KLTR, VRTS, LPRO, WEBR, ACN, MYTE, AEIS, STLA, IPG, ETSY, OMC, MU, SWK, ARW, HIG, INST, INST, HSII, KFRC, U, UBS, EVR, HZNP, BABA, VBTX, DBX, Sold Out: SYF, PYPL, ALGN, DELL, MTCH, BLK, ADBE, BX, EQIX, KO, CFG, FNV, SQ, PINS, JNJ, AUY, PAGS, NEE, NVAX, FOUR, AMT, FRSH, FRSH, MS, EVTC, CTAS, MO, BMY, HPE, PM, AMGN, MAN, MCHP, PWSC, CCEP, TBI, CNI, CMI, VZ, GE, SRAD, PLUG, ESMT, UBER, GILD, IDXX, AMD, OLPX, LZ, TXN, CI, LRCX, CWAN, RELY, STNE, ODFL, LEN, VAL, CNM, SRPT, ARNA, BRK.B, ONON, DHI, PHM, TSM, TRHC, THC, UTHR, MRTX, IOVA,Story continuesWarning!", "spans": [[409, 412], [559, 562], [588, 591], [762, 766], [1322, 1326], [1628, 1630], [1668, 1671]], "date": "2022-02-08T19:38:24+00:00", "span_values": ["AMD", "ETSY", "GE", "EBAY", "AIG", "PPL", "ADM"]}
{"sentence": "The Global X Cybersecurity ETF, FMC Corp, Univar Solutions Inc, Meta Platforms Inc, PPG Industries Inc, sells SPDR S&P Regional Banking ETF, Global X Copper Miners ETF, Defiance Next Gen Connectivity ETF, Alcoa Corp, ETFMG Prime Cyber Security ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Phoenix Holdings Ltd..", "spans": [[32, 35], [64, 68], [84, 98]], "date": "2022-02-07T14:38:07+00:00", "span_values": ["PPG Industries", "Meta", "FMC"]}
{"sentence": "New Purchases: FMC, UNVR, PPG, AZEK, CTV, RYF, WCC, SLVR, KLAC, CLBT, WKME, RYT, MNDY, CEMB, MU, FDX, PINS, AVPT, VGK, JD, LPSN, SMWB, TAN, EWY, BA, ICLN, BKKT, ARBE, SPRC, SOXX, INVZ, SHOP, MOMO, REE, GNRC, LCTX, UNH, XHE, VTIP, DLR, ENS, GRC, SRCL, WBA, LULU, BATT, ST, Added Positions: BUG, XLV, FB, TSM, TBLA, TBLA, AZN, FCX, PERI, XBI, SEDG, ITB, RDWR, DIS, MDT, LEN, EWZ, HAYW, JETS, CRM, SWTX, AMZN, PAVE, RADA, IS, UBER, KBUY, DOMA, OWL, ZIM, TEVA, ARKO, RUN, PYPL, WIX, MATW, ORA, ADBE, ONTO, VRNT, AMWL, WMT, SNDX, TSEM, IQV, ESLT, KMDA, NRDY, MA, DXC, GOOG, V, JNJ, SPLK, ALLT, MSFT, RSKD, PAGS, XPO, CAMT, XHB, ENPH, SSYS, BP, QQQ, BAC, EWJ, IGSB, AVGO, AUDC, IGV, IHI, SMH, PEJ, VTWO, CMG, C, DECK, RH, CHKP, GILT, GE, XLK, VPG, ZWS, ORMP, DRI, SPGI, TJX, LMND, NNOX, FROG, IBB, LVS, CRNT, Reduced Positions: KRE, COPX, JPM, PHM, ON, ABBV, CGNT, CGNT, KBWB, LNG, APTV, STZ, MOS, AAPL, SKIL, NICE, GM, PLTK, SONY, CIEN, ATH, WMG, EA, KRNT, IWM, XSOE, NXPI, SOFI, SOFI, TWNT, ADSK, CDW, PAYO, IRNT, SPY, XLE, AMD, DOX, NVMI, NTR, ICL, VRNS, ATIP, MYPS, XLI, AMP, CEVA, ITRN, MGIC, NVDA, DFS, APPS, PANW, DRIO, CYBR, SLGL, FVRR, CARR, KBA, OIH, AOS, A, ALGN, AWR, AMT, APH, ANSS, WTRG, ADP, BMI, BRK.B, BIIB, BSX, CWT, CNC, SCHW, SBS, CGEN, PRMW, WOLF, DHI, DHR, DXCM, DPZ, ECL, EW, FLS, FELE, PWFL, IEX, IDXX, ILMN, ISRG, ITRI, JBHT, JCI, LNN, LOW, MCK, MLI, NFLX, NKE, ODFL, QCOM, REGN, RMD, ROP, SJW, SILC, STN, STE, TPX, TTEK, VMI, VRTX, WTS, ANTM, WST, ZBH, EBAY, MWA, DAL, ACM, BX, AWK, AQN, VRSK, LPLA, XYL, PNR, ZTS, BABA, WMS, SYF, NNDM, KURA, AQUA, UXIN, TUFN, MEG, BEPC, COIN, ACWI, BKLN, CIBR, IGIB, EDOC, EWI, FLOT, HEDJ, INDY, IPAY, IYT, PPA, QTEC, TIP, XLB, XLY, Sold Out: FIVG, AA, HACK, OVV, PRGO, WDC, XOP, SLVRU, IVV, EB, SAIL, DT, JAMF, JAMF, PAY, PAY, FIVN, FRO, KWEB, ITMR, OB, MQ, BTAQ, GIIX, QRVO, LRCX, SWKS, VOO, HII, ATVI, PRSR, DLCA, BMRN, NBIX, LAD, SLB, FFIV, AAXJ, MAT, MOH, NOC, GIG, QDEL, DG, PTIC, RBLX, XPOA, NMMC, INCY, OLED, XLC, HALO, SPYV, OPK, CASY, EWT, EWUS, CNHI, DE, BGNE, DSPG, KBE, SAIA, TLT, HOLX, ALNY, RRX, ARKK, MITC, FPAC, FPAC, SIG, TRMB, FRSX, URGN, SNAP, PODD, RDHL, ZNGA,Story continuesWarning!", "spans": [[15, 18], [728, 730], [910, 912], [993, 996], [1020, 1023], [1196, 1199], [1473, 1477]], "date": "2022-02-07T14:38:07+00:00", "span_values": ["EBAY", "AMD", "GM", "CDW", "ADP", "FMC", "GE"]}
{"sentence": "Macom Technology (NASDAQ:MTSI) STMicroelectronics (NYSE:STM) Seagate (NASDAQ:STX) Tesla (NASDAQ:TSLA)", "spans": [[61, 68], [82, 87]], "date": "2022-02-07T11:00:30+00:00", "span_values": ["Tesla", "Seagate"]}
{"sentence": "Western Digital (NASDAQ:WDC)Tech Stocks to Buy: Intel (INTC)", "spans": [[0, 15], [48, 53]], "date": "2022-02-07T11:00:30+00:00", "span_values": ["Intel", "Western Digital"]}
{"sentence": "Toshiba will also sell a 55% stake in air-conditioning business Toshiba Carrier Corp. to its U.S. joint venture partner Carrier Global Corp. for about 100 billion yen, it said earlier Monday.(Updates throughout)Most Read from Bloomberg BusinessweekThe Rise of the $2.5 Billion Ugly-Shoe Empire Nurses Who Faced Lawsuits for Quitting Are Fighting Back New Airline Bets You’ll Stop in Alaska for a Cheaper Flight to Asia Merck’s Covid Pill Fumble Gives Pfizer Potential $17 Billion Win First Black Woman Picked for Fed Draws GOP Fire Over Research©2022 Bloomberg L.P.", "spans": [[72, 79], [120, 127], [419, 424], [451, 457]], "date": "2022-02-07T03:58:30+00:00", "span_values": ["Carrier", "Pfizer", "Merck"]}
{"sentence": "We will take a look at SS&C Technologies Holdings, Inc. (NASDAQ:SSNC), Teleflex Incorporated (NYSE:TFX), Domino's Pizza, Inc. (NYSE:DPZ), J.B. Hunt Transport Services, Inc. (NASDAQ:JBHT), Pembina Pipeline Corp (NYSE:PBA), Western Digital Corporation (NASDAQ:WDC), and Pool Corporation (NASDAQ:POOL).", "spans": [[71, 79], [105, 113], [138, 147], [222, 237], [268, 284]], "date": "2022-02-06T21:33:09+00:00", "span_values": ["Domino's", "Western Digital", "J.B. Hunt", "Teleflex", "Pool Corporation"]}
{"sentence": "These stocks are J.B. Hunt Transport Services, Inc. (NASDAQ:JBHT), Pembina Pipeline Corp (NYSE:PBA), Western Digital Corporation (NASDAQ:WDC), Pool Corporation (NASDAQ:POOL), Shinhan Financial Group Co., Ltd. (NYSE:SHG), Rollins, Inc. (NYSE:ROL), and Genuine Parts Company (NYSE:GPC).", "spans": [[17, 26], [101, 116], [143, 159], [221, 228], [251, 264]], "date": "2022-02-06T20:52:54+00:00", "span_values": ["Rollins", "Western Digital", "J.B. Hunt", "Pool Corporation", "Genuine Parts"]}
{"sentence": "These stocks are Pool Corporation (NASDAQ:POOL), Shinhan Financial Group Co., Ltd. (NYSE:SHG), Rollins, Inc. (NYSE:ROL), Genuine Parts Company (NYSE:GPC), Nuance Communications Inc. (NASDAQ:NUAN), CMS Energy Corporation (NYSE:CMS), and Principal Financial Group Inc (NASDAQ:PFG).", "spans": [[17, 33], [95, 102], [121, 134], [197, 207], [236, 245]], "date": "2022-02-04T22:05:26+00:00", "span_values": ["Principal", "Rollins", "Genuine Parts", "Pool Corporation", "CMS Energy"]}
{"sentence": "Greenwood, SC, based Investment company Greenwood Capital Associates Llc (Current Portfolio) buys iShares MSCI Global Min Vol Factor ETF, iShares Core MSCI Total International Stock ETF, iShares Core MSCI Europe ETF, iShares Global Energy ETF, iShares MSCI Taiwan ETF, sells Vanguard FTSE Europe ETF, iShares Core MSCI Emerging Markets ETF, Chewy Inc, Invesco China Technology ETF, iShares MSCI EAFE Small-Cap ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Greenwood Capital Associates Llc.", "spans": [[106, 110], [151, 155], [200, 204], [252, 256], [314, 318], [352, 359], [390, 394]], "date": "2022-02-03T22:38:42+00:00", "span_values": ["MSCI", "Invesco"]}
{"sentence": "New Purchases: ACWV, IEUR, IXC, EWT, EWY, ASHR, TWTR, SPLV, XLE, VIAC, ACWX, NEM, DVY, CCRD, ESPO, TSLA, UNH, XME, VEA, CVS, T, UNP, NSC, MHK, Added Positions: IXUS, IVV, WDC, CSCO, GTLS, PYPL, CTLT, EUFN, SPLK, SHY, INTC, AGG, IJH, CVX, HON, MS, DIS, DBX, EFV, GILD, RIO, DUK, JNJ, SWKH, SCCO, AVGO, STOR, GVI, ICSH, PFF, TFC, MU, VZ, ICAD, INFU, PRTS, FB, ABBV, GLPI, MGNI, DOW, CLAR, CUTR, FITB, GSK, IBM, IPG, MRK, PFG, RF, SPG, NLOK, USB, CTLP, UTI, WBA, CDNA, LYB, MX, KHC, AGR, JHG, SJNK, VNQ, APYX, CHDN, COLM, DGII, IMMR, KMB, LEG, MTZ, NVDA, NWL, PG, THO, UCTT, WSM, OPRX, V, GOOG, PETQ, SDGR, ADBE, FIX, CNMD, DHR, XOM, FBNC, GRMN, GIS, HBIO, VIAV, MDT, RGEN, SWIR, SBUX, TSCO, PGTI, LIQT, ENV, GMED, ICLR, MODN, HASI, NEP, ELF, ESGD, IWM, SPY, Reduced Positions: IEMG, IXJ, ICLN, PEP, FANG, TER, TAP, XLF, BOTZ, XLV, QCOM, HD, IGSB, PFE, LOW, CDMO, GNRC, WMT, NTR, ESGU, TOTL, VMC, UPS, COP, STE, JPM, EHC, TMO, XLK, LLY, JYNT, EXPE, NEE, CCI, XLI, EOG, LQD, EXAS, CIBR, ASPN, STX, MA, GDX, FCCO, QAI, ZTS, SSB, SIRI, Sold Out: VGK, CHWY, CQQQ, SCZ, MMM, SPXC, IHI, HSC, XBI, FDS, TPIC, SON, PGX, EA, TFLO,IXUS 15-Year Financial Data The intrinsic value of IXUS Peter Lynch Chart of IXUSFor the details of GREENWOOD CAPITAL ASSOCIATES LLC's stock buys and sells,go to Story continuesThese are the top 5 holdings of GREENWOOD CAPITAL ASSOCIATES LLCMicrosoft Corp (MSFT) - 74,131 shares, 3.53% of the total portfolio.", "spans": [[376, 379], [404, 407]], "date": "2022-02-03T22:38:42+00:00", "span_values": ["DOW", "IBM"]}
{"sentence": "Zacks Industry Outlook Highlights: NetApp, Western Digital and Pure Storage.", "spans": [[35, 41], [43, 58]], "date": "2022-02-03T09:42:09+00:00", "span_values": ["Western Digital", "NetApp"]}
{"sentence": "For Immediate ReleaseChicago, IL – February 3, 2022 – Today, Zacks Equity Research discusses NetApp NTAP, Western Digital WDC and Pure Storage PSTG.Industry: Computer - StorageLink: The Zacks Computer-Storage Devices industry is benefitting from encouraging trends in PC shipments and solid momentum in cloud computing, Internet of Things (IoT), auto, connected devices, virtual reality and Artificial Intelligence (AI).", "spans": [[93, 99], [106, 121]], "date": "2022-02-03T09:42:09+00:00", "span_values": ["Western Digital", "NetApp"]}
{"sentence": "This is favoring the prospects of prominent industry players like NetApp, Western Digital and Pure Storage.", "spans": [[66, 72], [74, 89]], "date": "2022-02-03T09:42:09+00:00", "span_values": ["Western Digital", "NetApp"]}
{"sentence": "Rapid adoption of Microsoft Azure NetApp Files is a tailwind.", "spans": [[18, 27], [34, 40]], "date": "2022-02-03T09:42:09+00:00", "span_values": ["Microsoft", "NetApp"]}
{"sentence": "We will take a look at Teleflex Incorporated (NYSE:TFX), Domino's Pizza, Inc. (NYSE:DPZ), J.B. Hunt Transport Services, Inc. (NASDAQ:JBHT), Pembina Pipeline Corp (NYSE:PBA), Western Digital Corporation (NASDAQ:WDC), Pool Corporation (NASDAQ:POOL), and Shinhan Financial Group Co., Ltd. (NYSE:SHG).", "spans": [[23, 31], [57, 65], [90, 99], [174, 189], [216, 232]], "date": "2022-02-02T20:39:14+00:00", "span_values": ["Domino's", "Western Digital", "J.B. Hunt", "Teleflex", "Pool Corporation"]}
{"sentence": "This is favoring the prospects of prominent industry players like NetApp NTAP, Western Digital WDC and Pure Storage PSTG.", "spans": [[66, 72], [79, 94]], "date": "2022-02-02T14:10:02+00:00", "span_values": ["Western Digital", "NetApp"]}
{"sentence": "Rapid adoption of Microsoft Azure NetApp Files is a tailwind.", "spans": [[18, 27], [34, 40]], "date": "2022-02-02T14:10:02+00:00", "span_values": ["Microsoft", "NetApp"]}
{"sentence": "AGF Investments LLC Buys Health Care Select Sector SPDR, Financial Select Sector SPDR, The .... Investment company AGF Investments LLC (Current Portfolio) buys Health Care Select Sector SPDR, Financial Select Sector SPDR, The Energy Select Sector SPDR Fund, Paratek Pharmaceuticals Inc, Hello Group Inc, sells Industrial Select Sector SPDR, Consumer Staples Select Sector SPDR, Utilities Select Sector SPDR ETF, Microsoft Corp, UnitedHealth Group Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, AGF Investments LLC.", "spans": [[412, 421], [428, 446]], "date": "2022-02-02T02:38:10+00:00", "span_values": ["Microsoft", "UnitedHealth Group"]}
{"sentence": "New Purchases: PRTK, MOMO, IQ, BZUN, PGEN, ABT, BHVN, WDC, WST, SON, SRCL, PRGO, MTN, MIDD, GWW, HFC, WM, THG, AWI, VMW, EFX, MRTX, WH, BXP, BLL, CINF, FIS, UAL, MRNA, ELAN, BYND, RKT, GE, GDDY, GME, ZBRA, CP, MTD, U, PWR, COO, OC, GRMN, YUM, SWKS, BLDR, TOL, TMO, TEAM, UGI, CNXC, AGCO, C, HUBS, JHG, ISRG, BKNG, CAT, NXST, CHK, RWX, PFF, ONL, DOW, SRC, XYL, WBA, UNM, UBSI, NWL, HIW, INGR, CAG, NNN, AB, ADC, Added Positions: XLV, XLF, XLE, XLK, XLB, XLY, CERN, IDA, BMY, HAS, LH, WU, SLG, BIIB, DLB, VIR, CVS, LLY, MKTX, ANTM, VVV, XLRE, ALKS, ALL, CTXS, CCI, DHR, XOM, FCFS, IBM, IDXX, IP, THO, WTM, LOPE, FIVN, PEN, DBX, MMM, T, SRPT, DOX, NLY, AIZ, BAX, BDX, VIAC, CSX, CRUS, CLX, CTSH, CMI, DTE, DPZ, DUK, EA, EXEL, GILD, EQC, HOG, HELE, HRL, IRM, SJM, ZD, JKHY, LMT, MAT, MMS, MCY, NYT, NEU, NI, NOC, NUAN, PKG, PSA, DGX, SBAC, SHW, SLGN, SNA, WEN, UTHR, DIS, EVRG, WEC, BR, PM, AGNC, DG, BWXT, NLSN, KMI, HII, SPLK, BFAM, ZTS, SAIC, AAL, TMX, BKI, OLLI, ZM, OTIS, DNB, ACAD, APD, AKAM, AFG, AJG, ADP, BRK.B, CACI, CPT, CPB, LUMN, CVX, CME, CHD, CBSH, ED, DLR, DD, EQT, FFIV, NEE, FCN, FLO, GIS, HRB, HAIN, HIG, KR, LECO, MMC, MAS, NDAQ, NYCB, NEM, NSC, PNM, PAYX, PBCT, PGR, RSG, POOL, STX, SCI, SO, LSI, TGT, TYL, CUBE, UMBF, VRSN, VRNT, VZ, VRTX, VNO, WMB, DEI, DISCK, CBOE, BAH, PNR, MUSA, PINC, KEYS, VIRT, MDB, FOXA, LEVI, IEP, AMT, CAH, EPD, ERIE, LEG, MMP, OHI, OMC, ORCL, PNW, QDEL, TROW, VLO, WSM, CQP, AWK, STWD, TRGP, PSX, CWEN, ETRN, BTAL, IAGG, SPAB, SPLG, Reduced Positions: XLI, XLP, XLU, XLC, MSFT, UNH, LNG, SPGI, ACC, AAPL, HBAN, MSM, NVDA, HBI, AMZN, CRM, CHTR, JLL, MCD, TSLA, ACI, GOOGL, HOLX, FB, ABBV, HPE, ADBE, OZK, BBY, CBRE, HD, MRK, FHB, ACN, AMGN, BAC, CTRA, CSCO, KO, CMCSA, CPRT, EXPD, FDX, ITW, INTU, JPM, JNJ, JNPR, MAN, NFLX, ES, PH, PKI, PFE, PG, REGN, NLOK, TXN, WAT, MA, LULU, MSCI, V, NEWR, VICI, CB, ABMD, AMD, BWA, BC, CMA, COP, COST, DHI, DE, EIX, ETR, HSY, HPQ, INTC, IPG, K, KMB, LOW, MPW, MDT, MU, NFG, OKE, PPL, PRU, PEG, QCOM, WRK, ROK, SNX, SNPS, WMT, WHR, XRX, ET, TMUS, AVGO, MPC, HTA, GOOG, MGP, FTV, BKR, SLVM, KD, AGG, GII, GLIF, LQD, SPDW, Sold Out: BLUE, THS, AZO, COR, ALLO, BPMC, KNX, KSU, JCI, ITRI, LSTR, ICE, INCY, GGG, NTAP, EXR, EXAS, AGIO, PNFP, SUI, VMC, RF, RMD, RHI, RGLD, TTC, TREE, IONS, AEE, AMP, CMS, D, FIVE, FNF, TPL, TXT, EBAY, EMN, DKS, JEF, UHAL, GXO, VEEV, SQ, SNDR, EVR, CCSI, HCA, SYF, OGN, ATVI, ADS, GNRC, ADSK, NUS, GM, CL, TPR, FRT, LNT, DTM, CNI, GDS, SR, PEP, BEP, CONE, STAG,Story continuesWarning!", "spans": [[152, 155], [185, 187], [345, 348], [579, 582], [671, 674], [698, 701], [967, 971], [1005, 1008], [1280, 1284], [1655, 1659], [1823, 1827], [1854, 1857], [1961, 1964], [2303, 2307], [2405, 2407]], "date": "2022-02-02T02:38:10+00:00", "span_values": ["DTE", "DOW", "FIS", "AMD", "PPL", "EBAY", "GM", "CBOE", "CBRE", "MSCI", "IBM", "OTIS", "ADP", "GE", "CSX"]}
{"sentence": ".... Jacksonville, FL, based Investment company Augustine Asset Management Inc (Current Portfolio) buys Invesco Optimum Yield Diversified Commodity, Global Payments Inc, Micron Technology Inc, TotalEnergies SE, abrdn Bloomberg All Commodity Strategy K-1 Free ET, sells International Business Machines Corp, Western Digital Corp, SPDR Gold Shares ETF, iShares Silver Trust, AT&T Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Augustine Asset Management Inc.", "spans": [[104, 111], [149, 164], [170, 176], [307, 322], [373, 377]], "date": "2022-02-01T22:38:09+00:00", "span_values": ["Global Payments", "Western Digital", "AT&T", "Micron", "Invesco"]}
{"sentence": "New Purchases: MU, BCI, VZ, MTUM, BKR, EIX, SPHQ, XLU, DVN, GOOGL, WMT, MPC, Added Positions: PDBC, GPN, TTE, RDS.A, ERIC, MRK, APTV, IBN, ECL, CG, NKE, XLE, SPSB, IGIB, MDT, INTC, CSX, IRM, BDX, EXR, Reduced Positions: GLD, SLV, T, SNY, BMY, NVDA, BTI, IVW, CAH, LFC, VTI, FNF, DISCA, BRK.B, AMZN, HD, FB, TFC, AES, Sold Out: IBM, WDC, SYY, VEDL,Warning!", "spans": [[181, 184], [312, 315], [327, 330]], "date": "2022-02-01T22:38:09+00:00", "span_values": ["AES", "IBM", "CSX"]}
{"sentence": "Investment company Financial Sense Advisors, Inc. (Current Portfolio) buys VanEck Morningstar Wide Moat ETF, Boston Scientific Corp, BTC iShares MSCI USA Quality Factor ETF, Becton, Dickinson and Co, iShares Silver Trust, sells iShares 20+ Year Treasury Bond ETF, iShares 0-5 Year High Yield Corporate Bond ETF, ISHARES TRUST, iShares Core MSCI Total International Stock ETF, SPDR S&P Bank ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Financial Sense Advisors, Inc..", "spans": [[109, 126], [145, 149], [340, 344]], "date": "2022-01-31T22:38:16+00:00", "span_values": ["Boston Scientific", "MSCI"]}
